roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
  M0S_SGPIO_INPUT_IRQn              =  4,  /*!<   4  SGPIO input bit match interrupt                           */
  M0S_SGPIO_MATCH_IRQn              =  5,  /*!<   5  SGPIO pattern match interrupt                             */
  M0S_SGPIO_SHIFT_IRQn              =  6,  /*!<   6  SGPIO shift clock interrupt                               */
  M0S_SGPIO_POS_IRQn                =  7,  /*!<   7  SGPIO capture clock interrupt                             */
  M0S_USB0_IRQn                     =  8,  /*!<   8  OTG interrupt                                             */
  M0S_USB1_IRQn                     =  9,  /*!<   9  USB1 interrupt                                            */
  M0S_SCT_IRQn                      = 10,  /*!<  10  SCT combined interrup                                     */
  M0S_RITIMER_IRQn                  = 11,  /*!<  11  RI timer interrupt                                        */
  M0S_GINT1_IRQn                    = 12,  /*!<  12  GPIO global interrupt 1                                   */
  M0S_TIMER1_IRQn                   = 13,  /*!<  13  Timer 1 interrupt                                         */
  M0S_TIMER2_IRQn                   = 14,  /*!<  14  Timer 2 interrupt                                         */
  M0S_PIN_INT5_IRQn                 = 15,  /*!<  15  GPIO pin interrupt 5                                      */
  M0S_MCPWM_IRQn                    = 16,  /*!<  16  Motor control PWM interrupt                               */
  M0S_ADC0_IRQn                     = 17,  /*!<  17  ADC0 interrupt                                            */
  M0S_I2C0_IRQn                     = 18,  /*!<  18  I2C0 interrupt                                            */
  M0S_I2C1_IRQn                     = 19,  /*!<  19  I2C1 interrupt                                            */
  M0S_SPI_IRQn                      = 20,  /*!<  20  SPI interrupt                                             */
  M0S_ADC1_IRQn                     = 21,  /*!<  21  ADC1 interrupt                                            */
  M0S_SSP0_OR_SSP1_IRQn             = 22,  /*!<  22  SSP0, SSP1 ORed interrupt                                 */
  M0S_EVENTROUTER_IRQn              = 23,  /*!<  23  Event router interrupt                                    */
  M0S_USART0_IRQn                   = 24,  /*!<  24  USART0 interrupt                                          */
  M0S_UART1_IRQn                    = 25,  /*!<  25  Modem/UART1 interrupt                                     */
  MS0_USART2_OR_C_CAN1_IRQn         = 26,  /*!<  26  USART2, C_CAN1 ORed interrupt                             */
  M0S_USART3_IRQn                   = 27,  /*!<  27  USART3 interrupt                                          */
  M0S_I2S0_OR_I2S1_OR_QEI_IRQn      = 28,  /*!<  28  I2S0, I2S1, QEI ORed interrupt                            */
  M0S_C_CAN0_IRQn                   = 29,  /*!<  29  C_CAN0 interrupt                                          */
  M0S_SPIFI_OR_ADCHS_IRQn           = 30,  /*!<  30  SPIFI, ADCHS ORed interrupt                               */
  M0S_M0APP_IRQn                    = 31,  /*!<  31  M0APP core interrupt                                      */
#endif
} IRQn_Type;

 /* Event Router Input (ERI) Number Definitions */
typedef enum {
  WAKEUP0_ERIn                      = 0,
  WAKEUP1_ERIn                      = 1,
  WAKEUP2_ERIn                      = 2,
  WAKEUP3_ERIn                      = 3,
  ATIMER_ERIn                       = 4,
  RTC_ERIn                          = 5,
  BOD1_ERIn                         = 6,  /* Bod trip 1 */
  WWDT_ERIn                         = 7,
  ETH_ERIn                          = 8,
  USB0_ERIn                         = 9,
  USB1_ERIn                         = 10,
  SDIO_ERIn                         = 11,
  CAN_ERIn                          = 12, /* CAN0/1 or'ed */
  TIM2_ERIn                         = 13,
  TIM6_ERIn                         = 14,
  QEI_ERIn                          = 15,
  TIM14_ERIn                        = 16,
  RESERVED0_ERIn                    = 17, /* M0s */
  RESERVED1_ERIn                    = 18, /* M3/M4 */
  RESET_ERIn                        = 19
}ERIn_Type;

/** @addtogroup Configuration_of_CMSIS
  * @{
  */


/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

#if defined CORE_M4
/* ----------------Configuration of the Cortex-M4 Processor and Core Peripherals---------------- */
#define __CM4_REV                 0x0000            /*!< Cortex-M4 Core Revision                                               */
#define __MPU_PRESENT                  1            /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS               3            /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig         0            /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT                  1            /*!< FPU present or not                                                    */

#include "core_cm4.h"                               /*!< Cortex-M4 processor and core peripherals                              */
#endif

#if defined CORE_M0 || defined CORE_M0SUB
/* ----------------Configuration of the Cortex-M0 Processor and Core Peripherals---------------- */
#define __MPU_PRESENT             0                 /*!< MPU present or not                                                    */
#define __NVIC_PRIO_BITS          2                 /*!< Number of Bits used for Priority Levels                               */
#define __Vendor_SysTickConfig    0                 /*!< Set to 1 if different SysTick Config is used                          */
#define __FPU_PRESENT             0                 /*!< FPU present or not                                                    */

#include "core_cm0.h"                               /*!< Cortex-M4 processor and core peripherals                              */
#endif

/** @} */ /* End of group Configuration_of_CMSIS */
#include "system_LPC43xx.h"                         /*!< LPC43xx System                                                        */


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */


/** @addtogroup Device_Peripheral_Registers
  * @{
  */


/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif



/* ================================================================================ */
/* ================                       SCT                      ================ */
/* ================================================================================ */

/**
  * @brief State Configurable Timer (SCT) with dither engine  (SCT)
  */

