roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
#define CONFIG_SCT_nEV   (16)			/*!< Number of events */
#define CONFIG_SCT_nRG   (16)			/*!< Number of match/compare registers */
#define CONFIG_SCT_nOU   (16)			/*!< Number of outputs */

typedef struct {
	__IO  uint32_t CONFIG;				/*!< Configuration Register */
	union {
		__IO uint32_t CTRL_U;			/*!< Control Register */
		struct {
			__IO uint16_t CTRL_L;		/*!< Low control register */
			__IO uint16_t CTRL_H;		/*!< High control register */
		};

	};

	__IO uint16_t LIMIT_L;				/*!< limit register for counter L */
	__IO uint16_t LIMIT_H;				/*!< limit register for counter H */
	__IO uint16_t HALT_L;				/*!< halt register for counter L */
	__IO uint16_t HALT_H;				/*!< halt register for counter H */
	__IO uint16_t STOP_L;				/*!< stop register for counter L */
	__IO uint16_t STOP_H;				/*!< stop register for counter H */
	__IO uint16_t START_L;				/*!< start register for counter L */
	__IO uint16_t START_H;				/*!< start register for counter H */
	uint32_t RESERVED1[10];				/*!< 0x03C reserved */
	union {
		__IO uint32_t COUNT_U;			/*!< counter register */
		struct {
			__IO uint16_t COUNT_L;		/*!< counter register for counter L */
			__IO uint16_t COUNT_H;		/*!< counter register for counter H */
		};

	};

	__IO uint16_t STATE_L;				/*!< state register for counter L */
	__IO uint16_t STATE_H;				/*!< state register for counter H */
	__I  uint32_t INPUT;				/*!< input register */
	__IO uint16_t REGMODE_L;			/*!< match - capture registers mode register L */
	__IO uint16_t REGMODE_H;			/*!< match - capture registers mode register H */
	__IO uint32_t OUTPUT;				/*!< output register */
	__IO uint32_t OUTPUTDIRCTRL;		/*!< output counter direction Control Register */
	__IO uint32_t RES;					/*!< conflict resolution register */
	__IO uint32_t DMA0REQUEST;			/*!< DMA0 Request Register */
	__IO uint32_t DMA1REQUEST;			/*!< DMA1 Request Register */
	uint32_t RESERVED2[35];
	__IO uint32_t EVEN;					/*!< event enable register */
	__IO uint32_t EVFLAG;				/*!< event flag register */
	__IO uint32_t CONEN;				/*!< conflict enable register */
	__IO uint32_t CONFLAG;				/*!< conflict flag register */
	union {
		__IO union {					/*!< ... Match / Capture value */
			uint32_t U;					/*!<       SCTMATCH[i].U  Unified 32-bit register */
			struct {
				uint16_t L;				/*!<       SCTMATCH[i].L  Access to L value */
				uint16_t H;				/*!<       SCTMATCH[i].H  Access to H value */
			};

		} MATCH[CONFIG_SCT_nRG];

		__I union {
			uint32_t U;					/*!<       SCTCAP[i].U  Unified 32-bit register */
			struct {
				uint16_t L;				/*!<       SCTCAP[i].L  Access to L value */
				uint16_t H;				/*!<       SCTCAP[i].H  Access to H value */
			};

		} CAP[CONFIG_SCT_nRG];

	};

	uint32_t RESERVED3[32 - CONFIG_SCT_nRG];		/*!< ...-0x17C reserved */
	union {
		__IO uint16_t MATCH_L[CONFIG_SCT_nRG];		/*!< 0x180-... Match Value L counter */
		__I  uint16_t CAP_L[CONFIG_SCT_nRG];		/*!< 0x180-... Capture Value L counter */
	};

	uint16_t RESERVED4[32 - CONFIG_SCT_nRG];		/*!< ...-0x1BE reserved */
	union {
		__IO uint16_t MATCH_H[CONFIG_SCT_nRG];		/*!< 0x1C0-... Match Value H counter */
		__I  uint16_t CAP_H[CONFIG_SCT_nRG];		/*!< 0x1C0-... Capture Value H counter */
	};

	uint16_t RESERVED5[32 - CONFIG_SCT_nRG];		/*!< ...-0x1FE reserved */
	union {
		__IO union {					/*!< 0x200-... Match Reload / Capture Control value */
			uint32_t U;					/*!<       SCTMATCHREL[i].U  Unified 32-bit register */
			struct {
				uint16_t L;				/*!<       SCTMATCHREL[i].L  Access to L value */
				uint16_t H;				/*!<       SCTMATCHREL[i].H  Access to H value */
			};

		} MATCHREL[CONFIG_SCT_nRG];

		__IO union {
			uint32_t U;					/*!<       SCTCAPCTRL[i].U  Unified 32-bit register */
			struct {
				uint16_t L;				/*!<       SCTCAPCTRL[i].L  Access to L value */
				uint16_t H;				/*!<       SCTCAPCTRL[i].H  Access to H value */
			};

		} CAPCTRL[CONFIG_SCT_nRG];

	};

	uint32_t RESERVED6[32 - CONFIG_SCT_nRG];		/*!< ...-0x27C reserved */
	union {
		__IO uint16_t MATCHREL_L[CONFIG_SCT_nRG];	/*!< 0x280-... Match Reload value L counter */
		__IO uint16_t CAPCTRL_L[CONFIG_SCT_nRG];	/*!< 0x280-... Capture Control value L counter */
	};

	uint16_t RESERVED7[32 - CONFIG_SCT_nRG];		/*!< ...-0x2BE reserved */
	union {
		__IO uint16_t MATCHREL_H[CONFIG_SCT_nRG];	/*!< 0x2C0-... Match Reload value H counter */
		__IO uint16_t CAPCTRL_H[CONFIG_SCT_nRG];	/*!< 0x2C0-... Capture Control value H counter */
	};

	uint16_t RESERVED8[32 - CONFIG_SCT_nRG];		/*!< ...-0x2FE reserved */
	__IO struct {						/*!< 0x300-0x3FC  SCTEVENT[i].STATE / SCTEVENT[i].CTRL*/
		uint32_t STATE;					/*!< Event State Register */
		uint32_t CTRL;					/*!< Event Control Register */
	} EVENT[CONFIG_SCT_nEV];

	uint32_t RESERVED9[128 - 2 * CONFIG_SCT_nEV];	/*!< ...-0x4FC reserved */
	__IO struct {						/*!< 0x500-0x57C  SCTOUT[i].SET / SCTOUT[i].CLR */
		uint32_t SET;					/*!< Output n Set Register */
		uint32_t CLR;					/*!< Output n Clear Register */
	} OUT[CONFIG_SCT_nOU];

	uint32_t RESERVED10[191 - 2 * CONFIG_SCT_nOU];	/*!< ...-0x7F8 reserved */
	__I  uint32_t MODULECONTENT;		/*!< 0x7FC Module Content */
} LPC_SCT_Type;


/* ================================================================================ */
/* ================                      GPDMA                     ================ */
/* ================================================================================ */


/**
  * @brief General Purpose DMA (GPDMA)  (GPDMA)
  */

typedef struct {                                    /*!< (@ 0x40002000) GPDMA Structure                                        */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x40002000) DMA Interrupt Status Register                          */
  __I  uint32_t  INTTCSTAT;                         /*!< (@ 0x40002004) DMA Interrupt Terminal Count Request Status Register   */
  __O  uint32_t  INTTCCLEAR;                        /*!< (@ 0x40002008) DMA Interrupt Terminal Count Request Clear Register    */
  __I  uint32_t  INTERRSTAT;                        /*!< (@ 0x4000200C) DMA Interrupt Error Status Register                    */
  __O  uint32_t  INTERRCLR;                         /*!< (@ 0x40002010) DMA Interrupt Error Clear Register                     */
  __I  uint32_t  RAWINTTCSTAT;                      /*!< (@ 0x40002014) DMA Raw Interrupt Terminal Count Status Register       */
  __I  uint32_t  RAWINTERRSTAT;                     /*!< (@ 0x40002018) DMA Raw Error Interrupt Status Register                */
  __I  uint32_t  ENBLDCHNS;                         /*!< (@ 0x4000201C) DMA Enabled Channel Register                           */
  __IO uint32_t  SOFTBREQ;                          /*!< (@ 0x40002020) DMA Software Burst Request Register                    */
  __IO uint32_t  SOFTSREQ;                          /*!< (@ 0x40002024) DMA Software Single Request Register                   */
  __IO uint32_t  SOFTLBREQ;                         /*!< (@ 0x40002028) DMA Software Last Burst Request Register               */
  __IO uint32_t  SOFTLSREQ;                         /*!< (@ 0x4000202C) DMA Software Last Single Request Register              */
  __IO uint32_t  CONFIG;                            /*!< (@ 0x40002030) DMA Configuration Register                             */
  __IO uint32_t  SYNC;                              /*!< (@ 0x40002034) DMA Synchronization Register                           */
  __I  uint32_t  RESERVED0[50];
  __IO uint32_t  C0SRCADDR;                         /*!< (@ 0x40002100) DMA Channel Source Address Register                    */
  __IO uint32_t  C0DESTADDR;                        /*!< (@ 0x40002104) DMA Channel Destination Address Register               */
  __IO uint32_t  C0LLI;                             /*!< (@ 0x40002108) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C0CONTROL;                         /*!< (@ 0x4000210C) DMA Channel Control Register                           */
  __IO uint32_t  C0CONFIG;                          /*!< (@ 0x40002110) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED1[3];
  __IO uint32_t  C1SRCADDR;                         /*!< (@ 0x40002120) DMA Channel Source Address Register                    */
  __IO uint32_t  C1DESTADDR;                        /*!< (@ 0x40002124) DMA Channel Destination Address Register               */
  __IO uint32_t  C1LLI;                             /*!< (@ 0x40002128) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C1CONTROL;                         /*!< (@ 0x4000212C) DMA Channel Control Register                           */
  __IO uint32_t  C1CONFIG;                          /*!< (@ 0x40002130) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED2[3];
  __IO uint32_t  C2SRCADDR;                         /*!< (@ 0x40002140) DMA Channel Source Address Register                    */
  __IO uint32_t  C2DESTADDR;                        /*!< (@ 0x40002144) DMA Channel Destination Address Register               */
  __IO uint32_t  C2LLI;                             /*!< (@ 0x40002148) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C2CONTROL;                         /*!< (@ 0x4000214C) DMA Channel Control Register                           */
  __IO uint32_t  C2CONFIG;                          /*!< (@ 0x40002150) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED3[3];
  __IO uint32_t  C3SRCADDR;                         /*!< (@ 0x40002160) DMA Channel Source Address Register                    */
  __IO uint32_t  C3DESTADDR;                        /*!< (@ 0x40002164) DMA Channel Destination Address Register               */
  __IO uint32_t  C3LLI;                             /*!< (@ 0x40002168) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C3CONTROL;                         /*!< (@ 0x4000216C) DMA Channel Control Register                           */
  __IO uint32_t  C3CONFIG;                          /*!< (@ 0x40002170) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED4[3];
  __IO uint32_t  C4SRCADDR;                         /*!< (@ 0x40002180) DMA Channel Source Address Register                    */
  __IO uint32_t  C4DESTADDR;                        /*!< (@ 0x40002184) DMA Channel Destination Address Register               */
  __IO uint32_t  C4LLI;                             /*!< (@ 0x40002188) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C4CONTROL;                         /*!< (@ 0x4000218C) DMA Channel Control Register                           */
  __IO uint32_t  C4CONFIG;                          /*!< (@ 0x40002190) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED5[3];
  __IO uint32_t  C5SRCADDR;                         /*!< (@ 0x400021A0) DMA Channel Source Address Register                    */
  __IO uint32_t  C5DESTADDR;                        /*!< (@ 0x400021A4) DMA Channel Destination Address Register               */
  __IO uint32_t  C5LLI;                             /*!< (@ 0x400021A8) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C5CONTROL;                         /*!< (@ 0x400021AC) DMA Channel Control Register                           */
  __IO uint32_t  C5CONFIG;                          /*!< (@ 0x400021B0) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED6[3];
  __IO uint32_t  C6SRCADDR;                         /*!< (@ 0x400021C0) DMA Channel Source Address Register                    */
  __IO uint32_t  C6DESTADDR;                        /*!< (@ 0x400021C4) DMA Channel Destination Address Register               */
  __IO uint32_t  C6LLI;                             /*!< (@ 0x400021C8) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C6CONTROL;                         /*!< (@ 0x400021CC) DMA Channel Control Register                           */
  __IO uint32_t  C6CONFIG;                          /*!< (@ 0x400021D0) DMA Channel Configuration Register                     */
  __I  uint32_t  RESERVED7[3];
  __IO uint32_t  C7SRCADDR;                         /*!< (@ 0x400021E0) DMA Channel Source Address Register                    */
  __IO uint32_t  C7DESTADDR;                        /*!< (@ 0x400021E4) DMA Channel Destination Address Register               */
  __IO uint32_t  C7LLI;                             /*!< (@ 0x400021E8) DMA Channel Linked List Item Register                  */
  __IO uint32_t  C7CONTROL;                         /*!< (@ 0x400021EC) DMA Channel Control Register                           */
  __IO uint32_t  C7CONFIG;                          /*!< (@ 0x400021F0) DMA Channel Configuration Register                     */
} LPC_GPDMA_Type;


/* ================================================================================ */
/* ================                      SPIFI                     ================ */
/* ================================================================================ */


/**
  * @brief SPI Flash Interface (SPIFI) (SPIFI)
  */

