roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
typedef struct {                                    /*!< (@ 0x40043000) CREG Structure                                         */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CREG0;                             /*!< (@ 0x40043004) Chip configuration register 32 kHz oscillator
                                                         output and BOD control register.                                      */
  __I  uint32_t  RESERVED1[62];
  __IO uint32_t  M4MEMMAP;                          /*!< (@ 0x40043100) ARM Cortex-M4 memory mapping                           */
  __I  uint32_t  RESERVED2[5];
  __IO uint32_t  CREG5;                             /*!< (@ 0x40043118) Chip configuration register 5. Controls JTAG
                                                         access.                                                               */
  __IO uint32_t  DMAMUX;                            /*!< (@ 0x4004311C) DMA mux control                                        */
  __IO uint32_t  FLASHCFGA;                         /*!< (@ 0x40043120) Flash accelerator configuration register for
                                                         flash bank A                                                          */
  __IO uint32_t  FLASHCFGB;                         /*!< (@ 0x40043124) Flash accelerator configuration register for
                                                         flash bank B                                                          */
  __IO uint32_t  ETBCFG;                            /*!< (@ 0x40043128) ETB RAM configuration                                  */
  __IO uint32_t  CREG6;                             /*!< (@ 0x4004312C) Chip configuration register 6. Controls multiple
                                                         functions : Ethernet interface, SCT output, I2S0/1 inputs, EMC
                                                          clock.                                                               */
  __IO uint32_t  M4TXEVENT;                         /*!< (@ 0x40043130) Cortex-M4 TXEV event clear                             */
  __I  uint32_t  RESERVED3[51];
  __I  uint32_t  CHIPID;                            /*!< (@ 0x40043200) Part ID                                                */
  __I  uint32_t  RESERVED4[65];
  __IO uint32_t  M0SUBMEMMAP;                       /*!< (@ 0x40043308) ARM Cortex-M0SUB memory mapping                        */
  __I  uint32_t  RESERVED5[2];
  __IO uint32_t  M0SUBTXEVENT;                      /*!< (@ 0x40043314) Cortex-M0SUB TXEV event clear                          */
  __I  uint32_t  RESERVED6[58];
  __IO uint32_t  M0APPTXEVENT;                      /*!< (@ 0x40043400) Cortex-M0APP TXEV event clear                          */
  __IO uint32_t  M0APPMEMMAP;                       /*!< (@ 0x40043404) ARM Cortex-M0APP memory mapping                        */
  __I  uint32_t  RESERVED7[62];
  __IO uint32_t  USB0FLADJ;                         /*!< (@ 0x40043500) USB0 frame length adjust register                      */
  __I  uint32_t  RESERVED8[63];
  __IO uint32_t  USB1FLADJ;                         /*!< (@ 0x40043600) USB1 frame length adjust register                      */
} LPC_CREG_Type;


/* ================================================================================ */
/* ================                   EVENTROUTER                  ================ */
/* ================================================================================ */


/**
  * @brief Event router (EVENTROUTER)
  */

typedef struct {                                    /*!< (@ 0x40044000) EVENTROUTER Structure                                  */
  __IO uint32_t  HILO;                              /*!< (@ 0x40044000) Level configuration register                           */
  __IO uint32_t  EDGE;                              /*!< (@ 0x40044004) Edge configuration                                     */
  __I  uint32_t  RESERVED0[1012];
  __O  uint32_t  CLR_EN;                            /*!< (@ 0x40044FD8) Clear event enable register                            */
  __O  uint32_t  SET_EN;                            /*!< (@ 0x40044FDC) Set event enable register                              */
  __I  uint32_t  STATUS;                            /*!< (@ 0x40044FE0) Event Status register                                  */
  __I  uint32_t  ENABLE;                            /*!< (@ 0x40044FE4) Event Enable register                                  */
  __O  uint32_t  CLR_STAT;                          /*!< (@ 0x40044FE8) Clear event status register                            */
  __O  uint32_t  SET_STAT;                          /*!< (@ 0x40044FEC) Set event status register                              */
} LPC_EVENTROUTER_Type;


/* ================================================================================ */
/* ================                       RTC                      ================ */
/* ================================================================================ */


/**
  * @brief Real-Time Clock (RTC) and event recorder  (RTC)
  */

typedef struct {                                    /*!< (@ 0x40046000) RTC Structure                                          */
  __O  uint32_t  ILR;                               /*!< (@ 0x40046000) Interrupt Location Register                            */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  CCR;                               /*!< (@ 0x40046008) Clock Control Register                                 */
  __IO uint32_t  CIIR;                              /*!< (@ 0x4004600C) Counter Increment Interrupt Register                   */
  __IO uint32_t  AMR;                               /*!< (@ 0x40046010) Alarm Mask Register                                    */
  __I  uint32_t  CTIME0;                            /*!< (@ 0x40046014) Consolidated Time Register 0                           */
  __I  uint32_t  CTIME1;                            /*!< (@ 0x40046018) Consolidated Time Register 1                           */
  __I  uint32_t  CTIME2;                            /*!< (@ 0x4004601C) Consolidated Time Register 2                           */
  __IO uint32_t  SEC;                               /*!< (@ 0x40046020) Seconds Register                                       */
  __IO uint32_t  MIN;                               /*!< (@ 0x40046024) Minutes Register                                       */
  __IO uint32_t  HRS;                               /*!< (@ 0x40046028) Hours Register                                         */
  __IO uint32_t  DOM;                               /*!< (@ 0x4004602C) Day of Month Register                                  */
  __IO uint32_t  DOW;                               /*!< (@ 0x40046030) Day of Week Register                                   */
  __IO uint32_t  DOY;                               /*!< (@ 0x40046034) Day of Year Register                                   */
  __IO uint32_t  MONTH;                             /*!< (@ 0x40046038) Months Register                                        */
  __IO uint32_t  YEAR;                              /*!< (@ 0x4004603C) Years Register                                         */
  __IO uint32_t  CALIBRATION;                       /*!< (@ 0x40046040) Calibration Value Register                             */
  __I  uint32_t  RESERVED1[7];
  __IO uint32_t  ASEC;                              /*!< (@ 0x40046060) Alarm value for Seconds                                */
  __IO uint32_t  AMIN;                              /*!< (@ 0x40046064) Alarm value for Minutes                                */
  __IO uint32_t  AHRS;                              /*!< (@ 0x40046068) Alarm value for Hours                                  */
  __IO uint32_t  ADOM;                              /*!< (@ 0x4004606C) Alarm value for Day of Month                           */
  __IO uint32_t  ADOW;                              /*!< (@ 0x40046070) Alarm value for Day of Week                            */
  __IO uint32_t  ADOY;                              /*!< (@ 0x40046074) Alarm value for Day of Year                            */
  __IO uint32_t  AMON;                              /*!< (@ 0x40046078) Alarm value for Months                                 */
  __IO uint32_t  AYRS;                              /*!< (@ 0x4004607C) Alarm value for Year                                   */
  __IO uint32_t  ERSTATUS;                          /*!< (@ 0x40046080) Event Monitor/Recorder Status register. Contains
                                                         status flags for event channels and other Event Monitor/Recorder
                                                          conditions.                                                          */
  __IO uint32_t  ERCONTRO;                          /*!< (@ 0x40046084) Event Monitor/Recorder Control register. Contains
                                                         bits that control actions for the event channels as well as
                                                          for Event Monitor/Recorder setup.                                    */
  __I  uint32_t  ERCOUNTERS;                        /*!< (@ 0x40046088) Event Monitor/Recorder Counters register. Allows
                                                         reading the counters associated with the event channels.              */
  __I  uint32_t  RESERVED2;
  __I  uint32_t  ERFIRSTSTAMP0;                     /*!< (@ 0x40046090) Event Monitor/Recorder First Stamp register for
                                                         channel 0. Retains the time stamp for the first event on channel
                                                          0.                                                                   */
  __I  uint32_t  ERFIRSTSTAMP1;                     /*!< (@ 0x40046094) Event Monitor/Recorder First Stamp register for
                                                         channel 0. Retains the time stamp for the first event on channel
                                                          0.                                                                   */
  __I  uint32_t  ERFIRSTSTAMP2;                     /*!< (@ 0x40046098) Event Monitor/Recorder First Stamp register for
                                                         channel 0. Retains the time stamp for the first event on channel
                                                          0.                                                                   */
  __I  uint32_t  RESERVED3;
  __I  uint32_t  ERLASTSTAMP0;                      /*!< (@ 0x400460A0) Event Monitor/Recorder Last Stamp register for
                                                         channel 0. Retains the time stamp for the last (i.e. most recent)
                                                          event on channel 0.                                                  */
  __I  uint32_t  ERLASTSTAMP1;                      /*!< (@ 0x400460A4) Event Monitor/Recorder Last Stamp register for
                                                         channel 0. Retains the time stamp for the last (i.e. most recent)
                                                          event on channel 0.                                                  */
  __I  uint32_t  ERLASTSTAMP2;                      /*!< (@ 0x400460A8) Event Monitor/Recorder Last Stamp register for
                                                         channel 0. Retains the time stamp for the last (i.e. most recent)
                                                          event on channel 0.                                                  */
} LPC_RTC_Type;


/* ================================================================================ */
/* ================                       CGU                      ================ */
/* ================================================================================ */


/**
  * @brief Clock Generation Unit (CGU) (CGU)
  */

