roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
  __I  uint32_t  RESERVED16[28];
  __IO uint32_t  SFSUSB;                            /*!< (@ 0x40086C80) Pin configuration register for pins USB1_DM and
                                                         USB1_DP                                                               */
  __IO uint32_t  SFSI2C0;                           /*!< (@ 0x40086C84) Pin configuration register for I2C0-bus pins           */
  __IO uint32_t  ENAIO0;                            /*!< (@ 0x40086C88) ADC0 function select register                          */
  __IO uint32_t  ENAIO1;                            /*!< (@ 0x40086C8C) ADC1 function select register                          */
  __IO uint32_t  ENAIO2;                            /*!< (@ 0x40086C90) Analog function select register                        */
  __I  uint32_t  RESERVED17[27];
  __IO uint32_t  EMCDELAYCLK;                       /*!< (@ 0x40086D00) EMC clock delay register                               */
  __I  uint32_t  RESERVED18[31];
  __IO uint32_t  SDDELAY;                           /*!< (@ 0x40086D80) SD/MMC sample and drive delay register                 */
  __I  uint32_t  RESERVED19[31];
  __IO uint32_t  PINTSEL0;                          /*!< (@ 0x40086E00) Pin interrupt select register for pin interrupts
                                                         0 to 3.                                                               */
  __IO uint32_t  PINTSEL1;                          /*!< (@ 0x40086E04) Pin interrupt select register for pin interrupts
                                                         4 to 7.                                                               */
} LPC_SCU_Type;


/* ================================================================================ */
/* ================                  GPIO_PIN_INT                  ================ */
/* ================================================================================ */


/**
  * @brief GPIO pin interrupt (GPIO_PIN_INT)
  */

typedef struct {                                    /*!< (@ 0x40087000) GPIO_PIN_INT Structure                                 */
  __IO uint32_t  ISEL;                              /*!< (@ 0x40087000) Pin Interrupt Mode register                            */
  __IO uint32_t  IENR;                              /*!< (@ 0x40087004) Pin Interrupt Enable (Rising) register                 */
  __O  uint32_t  SIENR;                             /*!< (@ 0x40087008) Set Pin Interrupt Enable (Rising) register             */
  __O  uint32_t  CIENR;                             /*!< (@ 0x4008700C) Clear Pin Interrupt Enable (Rising) register           */
  __IO uint32_t  IENF;                              /*!< (@ 0x40087010) Pin Interrupt Enable Falling Edge / Active Level
                                                         register                                                              */
  __O  uint32_t  SIENF;                             /*!< (@ 0x40087014) Set Pin Interrupt Enable Falling Edge / Active
                                                         Level register                                                        */
  __O  uint32_t  CIENF;                             /*!< (@ 0x40087018) Clear Pin Interrupt Enable Falling Edge / Active
                                                         Level address                                                         */
  __IO uint32_t  RISE;                              /*!< (@ 0x4008701C) Pin Interrupt Rising Edge register                     */
  __IO uint32_t  FALL;                              /*!< (@ 0x40087020) Pin Interrupt Falling Edge register                    */
  __IO uint32_t  IST;                               /*!< (@ 0x40087024) Pin Interrupt Status register                          */
} LPC_GPIO_PIN_INT_Type;


/* ================================================================================ */
/* ================        GPIO_GROUP_INTn [GPIO_GROUP_INT0]       ================ */
/* ================================================================================ */


/**
  * @brief GPIO group interrupt 0 (GPIO_GROUP_INTn)
  */

typedef struct {                                    /*!< (@ 0x40088000) GPIO_GROUP_INTn Structure                              */
  __IO uint32_t  CTRL;                              /*!< (@ 0x40088000) GPIO grouped interrupt control register                */
  __I  uint32_t  RESERVED0[7];
  __IO uint32_t  PORT_POL0;                         /*!< (@ 0x40088020) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL1;                         /*!< (@ 0x40088024) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL2;                         /*!< (@ 0x40088028) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL3;                         /*!< (@ 0x4008802C) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL4;                         /*!< (@ 0x40088030) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL5;                         /*!< (@ 0x40088034) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL6;                         /*!< (@ 0x40088038) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_POL7;                         /*!< (@ 0x4008803C) GPIO grouped interrupt port polarity register          */
  __IO uint32_t  PORT_ENA0;                         /*!< (@ 0x40088040) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA1;                         /*!< (@ 0x40088044) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA2;                         /*!< (@ 0x40088048) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA3;                         /*!< (@ 0x4008804C) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA4;                         /*!< (@ 0x40088050) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA5;                         /*!< (@ 0x40088054) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA6;                         /*!< (@ 0x40088058) GPIO grouped interrupt port m enable register          */
  __IO uint32_t  PORT_ENA7;                         /*!< (@ 0x4008805C) GPIO grouped interrupt port m enable register          */
} LPC_GPIO_GROUP_INTn_Type;


/* ================================================================================ */
/* ================                      MCPWM                     ================ */
/* ================================================================================ */


/**
  * @brief Motor Control PWM (MOTOCONPWM)  (MCPWM)
  */

