roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
typedef struct {                                    /*!< (@ 0x400A0000) MCPWM Structure                                        */
  __I  uint32_t  CON;                               /*!< (@ 0x400A0000) PWM Control read address                               */
  __O  uint32_t  CON_SET;                           /*!< (@ 0x400A0004) PWM Control set address                                */
  __O  uint32_t  CON_CLR;                           /*!< (@ 0x400A0008) PWM Control clear address                              */
  __I  uint32_t  CAPCON;                            /*!< (@ 0x400A000C) Capture Control read address                           */
  __O  uint32_t  CAPCON_SET;                        /*!< (@ 0x400A0010) Capture Control set address                            */
  __O  uint32_t  CAPCON_CLR;                        /*!< (@ 0x400A0014) Event Control clear address                            */
  __IO uint32_t  TC0;                               /*!< (@ 0x400A0018) Timer Counter register                                 */
  __IO uint32_t  TC1;                               /*!< (@ 0x400A001C) Timer Counter register                                 */
  __IO uint32_t  TC2;                               /*!< (@ 0x400A0020) Timer Counter register                                 */
  __IO uint32_t  LIM0;                              /*!< (@ 0x400A0024) Limit register                                         */
  __IO uint32_t  LIM1;                              /*!< (@ 0x400A0028) Limit register                                         */
  __IO uint32_t  LIM2;                              /*!< (@ 0x400A002C) Limit register                                         */
  __IO uint32_t  MAT0;                              /*!< (@ 0x400A0030) Match register                                         */
  __IO uint32_t  MAT1;                              /*!< (@ 0x400A0034) Match register                                         */
  __IO uint32_t  MAT2;                              /*!< (@ 0x400A0038) Match register                                         */
  __IO uint32_t  DT;                                /*!< (@ 0x400A003C) Dead time register                                     */
  __IO uint32_t  CCP;                               /*!< (@ 0x400A0040) Communication Pattern register                         */
  __I  uint32_t  CAP0;                              /*!< (@ 0x400A0044) Capture register                                       */
  __I  uint32_t  CAP1;                              /*!< (@ 0x400A0048) Capture register                                       */
  __I  uint32_t  CAP2;                              /*!< (@ 0x400A004C) Capture register                                       */
  __I  uint32_t  INTEN;                             /*!< (@ 0x400A0050) Interrupt Enable read address                          */
  __O  uint32_t  INTEN_SET;                         /*!< (@ 0x400A0054) Interrupt Enable set address                           */
  __O  uint32_t  INTEN_CLR;                         /*!< (@ 0x400A0058) Interrupt Enable clear address                         */
  __I  uint32_t  CNTCON;                            /*!< (@ 0x400A005C) Count Control read address                             */
  __O  uint32_t  CNTCON_SET;                        /*!< (@ 0x400A0060) Count Control set address                              */
  __O  uint32_t  CNTCON_CLR;                        /*!< (@ 0x400A0064) Count Control clear address                            */
  __I  uint32_t  INTF;                              /*!< (@ 0x400A0068) Interrupt flags read address                           */
  __O  uint32_t  INTF_SET;                          /*!< (@ 0x400A006C) Interrupt flags set address                            */
  __O  uint32_t  INTF_CLR;                          /*!< (@ 0x400A0070) Interrupt flags clear address                          */
  __O  uint32_t  CAP_CLR;                           /*!< (@ 0x400A0074) Capture clear address                                  */
} LPC_MCPWM_Type;


/* ================================================================================ */
/* ================                   I2Cn [I2C0]                  ================ */
/* ================================================================================ */


/**
  * @brief I2C-bus interface (I2Cn)
  */

typedef struct {                                    /*!< (@ 0x400A1000) I2Cn Structure                                         */
  __IO uint32_t  CONSET;                            /*!< (@ 0x400A1000) I2C Control Set Register. When a one is written
                                                         to a bit of this register, the corresponding bit in the I2C
                                                          control register is set. Writing a zero has no effect on the
                                                          corresponding bit in the I2C control register.                       */
  __I  uint32_t  STAT;                              /*!< (@ 0x400A1004) I2C Status Register. During I2C operation, this
                                                         register provides detailed status codes that allow software
                                                          to determine the next action needed.                                 */
  __IO uint32_t  DAT;                               /*!< (@ 0x400A1008) I2C Data Register. During master or slave transmit
                                                         mode, data to be transmitted is written to this register. During
                                                          master or slave receive mode, data that has been received may
                                                          be read from this register.                                          */
  __IO uint32_t  ADR0;                              /*!< (@ 0x400A100C) I2C Slave Address Register 0. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __IO uint32_t  SCLH;                              /*!< (@ 0x400A1010) SCH Duty Cycle Register High Half Word. Determines
                                                         the high time of the I2C clock.                                       */
  __IO uint32_t  SCLL;                              /*!< (@ 0x400A1014) SCL Duty Cycle Register Low Half Word. Determines
                                                         the low time of the I2C clock. SCLL and SCLH together determine
                                                          the clock frequency generated by an I2C master and certain times
                                                          used in slave mode.                                                  */
  __O  uint32_t  CONCLR;                            /*!< (@ 0x400A1018) I2C Control Clear Register. When a one is written
                                                         to a bit of this register, the corresponding bit in the I2C
                                                          control register is cleared. Writing a zero has no effect on
                                                          the corresponding bit in the I2C control register.                   */
  __IO uint32_t  MMCTRL;                            /*!< (@ 0x400A101C) Monitor mode control register.                         */
  __IO uint32_t  ADR1;                              /*!< (@ 0x400A1020) I2C Slave Address Register. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __IO uint32_t  ADR2;                              /*!< (@ 0x400A1024) I2C Slave Address Register. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __IO uint32_t  ADR3;                              /*!< (@ 0x400A1028) I2C Slave Address Register. Contains the 7-bit
                                                         slave address for operation of the I2C interface in slave mode,
                                                          and is not used in master mode. The least significant bit determines
                                                          whether a slave responds to the General Call address.                */
  __I  uint32_t  DATA_BUFFER;                       /*!< (@ 0x400A102C) Data buffer register. The contents of the 8 MSBs
                                                         of the DAT shift register will be transferred to the DATA_BUFFER
                                                          automatically after every nine bits (8 bits of data plus ACK
                                                          or NACK) has been received on the bus.                               */
  __IO uint32_t  MASK0;                             /*!< (@ 0x400A1030) I2C Slave address mask register                        */
  __IO uint32_t  MASK1;                             /*!< (@ 0x400A1034) I2C Slave address mask register                        */
  __IO uint32_t  MASK2;                             /*!< (@ 0x400A1038) I2C Slave address mask register                        */
  __IO uint32_t  MASK3;                             /*!< (@ 0x400A103C) I2C Slave address mask register                        */
} LPC_I2Cn_Type;


/* ================================================================================ */
/* ================                   I2Sn [I2S0]                  ================ */
/* ================================================================================ */


/**
  * @brief I2S interface  (I2Sn)
  */

typedef struct {                                    /*!< (@ 0x400A2000) I2Sn Structure                                         */
  __IO uint32_t  DAO;                               /*!< (@ 0x400A2000) I2S Digital Audio Output Register. Contains control
                                                         bits for the I2S transmit channel.                                    */
  __IO uint32_t  DAI;                               /*!< (@ 0x400A2004) I2S Digital Audio Input Register. Contains control
                                                         bits for the I2S receive channel.                                     */
  __O  uint32_t  TXFIFO;                            /*!< (@ 0x400A2008) I2S Transmit FIFO. Access register for the 8
                                                         x 32-bit transmitter FIFO.                                            */
  __I  uint32_t  RXFIFO;                            /*!< (@ 0x400A200C) I2S Receive FIFO. Access register for the 8 x
                                                         32-bit receiver FIFO.                                                 */
  __I  uint32_t  STATE;                             /*!< (@ 0x400A2010) I2S Status Feedback Register. Contains status
                                                         information about the I2S interface.                                  */
  __IO uint32_t  DMA1;                              /*!< (@ 0x400A2014) I2S DMA Configuration Register 1. Contains control
                                                         information for DMA request 1.                                        */
  __IO uint32_t  DMA2;                              /*!< (@ 0x400A2018) I2S DMA Configuration Register 2. Contains control
                                                         information for DMA request 2.                                        */
  __IO uint32_t  IRQ;                               /*!< (@ 0x400A201C) I2S Interrupt Request Control Register. Contains
                                                         bits that control how the I2S interrupt request is generated.         */
  __IO uint32_t  TXRATE;                            /*!< (@ 0x400A2020) I2S Transmit MCLK divider. This register determines
                                                         the I2S TX MCLK rate by specifying the value to divide PCLK
                                                          by in order to produce MCLK.                                         */
  __IO uint32_t  RXRATE;                            /*!< (@ 0x400A2024) I2S Receive MCLK divider. This register determines
                                                         the I2S RX MCLK rate by specifying the value to divide PCLK
                                                          by in order to produce MCLK.                                         */
  __IO uint32_t  TXBITRATE;                         /*!< (@ 0x400A2028) I2S Transmit bit rate divider. This register
                                                         determines the I2S transmit bit rate by specifying the value
                                                          to divide TX_MCLK by in order to produce the transmit bit clock.     */
  __IO uint32_t  RXBITRATE;                         /*!< (@ 0x400A202C) I2S Receive bit rate divider. This register determines
                                                         the I2S receive bit rate by specifying the value to divide RX_MCLK
                                                          by in order to produce the receive bit clock.                        */
  __IO uint32_t  TXMODE;                            /*!< (@ 0x400A2030) I2S Transmit mode control.                             */
  __IO uint32_t  RXMODE;                            /*!< (@ 0x400A2034) I2S Receive mode control.                              */
} LPC_I2Sn_Type;


/* ================================================================================ */
/* ================                 C_CANn [C_CAN1]                ================ */
/* ================================================================================ */


/**
  * @brief C_CAN  (C_CANn)
  */

