roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
typedef struct {                                    /*!< (@ 0x400A4000) C_CANn Structure                                       */
  __IO uint32_t  CNTL;                              /*!< (@ 0x400A4000) CAN control                                            */
  __IO uint32_t  STAT;                              /*!< (@ 0x400A4004) Status register                                        */
  __I  uint32_t  EC;                                /*!< (@ 0x400A4008) Error counter                                          */
  __IO uint32_t  BT;                                /*!< (@ 0x400A400C) Bit timing register                                    */
  __I  uint32_t  INT;                               /*!< (@ 0x400A4010) Interrupt register                                     */
  __IO uint32_t  TEST;                              /*!< (@ 0x400A4014) Test register                                          */
  __IO uint32_t  BRPE;                              /*!< (@ 0x400A4018) Baud rate prescaler extension register                 */
  __I  uint32_t  RESERVED0;
  __IO uint32_t  IF1_CMDREQ;                        /*!< (@ 0x400A4020) Message interface command request                      */
  
  union {
    __IO uint32_t  IF1_CMDMSK_R;                    /*!< (@ 0x400A4024) Message interface command mask (read direction)        */
    __IO uint32_t  IF1_CMDMSK_W;                    /*!< (@ 0x400A4024) Message interface command mask (write direction)       */
  };
  __IO uint32_t  IF1_MSK1;                          /*!< (@ 0x400A4028) Message interface mask 1                               */
  __IO uint32_t  IF1_MSK2;                          /*!< (@ 0x400A402C) Message interface 1 mask 2                             */
  __IO uint32_t  IF1_ARB1;                          /*!< (@ 0x400A4030) Message interface 1 arbitration 1                      */
  __IO uint32_t  IF1_ARB2;                          /*!< (@ 0x400A4034) Message interface 1 arbitration 2                      */
  __IO uint32_t  IF1_MCTRL;                         /*!< (@ 0x400A4038) Message interface 1 message control                    */
  __IO uint32_t  IF1_DA1;                           /*!< (@ 0x400A403C) Message interface data A1                              */
  __IO uint32_t  IF1_DA2;                           /*!< (@ 0x400A4040) Message interface 1 data A2                            */
  __IO uint32_t  IF1_DB1;                           /*!< (@ 0x400A4044) Message interface 1 data B1                            */
  __IO uint32_t  IF1_DB2;                           /*!< (@ 0x400A4048) Message interface 1 data B2                            */
  __I  uint32_t  RESERVED1[13];
  __IO uint32_t  IF2_CMDREQ;                        /*!< (@ 0x400A4080) Message interface command request                      */
  
  union {
    __IO uint32_t  IF2_CMDMSK_R;                    /*!< (@ 0x400A4084) Message interface command mask (read direction)        */
    __IO uint32_t  IF2_CMDMSK_W;                    /*!< (@ 0x400A4084) Message interface command mask (write direction)       */
  };
  __IO uint32_t  IF2_MSK1;                          /*!< (@ 0x400A4088) Message interface mask 1                               */
  __IO uint32_t  IF2_MSK2;                          /*!< (@ 0x400A408C) Message interface 1 mask 2                             */
  __IO uint32_t  IF2_ARB1;                          /*!< (@ 0x400A4090) Message interface 1 arbitration 1                      */
  __IO uint32_t  IF2_ARB2;                          /*!< (@ 0x400A4094) Message interface 1 arbitration 2                      */
  __IO uint32_t  IF2_MCTRL;                         /*!< (@ 0x400A4098) Message interface 1 message control                    */
  __IO uint32_t  IF2_DA1;                           /*!< (@ 0x400A409C) Message interface data A1                              */
  __IO uint32_t  IF2_DA2;                           /*!< (@ 0x400A40A0) Message interface 1 data A2                            */
  __IO uint32_t  IF2_DB1;                           /*!< (@ 0x400A40A4) Message interface 1 data B1                            */
  __IO uint32_t  IF2_DB2;                           /*!< (@ 0x400A40A8) Message interface 1 data B2                            */
  __I  uint32_t  RESERVED2[21];
  __I  uint32_t  TXREQ1;                            /*!< (@ 0x400A4100) Transmission request 1                                 */
  __I  uint32_t  TXREQ2;                            /*!< (@ 0x400A4104) Transmission request 2                                 */
  __I  uint32_t  RESERVED3[6];
  __I  uint32_t  ND1;                               /*!< (@ 0x400A4120) New data 1                                             */
  __I  uint32_t  ND2;                               /*!< (@ 0x400A4124) New data 2                                             */
  __I  uint32_t  RESERVED4[6];
  __I  uint32_t  IR1;                               /*!< (@ 0x400A4140) Interrupt pending 1                                    */
  __I  uint32_t  IR2;                               /*!< (@ 0x400A4144) Interrupt pending 2                                    */
  __I  uint32_t  RESERVED5[6];
  __I  uint32_t  MSGV1;                             /*!< (@ 0x400A4160) Message valid 1                                        */
  __I  uint32_t  MSGV2;                             /*!< (@ 0x400A4164) Message valid 2                                        */
  __I  uint32_t  RESERVED6[6];
  __IO uint32_t  CLKDIV;                            /*!< (@ 0x400A4180) CAN clock divider register                             */
} LPC_C_CANn_Type;


/* ================================================================================ */
/* ================                     RITIMER                    ================ */
/* ================================================================================ */


/**
  * @brief Repetitive Interrupt Timer (RIT)  (RITIMER)
  */

typedef struct {                                    /*!< (@ 0x400C0000) RITIMER Structure                                      */
  __IO uint32_t  COMPVAL;                           /*!< (@ 0x400C0000) Compare register                                       */
  __IO uint32_t  MASK;                              /*!< (@ 0x400C0004) Mask register. This register holds the 32-bit
                                                         mask value. A 1 written to any bit will force a compare on the
                                                          corresponding bit of the counter and compare register.               */
  __IO uint32_t  CTRL;                              /*!< (@ 0x400C0008) Control register.                                      */
  __IO uint32_t  COUNTER;                           /*!< (@ 0x400C000C) 32-bit counter                                         */
} LPC_RITIMER_Type;


/* ================================================================================ */
/* ================                       QEI                      ================ */
/* ================================================================================ */


/**
  * @brief Quadrature Encoder Interface (QEI)  (QEI)
  */

typedef struct {                                    /*!< (@ 0x400C6000) QEI Structure                                          */
  __O  uint32_t  CON;                               /*!< (@ 0x400C6000) Control register                                       */
  __I  uint32_t  STAT;                              /*!< (@ 0x400C6004) Encoder status register                                */
  __IO uint32_t  CONF;                              /*!< (@ 0x400C6008) Configuration register                                 */
  __I  uint32_t  POS;                               /*!< (@ 0x400C600C) Position register                                      */
  __IO uint32_t  MAXPOS;                            /*!< (@ 0x400C6010) Maximum position register                              */
  __IO uint32_t  CMPOS0;                            /*!< (@ 0x400C6014) position compare register 0                            */
  __IO uint32_t  CMPOS1;                            /*!< (@ 0x400C6018) position compare register 1                            */
  __IO uint32_t  CMPOS2;                            /*!< (@ 0x400C601C) position compare register 2                            */
  __I  uint32_t  INXCNT;                            /*!< (@ 0x400C6020) Index count register                                   */
  __IO uint32_t  INXCMP0;                           /*!< (@ 0x400C6024) Index compare register 0                               */
  __IO uint32_t  LOAD;                              /*!< (@ 0x400C6028) Velocity timer reload register                         */
  __I  uint32_t  TIME;                              /*!< (@ 0x400C602C) Velocity timer register                                */
  __I  uint32_t  VEL;                               /*!< (@ 0x400C6030) Velocity counter register                              */
  __I  uint32_t  CAP;                               /*!< (@ 0x400C6034) Velocity capture register                              */
  __IO uint32_t  VELCOMP;                           /*!< (@ 0x400C6038) Velocity compare register                              */
  __IO uint32_t  FILTERPHA;                         /*!< (@ 0x400C603C) Digital filter register on input phase A (QEI_A)       */
  __IO uint32_t  FILTERPHB;                         /*!< (@ 0x400C6040) Digital filter register on input phase B (QEI_B)       */
  __IO uint32_t  FILTERINX;                         /*!< (@ 0x400C6044) Digital filter register on input index (QEI_IDX)       */
  __IO uint32_t  WINDOW;                            /*!< (@ 0x400C6048) Index acceptance window register                       */
  __IO uint32_t  INXCMP1;                           /*!< (@ 0x400C604C) Index compare register 1                               */
  __IO uint32_t  INXCMP2;                           /*!< (@ 0x400C6050) Index compare register 2                               */
  __I  uint32_t  RESERVED0[993];
  __O  uint32_t  IEC;                               /*!< (@ 0x400C6FD8) Interrupt enable clear register                        */
  __O  uint32_t  IES;                               /*!< (@ 0x400C6FDC) Interrupt enable set register                          */
  __I  uint32_t  INTSTAT;                           /*!< (@ 0x400C6FE0) Interrupt status register                              */
  __I  uint32_t  IE;                                /*!< (@ 0x400C6FE4) Interrupt enable register                              */
  __O  uint32_t  CLR;                               /*!< (@ 0x400C6FE8) Interrupt status clear register                        */
  __O  uint32_t  SET;                               /*!< (@ 0x400C6FEC) Interrupt status set register                          */
} LPC_QEI_Type;


/* ================================================================================ */
/* ================                      GIMA                      ================ */
/* ================================================================================ */


/**
  * @brief Global Input Multiplexer Array (GIMA) (GIMA)
  */

typedef struct {                                    /*!< (@ 0x400C7000) GIMA Structure                                         */
  __IO uint32_t  CAP0_0_IN;                         /*!< (@ 0x400C7000) Timer 0 CAP0_0 capture input multiplexer (GIMA
                                                         output 0)                                                             */
  __IO uint32_t  CAP0_1_IN;                         /*!< (@ 0x400C7004) Timer 0 CAP0_1 capture input multiplexer (GIMA
                                                         output 1)                                                             */
  __IO uint32_t  CAP0_2_IN;                         /*!< (@ 0x400C7008) Timer 0 CAP0_2 capture input multiplexer (GIMA
                                                         output 2)                                                             */
  __IO uint32_t  CAP0_3_IN;                         /*!< (@ 0x400C700C) Timer 0 CAP0_3 capture input multiplexer (GIMA
                                                         output 3)                                                             */
  __IO uint32_t  CAP1_0_IN;                         /*!< (@ 0x400C7010) Timer 1 CAP1_0 capture input multiplexer (GIMA
                                                         output 4)                                                             */
  __IO uint32_t  CAP1_1_IN;                         /*!< (@ 0x400C7014) Timer 1 CAP1_1 capture input multiplexer (GIMA
                                                         output 5)                                                             */
  __IO uint32_t  CAP1_2_IN;                         /*!< (@ 0x400C7018) Timer 1 CAP1_2 capture input multiplexer (GIMA
                                                         output 6)                                                             */
  __IO uint32_t  CAP1_3_IN;                         /*!< (@ 0x400C701C) Timer 1 CAP1_3 capture input multiplexer (GIMA
                                                         output 7)                                                             */
  __IO uint32_t  CAP2_0_IN;                         /*!< (@ 0x400C7020) Timer 2 CAP2_0 capture input multiplexer (GIMA
                                                         output 8)                                                             */
  __IO uint32_t  CAP2_1_IN;                         /*!< (@ 0x400C7024) Timer 2 CAP2_1 capture input multiplexer (GIMA
                                                         output 9)                                                             */
  __IO uint32_t  CAP2_2_IN;                         /*!< (@ 0x400C7028) Timer 2 CAP2_2 capture input multiplexer (GIMA
                                                         output 10)                                                            */
  __IO uint32_t  CAP2_3_IN;                         /*!< (@ 0x400C702C) Timer 2 CAP2_3 capture input multiplexer (GIMA
                                                         output 11)                                                            */
  __IO uint32_t  CAP3_0_IN;                         /*!< (@ 0x400C7030) Timer 3 CAP3_0 capture input multiplexer (GIMA
                                                         output 12)                                                            */
  __IO uint32_t  CAP3_1_IN;                         /*!< (@ 0x400C7034) Timer 3 CAP3_1 capture input multiplexer (GIMA
                                                         output 13)                                                            */
  __IO uint32_t  CAP3_2_IN;                         /*!< (@ 0x400C7038) Timer 3 CAP3_2 capture input multiplexer (GIMA
                                                         output 14)                                                            */
  __IO uint32_t  CAP3_3_IN;                         /*!< (@ 0x400C703C) Timer 3 CAP3_3 capture input multiplexer (GIMA
                                                         output 15)                                                            */
  __IO uint32_t  CTIN_0_IN;                         /*!< (@ 0x400C7040) SCT CTIN_0 capture input multiplexer (GIMA output
                                                         16)                                                                   */
  __IO uint32_t  CTIN_1_IN;                         /*!< (@ 0x400C7044) SCT CTIN_1 capture input multiplexer (GIMA output
                                                         17)                                                                   */
  __IO uint32_t  CTIN_2_IN;                         /*!< (@ 0x400C7048) SCT CTIN_2 capture input multiplexer (GIMA output
                                                         18)                                                                   */
  __IO uint32_t  CTIN_3_IN;                         /*!< (@ 0x400C704C) SCT CTIN_3 capture input multiplexer (GIMA output
                                                         19)                                                                   */
  __IO uint32_t  CTIN_4_IN;                         /*!< (@ 0x400C7050) SCT CTIN_4 capture input multiplexer (GIMA output
                                                         20)                                                                   */
  __IO uint32_t  CTIN_5_IN;                         /*!< (@ 0x400C7054) SCT CTIN_5 capture input multiplexer (GIMA output
                                                         21)                                                                   */
  __IO uint32_t  CTIN_6_IN;                         /*!< (@ 0x400C7058) SCT CTIN_6 capture input multiplexer (GIMA output
                                                         22)                                                                   */
  __IO uint32_t  CTIN_7_IN;                         /*!< (@ 0x400C705C) SCT CTIN_7 capture input multiplexer (GIMA output
                                                         23)                                                                   */
  __IO uint32_t  ADCHS_TRIGGER_IN;                  /*!< (@ 0x400C7060) ADCHS trigger input multiplexer (GIMA output
                                                         24)                                                                   */
  __IO uint32_t  EVENTROUTER_13_IN;                 /*!< (@ 0x400C7064) Event router input 13 multiplexer (GIMA output
                                                         25)                                                                   */
  __IO uint32_t  EVENTROUTER_14_IN;                 /*!< (@ 0x400C7068) Event router input 14 multiplexer (GIMA output
                                                         26)                                                                   */
  __IO uint32_t  EVENTROUTER_16_IN;                 /*!< (@ 0x400C706C) Event router input 16 multiplexer (GIMA output
                                                         27)                                                                   */
  __IO uint32_t  ADCSTART0_IN;                      /*!< (@ 0x400C7070) ADC start0 input multiplexer (GIMA output 28)          */
  __IO uint32_t  ADCSTART1_IN;                      /*!< (@ 0x400C7074) ADC start1 input multiplexer (GIMA output 29)          */
} LPC_GIMA_Type;


/* ================================================================================ */
/* ================                       DAC                      ================ */
/* ================================================================================ */


/**
  * @brief Digital-to-Analog Converter (DAC)  (DAC)
  */

