roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SCT_CTRL  ---------------------------------- */
#define SCT_CTRL_DOWN_L_Pos                   0                                                       /*!< SCT CTRL: DOWN_L Position               */
#define SCT_CTRL_DOWN_L_Msk                   (0x01UL << SCT_CTRL_DOWN_L_Pos)                         /*!< SCT CTRL: DOWN_L Mask                   */
#define SCT_CTRL_STOP_L_Pos                   1                                                       /*!< SCT CTRL: STOP_L Position               */
#define SCT_CTRL_STOP_L_Msk                   (0x01UL << SCT_CTRL_STOP_L_Pos)                         /*!< SCT CTRL: STOP_L Mask                   */
#define SCT_CTRL_HALT_L_Pos                   2                                                       /*!< SCT CTRL: HALT_L Position               */
#define SCT_CTRL_HALT_L_Msk                   (0x01UL << SCT_CTRL_HALT_L_Pos)                         /*!< SCT CTRL: HALT_L Mask                   */
#define SCT_CTRL_CLRCTR_L_Pos                 3                                                       /*!< SCT CTRL: CLRCTR_L Position             */
#define SCT_CTRL_CLRCTR_L_Msk                 (0x01UL << SCT_CTRL_CLRCTR_L_Pos)                       /*!< SCT CTRL: CLRCTR_L Mask                 */
#define SCT_CTRL_BIDIR_L_Pos                  4                                                       /*!< SCT CTRL: BIDIR_L Position              */
#define SCT_CTRL_BIDIR_L_Msk                  (0x01UL << SCT_CTRL_BIDIR_L_Pos)                        /*!< SCT CTRL: BIDIR_L Mask                  */
#define SCT_CTRL_PRE_L_Pos                    5                                                       /*!< SCT CTRL: PRE_L Position                */
#define SCT_CTRL_PRE_L_Msk                    (0x000000ffUL << SCT_CTRL_PRE_L_Pos)                    /*!< SCT CTRL: PRE_L Mask                    */
#define SCT_CTRL_DOWN_H_Pos                   16                                                      /*!< SCT CTRL: DOWN_H Position               */
#define SCT_CTRL_DOWN_H_Msk                   (0x01UL << SCT_CTRL_DOWN_H_Pos)                         /*!< SCT CTRL: DOWN_H Mask                   */
#define SCT_CTRL_STOP_H_Pos                   17                                                      /*!< SCT CTRL: STOP_H Position               */
#define SCT_CTRL_STOP_H_Msk                   (0x01UL << SCT_CTRL_STOP_H_Pos)                         /*!< SCT CTRL: STOP_H Mask                   */
#define SCT_CTRL_HALT_H_Pos                   18                                                      /*!< SCT CTRL: HALT_H Position               */
#define SCT_CTRL_HALT_H_Msk                   (0x01UL << SCT_CTRL_HALT_H_Pos)                         /*!< SCT CTRL: HALT_H Mask                   */
#define SCT_CTRL_CLRCTR_H_Pos                 19                                                      /*!< SCT CTRL: CLRCTR_H Position             */
#define SCT_CTRL_CLRCTR_H_Msk                 (0x01UL << SCT_CTRL_CLRCTR_H_Pos)                       /*!< SCT CTRL: CLRCTR_H Mask                 */
#define SCT_CTRL_BIDIR_H_Pos                  20                                                      /*!< SCT CTRL: BIDIR_H Position              */
#define SCT_CTRL_BIDIR_H_Msk                  (0x01UL << SCT_CTRL_BIDIR_H_Pos)                        /*!< SCT CTRL: BIDIR_H Mask                  */
#define SCT_CTRL_PRE_H_Pos                    21                                                      /*!< SCT CTRL: PRE_H Position                */
#define SCT_CTRL_PRE_H_Msk                    (0x000000ffUL << SCT_CTRL_PRE_H_Pos)                    /*!< SCT CTRL: PRE_H Mask                    */

/* ----------------------------------  SCT_LIMIT  --------------------------------- */
#define SCT_LIMIT_LIMMSK_L_Pos                0                                                       /*!< SCT LIMIT: LIMMSK_L Position            */
#define SCT_LIMIT_LIMMSK_L_Msk                (0x0000ffffUL << SCT_LIMIT_LIMMSK_L_Pos)                /*!< SCT LIMIT: LIMMSK_L Mask                */
#define SCT_LIMIT_LIMMSK_H_Pos                16                                                      /*!< SCT LIMIT: LIMMSK_H Position            */
#define SCT_LIMIT_LIMMSK_H_Msk                (0x0000ffffUL << SCT_LIMIT_LIMMSK_H_Pos)                /*!< SCT LIMIT: LIMMSK_H Mask                */

/* ----------------------------------  SCT_HALT  ---------------------------------- */
#define SCT_HALT_HALTMSK_L_Pos                0                                                       /*!< SCT HALT: HALTMSK_L Position            */
#define SCT_HALT_HALTMSK_L_Msk                (0x0000ffffUL << SCT_HALT_HALTMSK_L_Pos)                /*!< SCT HALT: HALTMSK_L Mask                */
#define SCT_HALT_HALTMSK_H_Pos                16                                                      /*!< SCT HALT: HALTMSK_H Position            */
#define SCT_HALT_HALTMSK_H_Msk                (0x0000ffffUL << SCT_HALT_HALTMSK_H_Pos)                /*!< SCT HALT: HALTMSK_H Mask                */

/* ----------------------------------  SCT_STOP  ---------------------------------- */
#define SCT_STOP_STOPMSK_L_Pos                0                                                       /*!< SCT STOP: STOPMSK_L Position            */
#define SCT_STOP_STOPMSK_L_Msk                (0x0000ffffUL << SCT_STOP_STOPMSK_L_Pos)                /*!< SCT STOP: STOPMSK_L Mask                */
#define SCT_STOP_STOPMSK_H_Pos                16                                                      /*!< SCT STOP: STOPMSK_H Position            */
#define SCT_STOP_STOPMSK_H_Msk                (0x0000ffffUL << SCT_STOP_STOPMSK_H_Pos)                /*!< SCT STOP: STOPMSK_H Mask                */

/* ----------------------------------  SCT_START  --------------------------------- */
#define SCT_START_STARTMSK_L_Pos              0                                                       /*!< SCT START: STARTMSK_L Position          */
#define SCT_START_STARTMSK_L_Msk              (0x0000ffffUL << SCT_START_STARTMSK_L_Pos)              /*!< SCT START: STARTMSK_L Mask              */
#define SCT_START_STARTMSK_H_Pos              16                                                      /*!< SCT START: STARTMSK_H Position          */
#define SCT_START_STARTMSK_H_Msk              (0x0000ffffUL << SCT_START_STARTMSK_H_Pos)              /*!< SCT START: STARTMSK_H Mask              */

/* ---------------------------------  SCT_DITHER  --------------------------------- */
#define SCT_DITHER_DITHMSK_L_Pos              0                                                       /*!< SCT DITHER: DITHMSK_L Position          */
#define SCT_DITHER_DITHMSK_L_Msk              (0x0000ffffUL << SCT_DITHER_DITHMSK_L_Pos)              /*!< SCT DITHER: DITHMSK_L Mask              */
#define SCT_DITHER_DITHMSK_H_Pos              16                                                      /*!< SCT DITHER: DITHMSK_H Position          */
#define SCT_DITHER_DITHMSK_H_Msk              (0x0000ffffUL << SCT_DITHER_DITHMSK_H_Pos)              /*!< SCT DITHER: DITHMSK_H Mask              */

/* ----------------------------------  SCT_COUNT  --------------------------------- */
#define SCT_COUNT_CTR_L_Pos                   0                                                       /*!< SCT COUNT: CTR_L Position               */
#define SCT_COUNT_CTR_L_Msk                   (0x0000ffffUL << SCT_COUNT_CTR_L_Pos)                   /*!< SCT COUNT: CTR_L Mask                   */
#define SCT_COUNT_CTR_H_Pos                   16                                                      /*!< SCT COUNT: CTR_H Position               */
#define SCT_COUNT_CTR_H_Msk                   (0x0000ffffUL << SCT_COUNT_CTR_H_Pos)                   /*!< SCT COUNT: CTR_H Mask                   */

