roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SCT_STATE  --------------------------------- */
#define SCT_STATE_STATE_L_Pos                 0                                                       /*!< SCT STATE: STATE_L Position             */
#define SCT_STATE_STATE_L_Msk                 (0x1fUL << SCT_STATE_STATE_L_Pos)                       /*!< SCT STATE: STATE_L Mask                 */
#define SCT_STATE_STATE_H_Pos                 16                                                      /*!< SCT STATE: STATE_H Position             */
#define SCT_STATE_STATE_H_Msk                 (0x1fUL << SCT_STATE_STATE_H_Pos)                       /*!< SCT STATE: STATE_H Mask                 */

/* ----------------------------------  SCT_INPUT  --------------------------------- */
#define SCT_INPUT_AIN0_Pos                    0                                                       /*!< SCT INPUT: AIN0 Position                */
#define SCT_INPUT_AIN0_Msk                    (0x01UL << SCT_INPUT_AIN0_Pos)                          /*!< SCT INPUT: AIN0 Mask                    */
#define SCT_INPUT_AIN1_Pos                    1                                                       /*!< SCT INPUT: AIN1 Position                */
#define SCT_INPUT_AIN1_Msk                    (0x01UL << SCT_INPUT_AIN1_Pos)                          /*!< SCT INPUT: AIN1 Mask                    */
#define SCT_INPUT_AIN2_Pos                    2                                                       /*!< SCT INPUT: AIN2 Position                */
#define SCT_INPUT_AIN2_Msk                    (0x01UL << SCT_INPUT_AIN2_Pos)                          /*!< SCT INPUT: AIN2 Mask                    */
#define SCT_INPUT_AIN3_Pos                    3                                                       /*!< SCT INPUT: AIN3 Position                */
#define SCT_INPUT_AIN3_Msk                    (0x01UL << SCT_INPUT_AIN3_Pos)                          /*!< SCT INPUT: AIN3 Mask                    */
#define SCT_INPUT_AIN4_Pos                    4                                                       /*!< SCT INPUT: AIN4 Position                */
#define SCT_INPUT_AIN4_Msk                    (0x01UL << SCT_INPUT_AIN4_Pos)                          /*!< SCT INPUT: AIN4 Mask                    */
#define SCT_INPUT_AIN5_Pos                    5                                                       /*!< SCT INPUT: AIN5 Position                */
#define SCT_INPUT_AIN5_Msk                    (0x01UL << SCT_INPUT_AIN5_Pos)                          /*!< SCT INPUT: AIN5 Mask                    */
#define SCT_INPUT_AIN6_Pos                    6                                                       /*!< SCT INPUT: AIN6 Position                */
#define SCT_INPUT_AIN6_Msk                    (0x01UL << SCT_INPUT_AIN6_Pos)                          /*!< SCT INPUT: AIN6 Mask                    */
#define SCT_INPUT_AIN7_Pos                    7                                                       /*!< SCT INPUT: AIN7 Position                */
#define SCT_INPUT_AIN7_Msk                    (0x01UL << SCT_INPUT_AIN7_Pos)                          /*!< SCT INPUT: AIN7 Mask                    */
#define SCT_INPUT_SIN0_Pos                    16                                                      /*!< SCT INPUT: SIN0 Position                */
#define SCT_INPUT_SIN0_Msk                    (0x01UL << SCT_INPUT_SIN0_Pos)                          /*!< SCT INPUT: SIN0 Mask                    */
#define SCT_INPUT_SIN1_Pos                    17                                                      /*!< SCT INPUT: SIN1 Position                */
#define SCT_INPUT_SIN1_Msk                    (0x01UL << SCT_INPUT_SIN1_Pos)                          /*!< SCT INPUT: SIN1 Mask                    */
#define SCT_INPUT_SIN2_Pos                    18                                                      /*!< SCT INPUT: SIN2 Position                */
#define SCT_INPUT_SIN2_Msk                    (0x01UL << SCT_INPUT_SIN2_Pos)                          /*!< SCT INPUT: SIN2 Mask                    */
#define SCT_INPUT_SIN3_Pos                    19                                                      /*!< SCT INPUT: SIN3 Position                */
#define SCT_INPUT_SIN3_Msk                    (0x01UL << SCT_INPUT_SIN3_Pos)                          /*!< SCT INPUT: SIN3 Mask                    */
#define SCT_INPUT_SIN4_Pos                    20                                                      /*!< SCT INPUT: SIN4 Position                */
#define SCT_INPUT_SIN4_Msk                    (0x01UL << SCT_INPUT_SIN4_Pos)                          /*!< SCT INPUT: SIN4 Mask                    */
#define SCT_INPUT_SIN5_Pos                    21                                                      /*!< SCT INPUT: SIN5 Position                */
#define SCT_INPUT_SIN5_Msk                    (0x01UL << SCT_INPUT_SIN5_Pos)                          /*!< SCT INPUT: SIN5 Mask                    */
#define SCT_INPUT_SIN6_Pos                    22                                                      /*!< SCT INPUT: SIN6 Position                */
#define SCT_INPUT_SIN6_Msk                    (0x01UL << SCT_INPUT_SIN6_Pos)                          /*!< SCT INPUT: SIN6 Mask                    */
#define SCT_INPUT_SIN7_Pos                    23                                                      /*!< SCT INPUT: SIN7 Position                */
#define SCT_INPUT_SIN7_Msk                    (0x01UL << SCT_INPUT_SIN7_Pos)                          /*!< SCT INPUT: SIN7 Mask                    */

/* ---------------------------------  SCT_REGMODE  -------------------------------- */
#define SCT_REGMODE_REGMOD_L_Pos              0                                                       /*!< SCT REGMODE: REGMOD_L Position          */
#define SCT_REGMODE_REGMOD_L_Msk              (0x0000ffffUL << SCT_REGMODE_REGMOD_L_Pos)              /*!< SCT REGMODE: REGMOD_L Mask              */
#define SCT_REGMODE_REGMOD_H_Pos              16                                                      /*!< SCT REGMODE: REGMOD_H Position          */
#define SCT_REGMODE_REGMOD_H_Msk              (0x0000ffffUL << SCT_REGMODE_REGMOD_H_Pos)              /*!< SCT REGMODE: REGMOD_H Mask              */

/* ---------------------------------  SCT_OUTPUT  --------------------------------- */
#define SCT_OUTPUT_OUT_Pos                    0                                                       /*!< SCT OUTPUT: OUT Position                */
#define SCT_OUTPUT_OUT_Msk                    (0x0000ffffUL << SCT_OUTPUT_OUT_Pos)                    /*!< SCT OUTPUT: OUT Mask                    */

/* ------------------------------  SCT_OUTPUTDIRCTRL  ----------------------------- */
#define SCT_OUTPUTDIRCTRL_SETCLR0_Pos         0                                                       /*!< SCT OUTPUTDIRCTRL: SETCLR0 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR0_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR0_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR0 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR1_Pos         2                                                       /*!< SCT OUTPUTDIRCTRL: SETCLR1 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR1_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR1_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR1 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR2_Pos         4                                                       /*!< SCT OUTPUTDIRCTRL: SETCLR2 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR2_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR2_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR2 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR3_Pos         6                                                       /*!< SCT OUTPUTDIRCTRL: SETCLR3 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR3_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR3_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR3 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR4_Pos         8                                                       /*!< SCT OUTPUTDIRCTRL: SETCLR4 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR4_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR4_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR4 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR5_Pos         10                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR5 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR5_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR5_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR5 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR6_Pos         12                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR6 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR6_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR6_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR6 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR7_Pos         14                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR7 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR7_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR7_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR7 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR8_Pos         16                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR8 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR8_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR8_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR8 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR9_Pos         18                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR9 Position     */
#define SCT_OUTPUTDIRCTRL_SETCLR9_Msk         (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR9_Pos)               /*!< SCT OUTPUTDIRCTRL: SETCLR9 Mask         */
#define SCT_OUTPUTDIRCTRL_SETCLR10_Pos        20                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR10 Position    */
#define SCT_OUTPUTDIRCTRL_SETCLR10_Msk        (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR10_Pos)              /*!< SCT OUTPUTDIRCTRL: SETCLR10 Mask        */
#define SCT_OUTPUTDIRCTRL_SETCLR11_Pos        22                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR11 Position    */
#define SCT_OUTPUTDIRCTRL_SETCLR11_Msk        (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR11_Pos)              /*!< SCT OUTPUTDIRCTRL: SETCLR11 Mask        */
#define SCT_OUTPUTDIRCTRL_SETCLR12_Pos        24                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR12 Position    */
#define SCT_OUTPUTDIRCTRL_SETCLR12_Msk        (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR12_Pos)              /*!< SCT OUTPUTDIRCTRL: SETCLR12 Mask        */
#define SCT_OUTPUTDIRCTRL_SETCLR13_Pos        26                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR13 Position    */
#define SCT_OUTPUTDIRCTRL_SETCLR13_Msk        (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR13_Pos)              /*!< SCT OUTPUTDIRCTRL: SETCLR13 Mask        */
#define SCT_OUTPUTDIRCTRL_SETCLR14_Pos        28                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR14 Position    */
#define SCT_OUTPUTDIRCTRL_SETCLR14_Msk        (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR14_Pos)              /*!< SCT OUTPUTDIRCTRL: SETCLR14 Mask        */
#define SCT_OUTPUTDIRCTRL_SETCLR15_Pos        30                                                      /*!< SCT OUTPUTDIRCTRL: SETCLR15 Position    */
#define SCT_OUTPUTDIRCTRL_SETCLR15_Msk        (0x03UL << SCT_OUTPUTDIRCTRL_SETCLR15_Pos)              /*!< SCT OUTPUTDIRCTRL: SETCLR15 Mask        */

/* -----------------------------------  SCT_RES  ---------------------------------- */
#define SCT_RES_O0RES_Pos                     0                                                       /*!< SCT RES: O0RES Position                 */
#define SCT_RES_O0RES_Msk                     (0x03UL << SCT_RES_O0RES_Pos)                           /*!< SCT RES: O0RES Mask                     */
#define SCT_RES_O1RES_Pos                     2                                                       /*!< SCT RES: O1RES Position                 */
#define SCT_RES_O1RES_Msk                     (0x03UL << SCT_RES_O1RES_Pos)                           /*!< SCT RES: O1RES Mask                     */
#define SCT_RES_O2RES_Pos                     4                                                       /*!< SCT RES: O2RES Position                 */
#define SCT_RES_O2RES_Msk                     (0x03UL << SCT_RES_O2RES_Pos)                           /*!< SCT RES: O2RES Mask                     */
#define SCT_RES_O3RES_Pos                     6                                                       /*!< SCT RES: O3RES Position                 */
#define SCT_RES_O3RES_Msk                     (0x03UL << SCT_RES_O3RES_Pos)                           /*!< SCT RES: O3RES Mask                     */
#define SCT_RES_O4RES_Pos                     8                                                       /*!< SCT RES: O4RES Position                 */
#define SCT_RES_O4RES_Msk                     (0x03UL << SCT_RES_O4RES_Pos)                           /*!< SCT RES: O4RES Mask                     */
#define SCT_RES_O5RES_Pos                     10                                                      /*!< SCT RES: O5RES Position                 */
#define SCT_RES_O5RES_Msk                     (0x03UL << SCT_RES_O5RES_Pos)                           /*!< SCT RES: O5RES Mask                     */
#define SCT_RES_O6RES_Pos                     12                                                      /*!< SCT RES: O6RES Position                 */
#define SCT_RES_O6RES_Msk                     (0x03UL << SCT_RES_O6RES_Pos)                           /*!< SCT RES: O6RES Mask                     */
#define SCT_RES_O7RES_Pos                     14                                                      /*!< SCT RES: O7RES Position                 */
#define SCT_RES_O7RES_Msk                     (0x03UL << SCT_RES_O7RES_Pos)                           /*!< SCT RES: O7RES Mask                     */
#define SCT_RES_O8RES_Pos                     16                                                      /*!< SCT RES: O8RES Position                 */
#define SCT_RES_O8RES_Msk                     (0x03UL << SCT_RES_O8RES_Pos)                           /*!< SCT RES: O8RES Mask                     */
#define SCT_RES_O9RES_Pos                     18                                                      /*!< SCT RES: O9RES Position                 */
#define SCT_RES_O9RES_Msk                     (0x03UL << SCT_RES_O9RES_Pos)                           /*!< SCT RES: O9RES Mask                     */
#define SCT_RES_O10RES_Pos                    20                                                      /*!< SCT RES: O10RES Position                */
#define SCT_RES_O10RES_Msk                    (0x03UL << SCT_RES_O10RES_Pos)                          /*!< SCT RES: O10RES Mask                    */
#define SCT_RES_O11RES_Pos                    22                                                      /*!< SCT RES: O11RES Position                */
#define SCT_RES_O11RES_Msk                    (0x03UL << SCT_RES_O11RES_Pos)                          /*!< SCT RES: O11RES Mask                    */
#define SCT_RES_O12RES_Pos                    24                                                      /*!< SCT RES: O12RES Position                */
#define SCT_RES_O12RES_Msk                    (0x03UL << SCT_RES_O12RES_Pos)                          /*!< SCT RES: O12RES Mask                    */
#define SCT_RES_O13RES_Pos                    26                                                      /*!< SCT RES: O13RES Position                */
#define SCT_RES_O13RES_Msk                    (0x03UL << SCT_RES_O13RES_Pos)                          /*!< SCT RES: O13RES Mask                    */
#define SCT_RES_O14RES_Pos                    28                                                      /*!< SCT RES: O14RES Position                */
#define SCT_RES_O14RES_Msk                    (0x03UL << SCT_RES_O14RES_Pos)                          /*!< SCT RES: O14RES Mask                    */
#define SCT_RES_O15RES_Pos                    30                                                      /*!< SCT RES: O15RES Position                */
#define SCT_RES_O15RES_Msk                    (0x03UL << SCT_RES_O15RES_Pos)                          /*!< SCT RES: O15RES Mask                    */

