roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCT_DMAREQ0  -------------------------------- */
#define SCT_DMAREQ0_DEV_00_Pos                0                                                       /*!< SCT DMAREQ0: DEV_00 Position            */
#define SCT_DMAREQ0_DEV_00_Msk                (0x01UL << SCT_DMAREQ0_DEV_00_Pos)                      /*!< SCT DMAREQ0: DEV_00 Mask                */
#define SCT_DMAREQ0_DEV_01_Pos                1                                                       /*!< SCT DMAREQ0: DEV_01 Position            */
#define SCT_DMAREQ0_DEV_01_Msk                (0x01UL << SCT_DMAREQ0_DEV_01_Pos)                      /*!< SCT DMAREQ0: DEV_01 Mask                */
#define SCT_DMAREQ0_DEV_02_Pos                2                                                       /*!< SCT DMAREQ0: DEV_02 Position            */
#define SCT_DMAREQ0_DEV_02_Msk                (0x01UL << SCT_DMAREQ0_DEV_02_Pos)                      /*!< SCT DMAREQ0: DEV_02 Mask                */
#define SCT_DMAREQ0_DEV_03_Pos                3                                                       /*!< SCT DMAREQ0: DEV_03 Position            */
#define SCT_DMAREQ0_DEV_03_Msk                (0x01UL << SCT_DMAREQ0_DEV_03_Pos)                      /*!< SCT DMAREQ0: DEV_03 Mask                */
#define SCT_DMAREQ0_DEV_04_Pos                4                                                       /*!< SCT DMAREQ0: DEV_04 Position            */
#define SCT_DMAREQ0_DEV_04_Msk                (0x01UL << SCT_DMAREQ0_DEV_04_Pos)                      /*!< SCT DMAREQ0: DEV_04 Mask                */
#define SCT_DMAREQ0_DEV_05_Pos                5                                                       /*!< SCT DMAREQ0: DEV_05 Position            */
#define SCT_DMAREQ0_DEV_05_Msk                (0x01UL << SCT_DMAREQ0_DEV_05_Pos)                      /*!< SCT DMAREQ0: DEV_05 Mask                */
#define SCT_DMAREQ0_DEV_06_Pos                6                                                       /*!< SCT DMAREQ0: DEV_06 Position            */
#define SCT_DMAREQ0_DEV_06_Msk                (0x01UL << SCT_DMAREQ0_DEV_06_Pos)                      /*!< SCT DMAREQ0: DEV_06 Mask                */
#define SCT_DMAREQ0_DEV_07_Pos                7                                                       /*!< SCT DMAREQ0: DEV_07 Position            */
#define SCT_DMAREQ0_DEV_07_Msk                (0x01UL << SCT_DMAREQ0_DEV_07_Pos)                      /*!< SCT DMAREQ0: DEV_07 Mask                */
#define SCT_DMAREQ0_DEV_08_Pos                8                                                       /*!< SCT DMAREQ0: DEV_08 Position            */
#define SCT_DMAREQ0_DEV_08_Msk                (0x01UL << SCT_DMAREQ0_DEV_08_Pos)                      /*!< SCT DMAREQ0: DEV_08 Mask                */
#define SCT_DMAREQ0_DEV_09_Pos                9                                                       /*!< SCT DMAREQ0: DEV_09 Position            */
#define SCT_DMAREQ0_DEV_09_Msk                (0x01UL << SCT_DMAREQ0_DEV_09_Pos)                      /*!< SCT DMAREQ0: DEV_09 Mask                */
#define SCT_DMAREQ0_DEV_010_Pos               10                                                      /*!< SCT DMAREQ0: DEV_010 Position           */
#define SCT_DMAREQ0_DEV_010_Msk               (0x01UL << SCT_DMAREQ0_DEV_010_Pos)                     /*!< SCT DMAREQ0: DEV_010 Mask               */
#define SCT_DMAREQ0_DEV_011_Pos               11                                                      /*!< SCT DMAREQ0: DEV_011 Position           */
#define SCT_DMAREQ0_DEV_011_Msk               (0x01UL << SCT_DMAREQ0_DEV_011_Pos)                     /*!< SCT DMAREQ0: DEV_011 Mask               */
#define SCT_DMAREQ0_DEV_012_Pos               12                                                      /*!< SCT DMAREQ0: DEV_012 Position           */
#define SCT_DMAREQ0_DEV_012_Msk               (0x01UL << SCT_DMAREQ0_DEV_012_Pos)                     /*!< SCT DMAREQ0: DEV_012 Mask               */
#define SCT_DMAREQ0_DEV_013_Pos               13                                                      /*!< SCT DMAREQ0: DEV_013 Position           */
#define SCT_DMAREQ0_DEV_013_Msk               (0x01UL << SCT_DMAREQ0_DEV_013_Pos)                     /*!< SCT DMAREQ0: DEV_013 Mask               */
#define SCT_DMAREQ0_DEV_014_Pos               14                                                      /*!< SCT DMAREQ0: DEV_014 Position           */
#define SCT_DMAREQ0_DEV_014_Msk               (0x01UL << SCT_DMAREQ0_DEV_014_Pos)                     /*!< SCT DMAREQ0: DEV_014 Mask               */
#define SCT_DMAREQ0_DEV_015_Pos               15                                                      /*!< SCT DMAREQ0: DEV_015 Position           */
#define SCT_DMAREQ0_DEV_015_Msk               (0x01UL << SCT_DMAREQ0_DEV_015_Pos)                     /*!< SCT DMAREQ0: DEV_015 Mask               */
#define SCT_DMAREQ0_DRL0_Pos                  30                                                      /*!< SCT DMAREQ0: DRL0 Position              */
#define SCT_DMAREQ0_DRL0_Msk                  (0x01UL << SCT_DMAREQ0_DRL0_Pos)                        /*!< SCT DMAREQ0: DRL0 Mask                  */
#define SCT_DMAREQ0_DRQ0_Pos                  31                                                      /*!< SCT DMAREQ0: DRQ0 Position              */
#define SCT_DMAREQ0_DRQ0_Msk                  (0x01UL << SCT_DMAREQ0_DRQ0_Pos)                        /*!< SCT DMAREQ0: DRQ0 Mask                  */

/* ---------------------------------  SCT_DMAREQ1  -------------------------------- */
#define SCT_DMAREQ1_DEV_10_Pos                0                                                       /*!< SCT DMAREQ1: DEV_10 Position            */
#define SCT_DMAREQ1_DEV_10_Msk                (0x01UL << SCT_DMAREQ1_DEV_10_Pos)                      /*!< SCT DMAREQ1: DEV_10 Mask                */
#define SCT_DMAREQ1_DEV_11_Pos                1                                                       /*!< SCT DMAREQ1: DEV_11 Position            */
#define SCT_DMAREQ1_DEV_11_Msk                (0x01UL << SCT_DMAREQ1_DEV_11_Pos)                      /*!< SCT DMAREQ1: DEV_11 Mask                */
#define SCT_DMAREQ1_DEV_12_Pos                2                                                       /*!< SCT DMAREQ1: DEV_12 Position            */
#define SCT_DMAREQ1_DEV_12_Msk                (0x01UL << SCT_DMAREQ1_DEV_12_Pos)                      /*!< SCT DMAREQ1: DEV_12 Mask                */
#define SCT_DMAREQ1_DEV_13_Pos                3                                                       /*!< SCT DMAREQ1: DEV_13 Position            */
#define SCT_DMAREQ1_DEV_13_Msk                (0x01UL << SCT_DMAREQ1_DEV_13_Pos)                      /*!< SCT DMAREQ1: DEV_13 Mask                */
#define SCT_DMAREQ1_DEV_14_Pos                4                                                       /*!< SCT DMAREQ1: DEV_14 Position            */
#define SCT_DMAREQ1_DEV_14_Msk                (0x01UL << SCT_DMAREQ1_DEV_14_Pos)                      /*!< SCT DMAREQ1: DEV_14 Mask                */
#define SCT_DMAREQ1_DEV_15_Pos                5                                                       /*!< SCT DMAREQ1: DEV_15 Position            */
#define SCT_DMAREQ1_DEV_15_Msk                (0x01UL << SCT_DMAREQ1_DEV_15_Pos)                      /*!< SCT DMAREQ1: DEV_15 Mask                */
#define SCT_DMAREQ1_DEV_16_Pos                6                                                       /*!< SCT DMAREQ1: DEV_16 Position            */
#define SCT_DMAREQ1_DEV_16_Msk                (0x01UL << SCT_DMAREQ1_DEV_16_Pos)                      /*!< SCT DMAREQ1: DEV_16 Mask                */
#define SCT_DMAREQ1_DEV_17_Pos                7                                                       /*!< SCT DMAREQ1: DEV_17 Position            */
#define SCT_DMAREQ1_DEV_17_Msk                (0x01UL << SCT_DMAREQ1_DEV_17_Pos)                      /*!< SCT DMAREQ1: DEV_17 Mask                */
#define SCT_DMAREQ1_DEV_18_Pos                8                                                       /*!< SCT DMAREQ1: DEV_18 Position            */
#define SCT_DMAREQ1_DEV_18_Msk                (0x01UL << SCT_DMAREQ1_DEV_18_Pos)                      /*!< SCT DMAREQ1: DEV_18 Mask                */
#define SCT_DMAREQ1_DEV_19_Pos                9                                                       /*!< SCT DMAREQ1: DEV_19 Position            */
#define SCT_DMAREQ1_DEV_19_Msk                (0x01UL << SCT_DMAREQ1_DEV_19_Pos)                      /*!< SCT DMAREQ1: DEV_19 Mask                */
#define SCT_DMAREQ1_DEV_110_Pos               10                                                      /*!< SCT DMAREQ1: DEV_110 Position           */
#define SCT_DMAREQ1_DEV_110_Msk               (0x01UL << SCT_DMAREQ1_DEV_110_Pos)                     /*!< SCT DMAREQ1: DEV_110 Mask               */
#define SCT_DMAREQ1_DEV_111_Pos               11                                                      /*!< SCT DMAREQ1: DEV_111 Position           */
#define SCT_DMAREQ1_DEV_111_Msk               (0x01UL << SCT_DMAREQ1_DEV_111_Pos)                     /*!< SCT DMAREQ1: DEV_111 Mask               */
#define SCT_DMAREQ1_DEV_112_Pos               12                                                      /*!< SCT DMAREQ1: DEV_112 Position           */
#define SCT_DMAREQ1_DEV_112_Msk               (0x01UL << SCT_DMAREQ1_DEV_112_Pos)                     /*!< SCT DMAREQ1: DEV_112 Mask               */
#define SCT_DMAREQ1_DEV_113_Pos               13                                                      /*!< SCT DMAREQ1: DEV_113 Position           */
#define SCT_DMAREQ1_DEV_113_Msk               (0x01UL << SCT_DMAREQ1_DEV_113_Pos)                     /*!< SCT DMAREQ1: DEV_113 Mask               */
#define SCT_DMAREQ1_DEV_114_Pos               14                                                      /*!< SCT DMAREQ1: DEV_114 Position           */
#define SCT_DMAREQ1_DEV_114_Msk               (0x01UL << SCT_DMAREQ1_DEV_114_Pos)                     /*!< SCT DMAREQ1: DEV_114 Mask               */
#define SCT_DMAREQ1_DEV_115_Pos               15                                                      /*!< SCT DMAREQ1: DEV_115 Position           */
#define SCT_DMAREQ1_DEV_115_Msk               (0x01UL << SCT_DMAREQ1_DEV_115_Pos)                     /*!< SCT DMAREQ1: DEV_115 Mask               */
#define SCT_DMAREQ1_DRL1_Pos                  30                                                      /*!< SCT DMAREQ1: DRL1 Position              */
#define SCT_DMAREQ1_DRL1_Msk                  (0x01UL << SCT_DMAREQ1_DRL1_Pos)                        /*!< SCT DMAREQ1: DRL1 Mask                  */
#define SCT_DMAREQ1_DRQ1_Pos                  31                                                      /*!< SCT DMAREQ1: DRQ1 Position              */
#define SCT_DMAREQ1_DRQ1_Msk                  (0x01UL << SCT_DMAREQ1_DRQ1_Pos)                        /*!< SCT DMAREQ1: DRQ1 Mask                  */

/* ----------------------------------  SCT_EVEN  ---------------------------------- */
#define SCT_EVEN_IEN0_Pos                     0                                                       /*!< SCT EVEN: IEN0 Position                 */
#define SCT_EVEN_IEN0_Msk                     (0x01UL << SCT_EVEN_IEN0_Pos)                           /*!< SCT EVEN: IEN0 Mask                     */
#define SCT_EVEN_IEN1_Pos                     1                                                       /*!< SCT EVEN: IEN1 Position                 */
#define SCT_EVEN_IEN1_Msk                     (0x01UL << SCT_EVEN_IEN1_Pos)                           /*!< SCT EVEN: IEN1 Mask                     */
#define SCT_EVEN_IEN2_Pos                     2                                                       /*!< SCT EVEN: IEN2 Position                 */
#define SCT_EVEN_IEN2_Msk                     (0x01UL << SCT_EVEN_IEN2_Pos)                           /*!< SCT EVEN: IEN2 Mask                     */
#define SCT_EVEN_IEN3_Pos                     3                                                       /*!< SCT EVEN: IEN3 Position                 */
#define SCT_EVEN_IEN3_Msk                     (0x01UL << SCT_EVEN_IEN3_Pos)                           /*!< SCT EVEN: IEN3 Mask                     */
#define SCT_EVEN_IEN4_Pos                     4                                                       /*!< SCT EVEN: IEN4 Position                 */
#define SCT_EVEN_IEN4_Msk                     (0x01UL << SCT_EVEN_IEN4_Pos)                           /*!< SCT EVEN: IEN4 Mask                     */
#define SCT_EVEN_IEN5_Pos                     5                                                       /*!< SCT EVEN: IEN5 Position                 */
#define SCT_EVEN_IEN5_Msk                     (0x01UL << SCT_EVEN_IEN5_Pos)                           /*!< SCT EVEN: IEN5 Mask                     */
#define SCT_EVEN_IEN6_Pos                     6                                                       /*!< SCT EVEN: IEN6 Position                 */
#define SCT_EVEN_IEN6_Msk                     (0x01UL << SCT_EVEN_IEN6_Pos)                           /*!< SCT EVEN: IEN6 Mask                     */
#define SCT_EVEN_IEN7_Pos                     7                                                       /*!< SCT EVEN: IEN7 Position                 */
#define SCT_EVEN_IEN7_Msk                     (0x01UL << SCT_EVEN_IEN7_Pos)                           /*!< SCT EVEN: IEN7 Mask                     */
#define SCT_EVEN_IEN8_Pos                     8                                                       /*!< SCT EVEN: IEN8 Position                 */
#define SCT_EVEN_IEN8_Msk                     (0x01UL << SCT_EVEN_IEN8_Pos)                           /*!< SCT EVEN: IEN8 Mask                     */
#define SCT_EVEN_IEN9_Pos                     9                                                       /*!< SCT EVEN: IEN9 Position                 */
#define SCT_EVEN_IEN9_Msk                     (0x01UL << SCT_EVEN_IEN9_Pos)                           /*!< SCT EVEN: IEN9 Mask                     */
#define SCT_EVEN_IEN10_Pos                    10                                                      /*!< SCT EVEN: IEN10 Position                */
#define SCT_EVEN_IEN10_Msk                    (0x01UL << SCT_EVEN_IEN10_Pos)                          /*!< SCT EVEN: IEN10 Mask                    */
#define SCT_EVEN_IEN11_Pos                    11                                                      /*!< SCT EVEN: IEN11 Position                */
#define SCT_EVEN_IEN11_Msk                    (0x01UL << SCT_EVEN_IEN11_Pos)                          /*!< SCT EVEN: IEN11 Mask                    */
#define SCT_EVEN_IEN12_Pos                    12                                                      /*!< SCT EVEN: IEN12 Position                */
#define SCT_EVEN_IEN12_Msk                    (0x01UL << SCT_EVEN_IEN12_Pos)                          /*!< SCT EVEN: IEN12 Mask                    */
#define SCT_EVEN_IEN13_Pos                    13                                                      /*!< SCT EVEN: IEN13 Position                */
#define SCT_EVEN_IEN13_Msk                    (0x01UL << SCT_EVEN_IEN13_Pos)                          /*!< SCT EVEN: IEN13 Mask                    */
#define SCT_EVEN_IEN14_Pos                    14                                                      /*!< SCT EVEN: IEN14 Position                */
#define SCT_EVEN_IEN14_Msk                    (0x01UL << SCT_EVEN_IEN14_Pos)                          /*!< SCT EVEN: IEN14 Mask                    */
#define SCT_EVEN_IEN15_Pos                    15                                                      /*!< SCT EVEN: IEN15 Position                */
#define SCT_EVEN_IEN15_Msk                    (0x01UL << SCT_EVEN_IEN15_Pos)                          /*!< SCT EVEN: IEN15 Mask                    */

