roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCT_MATCH0  --------------------------------- */
#define SCT_MATCH0_MATCH_L_Pos                0                                                       /*!< SCT MATCH0: MATCH_L Position            */
#define SCT_MATCH0_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH0_MATCH_L_Pos)                /*!< SCT MATCH0: MATCH_L Mask                */
#define SCT_MATCH0_MATCH_H_Pos                16                                                      /*!< SCT MATCH0: MATCH_H Position            */
#define SCT_MATCH0_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH0_MATCH_H_Pos)                /*!< SCT MATCH0: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP0  ---------------------------------- */
#define SCT_CAP0_CAP_L_Pos                    0                                                       /*!< SCT CAP0: CAP_L Position                */
#define SCT_CAP0_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP0_CAP_L_Pos)                    /*!< SCT CAP0: CAP_L Mask                    */
#define SCT_CAP0_CAP_H_Pos                    16                                                      /*!< SCT CAP0: CAP_H Position                */
#define SCT_CAP0_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP0_CAP_H_Pos)                    /*!< SCT CAP0: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH1  --------------------------------- */
#define SCT_MATCH1_MATCH_L_Pos                0                                                       /*!< SCT MATCH1: MATCH_L Position            */
#define SCT_MATCH1_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH1_MATCH_L_Pos)                /*!< SCT MATCH1: MATCH_L Mask                */
#define SCT_MATCH1_MATCH_H_Pos                16                                                      /*!< SCT MATCH1: MATCH_H Position            */
#define SCT_MATCH1_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH1_MATCH_H_Pos)                /*!< SCT MATCH1: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP1  ---------------------------------- */
#define SCT_CAP1_CAP_L_Pos                    0                                                       /*!< SCT CAP1: CAP_L Position                */
#define SCT_CAP1_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP1_CAP_L_Pos)                    /*!< SCT CAP1: CAP_L Mask                    */
#define SCT_CAP1_CAP_H_Pos                    16                                                      /*!< SCT CAP1: CAP_H Position                */
#define SCT_CAP1_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP1_CAP_H_Pos)                    /*!< SCT CAP1: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH2  --------------------------------- */
#define SCT_MATCH2_MATCH_L_Pos                0                                                       /*!< SCT MATCH2: MATCH_L Position            */
#define SCT_MATCH2_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH2_MATCH_L_Pos)                /*!< SCT MATCH2: MATCH_L Mask                */
#define SCT_MATCH2_MATCH_H_Pos                16                                                      /*!< SCT MATCH2: MATCH_H Position            */
#define SCT_MATCH2_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH2_MATCH_H_Pos)                /*!< SCT MATCH2: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP2  ---------------------------------- */
#define SCT_CAP2_CAP_L_Pos                    0                                                       /*!< SCT CAP2: CAP_L Position                */
#define SCT_CAP2_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP2_CAP_L_Pos)                    /*!< SCT CAP2: CAP_L Mask                    */
#define SCT_CAP2_CAP_H_Pos                    16                                                      /*!< SCT CAP2: CAP_H Position                */
#define SCT_CAP2_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP2_CAP_H_Pos)                    /*!< SCT CAP2: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH3  --------------------------------- */
#define SCT_MATCH3_MATCH_L_Pos                0                                                       /*!< SCT MATCH3: MATCH_L Position            */
#define SCT_MATCH3_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH3_MATCH_L_Pos)                /*!< SCT MATCH3: MATCH_L Mask                */
#define SCT_MATCH3_MATCH_H_Pos                16                                                      /*!< SCT MATCH3: MATCH_H Position            */
#define SCT_MATCH3_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH3_MATCH_H_Pos)                /*!< SCT MATCH3: MATCH_H Mask                */

/* ----------------------------------  SCT_CAP3  ---------------------------------- */
#define SCT_CAP3_CAP_L_Pos                    0                                                       /*!< SCT CAP3: CAP_L Position                */
#define SCT_CAP3_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP3_CAP_L_Pos)                    /*!< SCT CAP3: CAP_L Mask                    */
#define SCT_CAP3_CAP_H_Pos                    16                                                      /*!< SCT CAP3: CAP_H Position                */
#define SCT_CAP3_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP3_CAP_H_Pos)                    /*!< SCT CAP3: CAP_H Mask                    */

/* ----------------------------------  SCT_CAP4  ---------------------------------- */
#define SCT_CAP4_CAP_L_Pos                    0                                                       /*!< SCT CAP4: CAP_L Position                */
#define SCT_CAP4_CAP_L_Msk                    (0x0000ffffUL << SCT_CAP4_CAP_L_Pos)                    /*!< SCT CAP4: CAP_L Mask                    */
#define SCT_CAP4_CAP_H_Pos                    16                                                      /*!< SCT CAP4: CAP_H Position                */
#define SCT_CAP4_CAP_H_Msk                    (0x0000ffffUL << SCT_CAP4_CAP_H_Pos)                    /*!< SCT CAP4: CAP_H Mask                    */

/* ---------------------------------  SCT_MATCH4  --------------------------------- */
#define SCT_MATCH4_MATCH_L_Pos                0                                                       /*!< SCT MATCH4: MATCH_L Position            */
#define SCT_MATCH4_MATCH_L_Msk                (0x0000ffffUL << SCT_MATCH4_MATCH_L_Pos)                /*!< SCT MATCH4: MATCH_L Mask                */
#define SCT_MATCH4_MATCH_H_Pos                16                                                      /*!< SCT MATCH4: MATCH_H Position            */
#define SCT_MATCH4_MATCH_H_Msk                (0x0000ffffUL << SCT_MATCH4_MATCH_H_Pos)                /*!< SCT MATCH4: MATCH_H Mask                */

