roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCT_MATCH10  -------------------------------- */
#define SCT_MATCH10_MATCH_L_Pos               0                                                       /*!< SCT MATCH10: MATCH_L Position           */
#define SCT_MATCH10_MATCH_L_Msk               (0x0000ffffUL << SCT_MATCH10_MATCH_L_Pos)               /*!< SCT MATCH10: MATCH_L Mask               */
#define SCT_MATCH10_MATCH_H_Pos               16                                                      /*!< SCT MATCH10: MATCH_H Position           */
#define SCT_MATCH10_MATCH_H_Msk               (0x0000ffffUL << SCT_MATCH10_MATCH_H_Pos)               /*!< SCT MATCH10: MATCH_H Mask               */

/* ----------------------------------  SCT_CAP11  --------------------------------- */
#define SCT_CAP11_CAP_L_Pos                   0                                                       /*!< SCT CAP11: CAP_L Position               */
#define SCT_CAP11_CAP_L_Msk                   (0x0000ffffUL << SCT_CAP11_CAP_L_Pos)                   /*!< SCT CAP11: CAP_L Mask                   */
#define SCT_CAP11_CAP_H_Pos                   16                                                      /*!< SCT CAP11: CAP_H Position               */
#define SCT_CAP11_CAP_H_Msk                   (0x0000ffffUL << SCT_CAP11_CAP_H_Pos)                   /*!< SCT CAP11: CAP_H Mask                   */

/* ---------------------------------  SCT_MATCH11  -------------------------------- */
#define SCT_MATCH11_MATCH_L_Pos               0                                                       /*!< SCT MATCH11: MATCH_L Position           */
#define SCT_MATCH11_MATCH_L_Msk               (0x0000ffffUL << SCT_MATCH11_MATCH_L_Pos)               /*!< SCT MATCH11: MATCH_L Mask               */
#define SCT_MATCH11_MATCH_H_Pos               16                                                      /*!< SCT MATCH11: MATCH_H Position           */
#define SCT_MATCH11_MATCH_H_Msk               (0x0000ffffUL << SCT_MATCH11_MATCH_H_Pos)               /*!< SCT MATCH11: MATCH_H Mask               */

/* ----------------------------------  SCT_CAP12  --------------------------------- */
#define SCT_CAP12_CAP_L_Pos                   0                                                       /*!< SCT CAP12: CAP_L Position               */
#define SCT_CAP12_CAP_L_Msk                   (0x0000ffffUL << SCT_CAP12_CAP_L_Pos)                   /*!< SCT CAP12: CAP_L Mask                   */
#define SCT_CAP12_CAP_H_Pos                   16                                                      /*!< SCT CAP12: CAP_H Position               */
#define SCT_CAP12_CAP_H_Msk                   (0x0000ffffUL << SCT_CAP12_CAP_H_Pos)                   /*!< SCT CAP12: CAP_H Mask                   */

/* ---------------------------------  SCT_MATCH12  -------------------------------- */
#define SCT_MATCH12_MATCH_L_Pos               0                                                       /*!< SCT MATCH12: MATCH_L Position           */
#define SCT_MATCH12_MATCH_L_Msk               (0x0000ffffUL << SCT_MATCH12_MATCH_L_Pos)               /*!< SCT MATCH12: MATCH_L Mask               */
#define SCT_MATCH12_MATCH_H_Pos               16                                                      /*!< SCT MATCH12: MATCH_H Position           */
#define SCT_MATCH12_MATCH_H_Msk               (0x0000ffffUL << SCT_MATCH12_MATCH_H_Pos)               /*!< SCT MATCH12: MATCH_H Mask               */

/* ---------------------------------  SCT_MATCH13  -------------------------------- */
#define SCT_MATCH13_MATCH_L_Pos               0                                                       /*!< SCT MATCH13: MATCH_L Position           */
#define SCT_MATCH13_MATCH_L_Msk               (0x0000ffffUL << SCT_MATCH13_MATCH_L_Pos)               /*!< SCT MATCH13: MATCH_L Mask               */
#define SCT_MATCH13_MATCH_H_Pos               16                                                      /*!< SCT MATCH13: MATCH_H Position           */
#define SCT_MATCH13_MATCH_H_Msk               (0x0000ffffUL << SCT_MATCH13_MATCH_H_Pos)               /*!< SCT MATCH13: MATCH_H Mask               */

/* ----------------------------------  SCT_CAP13  --------------------------------- */
#define SCT_CAP13_CAP_L_Pos                   0                                                       /*!< SCT CAP13: CAP_L Position               */
#define SCT_CAP13_CAP_L_Msk                   (0x0000ffffUL << SCT_CAP13_CAP_L_Pos)                   /*!< SCT CAP13: CAP_L Mask                   */
#define SCT_CAP13_CAP_H_Pos                   16                                                      /*!< SCT CAP13: CAP_H Position               */
#define SCT_CAP13_CAP_H_Msk                   (0x0000ffffUL << SCT_CAP13_CAP_H_Pos)                   /*!< SCT CAP13: CAP_H Mask                   */

/* ----------------------------------  SCT_CAP14  --------------------------------- */
#define SCT_CAP14_CAP_L_Pos                   0                                                       /*!< SCT CAP14: CAP_L Position               */
#define SCT_CAP14_CAP_L_Msk                   (0x0000ffffUL << SCT_CAP14_CAP_L_Pos)                   /*!< SCT CAP14: CAP_L Mask                   */
#define SCT_CAP14_CAP_H_Pos                   16                                                      /*!< SCT CAP14: CAP_H Position               */
#define SCT_CAP14_CAP_H_Msk                   (0x0000ffffUL << SCT_CAP14_CAP_H_Pos)                   /*!< SCT CAP14: CAP_H Mask                   */

/* ---------------------------------  SCT_MATCH14  -------------------------------- */
#define SCT_MATCH14_MATCH_L_Pos               0                                                       /*!< SCT MATCH14: MATCH_L Position           */
#define SCT_MATCH14_MATCH_L_Msk               (0x0000ffffUL << SCT_MATCH14_MATCH_L_Pos)               /*!< SCT MATCH14: MATCH_L Mask               */
#define SCT_MATCH14_MATCH_H_Pos               16                                                      /*!< SCT MATCH14: MATCH_H Position           */
#define SCT_MATCH14_MATCH_H_Msk               (0x0000ffffUL << SCT_MATCH14_MATCH_H_Pos)               /*!< SCT MATCH14: MATCH_H Mask               */

/* ---------------------------------  SCT_MATCH15  -------------------------------- */
#define SCT_MATCH15_MATCH_L_Pos               0                                                       /*!< SCT MATCH15: MATCH_L Position           */
#define SCT_MATCH15_MATCH_L_Msk               (0x0000ffffUL << SCT_MATCH15_MATCH_L_Pos)               /*!< SCT MATCH15: MATCH_L Mask               */
#define SCT_MATCH15_MATCH_H_Pos               16                                                      /*!< SCT MATCH15: MATCH_H Position           */
#define SCT_MATCH15_MATCH_H_Msk               (0x0000ffffUL << SCT_MATCH15_MATCH_H_Pos)               /*!< SCT MATCH15: MATCH_H Mask               */

/* ----------------------------------  SCT_CAP15  --------------------------------- */
#define SCT_CAP15_CAP_L_Pos                   0                                                       /*!< SCT CAP15: CAP_L Position               */
#define SCT_CAP15_CAP_L_Msk                   (0x0000ffffUL << SCT_CAP15_CAP_L_Pos)                   /*!< SCT CAP15: CAP_L Mask                   */
#define SCT_CAP15_CAP_H_Pos                   16                                                      /*!< SCT CAP15: CAP_H Position               */
#define SCT_CAP15_CAP_H_Msk                   (0x0000ffffUL << SCT_CAP15_CAP_H_Pos)                   /*!< SCT CAP15: CAP_H Mask                   */

/* --------------------------------  SCT_FRACMAT0  -------------------------------- */
#define SCT_FRACMAT0_FRACMAT_L_Pos            0                                                       /*!< SCT FRACMAT0: FRACMAT_L Position        */
#define SCT_FRACMAT0_FRACMAT_L_Msk            (0x0fUL << SCT_FRACMAT0_FRACMAT_L_Pos)                  /*!< SCT FRACMAT0: FRACMAT_L Mask            */
#define SCT_FRACMAT0_FRACMAT_H_Pos            16                                                      /*!< SCT FRACMAT0: FRACMAT_H Position        */
#define SCT_FRACMAT0_FRACMAT_H_Msk            (0x0fUL << SCT_FRACMAT0_FRACMAT_H_Pos)                  /*!< SCT FRACMAT0: FRACMAT_H Mask            */

/* --------------------------------  SCT_FRACMAT1  -------------------------------- */
#define SCT_FRACMAT1_FRACMAT_L_Pos            0                                                       /*!< SCT FRACMAT1: FRACMAT_L Position        */
#define SCT_FRACMAT1_FRACMAT_L_Msk            (0x0fUL << SCT_FRACMAT1_FRACMAT_L_Pos)                  /*!< SCT FRACMAT1: FRACMAT_L Mask            */
#define SCT_FRACMAT1_FRACMAT_H_Pos            16                                                      /*!< SCT FRACMAT1: FRACMAT_H Position        */
#define SCT_FRACMAT1_FRACMAT_H_Msk            (0x0fUL << SCT_FRACMAT1_FRACMAT_H_Pos)                  /*!< SCT FRACMAT1: FRACMAT_H Mask            */

