roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  SCT_MATCHREL13  ------------------------------- */
#define SCT_MATCHREL13_RELOAD_L_Pos           0                                                       /*!< SCT MATCHREL13: RELOAD_L Position       */
#define SCT_MATCHREL13_RELOAD_L_Msk           (0x0000ffffUL << SCT_MATCHREL13_RELOAD_L_Pos)           /*!< SCT MATCHREL13: RELOAD_L Mask           */
#define SCT_MATCHREL13_RELOAD_H_Pos           16                                                      /*!< SCT MATCHREL13: RELOAD_H Position       */
#define SCT_MATCHREL13_RELOAD_H_Msk           (0x0000ffffUL << SCT_MATCHREL13_RELOAD_H_Pos)           /*!< SCT MATCHREL13: RELOAD_H Mask           */

/* --------------------------------  SCT_CAPCTRL13  ------------------------------- */
#define SCT_CAPCTRL13_CAPCON_L_Pos            0                                                       /*!< SCT CAPCTRL13: CAPCON_L Position        */
#define SCT_CAPCTRL13_CAPCON_L_Msk            (0x0000ffffUL << SCT_CAPCTRL13_CAPCON_L_Pos)            /*!< SCT CAPCTRL13: CAPCON_L Mask            */
#define SCT_CAPCTRL13_CAPCON_H_Pos            16                                                      /*!< SCT CAPCTRL13: CAPCON_H Position        */
#define SCT_CAPCTRL13_CAPCON_H_Msk            (0x0000ffffUL << SCT_CAPCTRL13_CAPCON_H_Pos)            /*!< SCT CAPCTRL13: CAPCON_H Mask            */

/* -------------------------------  SCT_MATCHREL14  ------------------------------- */
#define SCT_MATCHREL14_RELOAD_L_Pos           0                                                       /*!< SCT MATCHREL14: RELOAD_L Position       */
#define SCT_MATCHREL14_RELOAD_L_Msk           (0x0000ffffUL << SCT_MATCHREL14_RELOAD_L_Pos)           /*!< SCT MATCHREL14: RELOAD_L Mask           */
#define SCT_MATCHREL14_RELOAD_H_Pos           16                                                      /*!< SCT MATCHREL14: RELOAD_H Position       */
#define SCT_MATCHREL14_RELOAD_H_Msk           (0x0000ffffUL << SCT_MATCHREL14_RELOAD_H_Pos)           /*!< SCT MATCHREL14: RELOAD_H Mask           */

/* --------------------------------  SCT_CAPCTRL14  ------------------------------- */
#define SCT_CAPCTRL14_CAPCON_L_Pos            0                                                       /*!< SCT CAPCTRL14: CAPCON_L Position        */
#define SCT_CAPCTRL14_CAPCON_L_Msk            (0x0000ffffUL << SCT_CAPCTRL14_CAPCON_L_Pos)            /*!< SCT CAPCTRL14: CAPCON_L Mask            */
#define SCT_CAPCTRL14_CAPCON_H_Pos            16                                                      /*!< SCT CAPCTRL14: CAPCON_H Position        */
#define SCT_CAPCTRL14_CAPCON_H_Msk            (0x0000ffffUL << SCT_CAPCTRL14_CAPCON_H_Pos)            /*!< SCT CAPCTRL14: CAPCON_H Mask            */

/* -------------------------------  SCT_MATCHREL15  ------------------------------- */
#define SCT_MATCHREL15_RELOAD_L_Pos           0                                                       /*!< SCT MATCHREL15: RELOAD_L Position       */
#define SCT_MATCHREL15_RELOAD_L_Msk           (0x0000ffffUL << SCT_MATCHREL15_RELOAD_L_Pos)           /*!< SCT MATCHREL15: RELOAD_L Mask           */
#define SCT_MATCHREL15_RELOAD_H_Pos           16                                                      /*!< SCT MATCHREL15: RELOAD_H Position       */
#define SCT_MATCHREL15_RELOAD_H_Msk           (0x0000ffffUL << SCT_MATCHREL15_RELOAD_H_Pos)           /*!< SCT MATCHREL15: RELOAD_H Mask           */

/* --------------------------------  SCT_CAPCTRL15  ------------------------------- */
#define SCT_CAPCTRL15_CAPCON_L_Pos            0                                                       /*!< SCT CAPCTRL15: CAPCON_L Position        */
#define SCT_CAPCTRL15_CAPCON_L_Msk            (0x0000ffffUL << SCT_CAPCTRL15_CAPCON_L_Pos)            /*!< SCT CAPCTRL15: CAPCON_L Mask            */
#define SCT_CAPCTRL15_CAPCON_H_Pos            16                                                      /*!< SCT CAPCTRL15: CAPCON_H Position        */
#define SCT_CAPCTRL15_CAPCON_H_Msk            (0x0000ffffUL << SCT_CAPCTRL15_CAPCON_H_Pos)            /*!< SCT CAPCTRL15: CAPCON_H Mask            */

/* -------------------------------  SCT_FRACMATREL0  ------------------------------ */
#define SCT_FRACMATREL0_RELFRAC_L_Pos         0                                                       /*!< SCT FRACMATREL0: RELFRAC_L Position     */
#define SCT_FRACMATREL0_RELFRAC_L_Msk         (0x0fUL << SCT_FRACMATREL0_RELFRAC_L_Pos)               /*!< SCT FRACMATREL0: RELFRAC_L Mask         */
#define SCT_FRACMATREL0_RELFRAC_H_Pos         16                                                      /*!< SCT FRACMATREL0: RELFRAC_H Position     */
#define SCT_FRACMATREL0_RELFRAC_H_Msk         (0x0fUL << SCT_FRACMATREL0_RELFRAC_H_Pos)               /*!< SCT FRACMATREL0: RELFRAC_H Mask         */

/* -------------------------------  SCT_FRACMATREL1  ------------------------------ */
#define SCT_FRACMATREL1_RELFRAC_L_Pos         0                                                       /*!< SCT FRACMATREL1: RELFRAC_L Position     */
#define SCT_FRACMATREL1_RELFRAC_L_Msk         (0x0fUL << SCT_FRACMATREL1_RELFRAC_L_Pos)               /*!< SCT FRACMATREL1: RELFRAC_L Mask         */
#define SCT_FRACMATREL1_RELFRAC_H_Pos         16                                                      /*!< SCT FRACMATREL1: RELFRAC_H Position     */
#define SCT_FRACMATREL1_RELFRAC_H_Msk         (0x0fUL << SCT_FRACMATREL1_RELFRAC_H_Pos)               /*!< SCT FRACMATREL1: RELFRAC_H Mask         */

/* -------------------------------  SCT_FRACMATREL2  ------------------------------ */
#define SCT_FRACMATREL2_RELFRAC_L_Pos         0                                                       /*!< SCT FRACMATREL2: RELFRAC_L Position     */
#define SCT_FRACMATREL2_RELFRAC_L_Msk         (0x0fUL << SCT_FRACMATREL2_RELFRAC_L_Pos)               /*!< SCT FRACMATREL2: RELFRAC_L Mask         */
#define SCT_FRACMATREL2_RELFRAC_H_Pos         16                                                      /*!< SCT FRACMATREL2: RELFRAC_H Position     */
#define SCT_FRACMATREL2_RELFRAC_H_Msk         (0x0fUL << SCT_FRACMATREL2_RELFRAC_H_Pos)               /*!< SCT FRACMATREL2: RELFRAC_H Mask         */

/* -------------------------------  SCT_FRACMATREL3  ------------------------------ */
#define SCT_FRACMATREL3_RELFRAC_L_Pos         0                                                       /*!< SCT FRACMATREL3: RELFRAC_L Position     */
#define SCT_FRACMATREL3_RELFRAC_L_Msk         (0x0fUL << SCT_FRACMATREL3_RELFRAC_L_Pos)               /*!< SCT FRACMATREL3: RELFRAC_L Mask         */
#define SCT_FRACMATREL3_RELFRAC_H_Pos         16                                                      /*!< SCT FRACMATREL3: RELFRAC_H Position     */
#define SCT_FRACMATREL3_RELFRAC_H_Msk         (0x0fUL << SCT_FRACMATREL3_RELFRAC_H_Pos)               /*!< SCT FRACMATREL3: RELFRAC_H Mask         */

