roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCT_EV10_CTRL  ------------------------------- */
#define SCT_EV10_CTRL_MATCHSEL_Pos            0                                                       /*!< SCT EV10_CTRL: MATCHSEL Position        */
#define SCT_EV10_CTRL_MATCHSEL_Msk            (0x0fUL << SCT_EV10_CTRL_MATCHSEL_Pos)                  /*!< SCT EV10_CTRL: MATCHSEL Mask            */
#define SCT_EV10_CTRL_HEVENT_Pos              4                                                       /*!< SCT EV10_CTRL: HEVENT Position          */
#define SCT_EV10_CTRL_HEVENT_Msk              (0x01UL << SCT_EV10_CTRL_HEVENT_Pos)                    /*!< SCT EV10_CTRL: HEVENT Mask              */
#define SCT_EV10_CTRL_OUTSEL_Pos              5                                                       /*!< SCT EV10_CTRL: OUTSEL Position          */
#define SCT_EV10_CTRL_OUTSEL_Msk              (0x01UL << SCT_EV10_CTRL_OUTSEL_Pos)                    /*!< SCT EV10_CTRL: OUTSEL Mask              */
#define SCT_EV10_CTRL_IOSEL_Pos               6                                                       /*!< SCT EV10_CTRL: IOSEL Position           */
#define SCT_EV10_CTRL_IOSEL_Msk               (0x0fUL << SCT_EV10_CTRL_IOSEL_Pos)                     /*!< SCT EV10_CTRL: IOSEL Mask               */
#define SCT_EV10_CTRL_IOCOND_Pos              10                                                      /*!< SCT EV10_CTRL: IOCOND Position          */
#define SCT_EV10_CTRL_IOCOND_Msk              (0x03UL << SCT_EV10_CTRL_IOCOND_Pos)                    /*!< SCT EV10_CTRL: IOCOND Mask              */
#define SCT_EV10_CTRL_COMBMODE_Pos            12                                                      /*!< SCT EV10_CTRL: COMBMODE Position        */
#define SCT_EV10_CTRL_COMBMODE_Msk            (0x03UL << SCT_EV10_CTRL_COMBMODE_Pos)                  /*!< SCT EV10_CTRL: COMBMODE Mask            */
#define SCT_EV10_CTRL_STATELD_Pos             14                                                      /*!< SCT EV10_CTRL: STATELD Position         */
#define SCT_EV10_CTRL_STATELD_Msk             (0x01UL << SCT_EV10_CTRL_STATELD_Pos)                   /*!< SCT EV10_CTRL: STATELD Mask             */
#define SCT_EV10_CTRL_STATEV_Pos              15                                                      /*!< SCT EV10_CTRL: STATEV Position          */
#define SCT_EV10_CTRL_STATEV_Msk              (0x1fUL << SCT_EV10_CTRL_STATEV_Pos)                    /*!< SCT EV10_CTRL: STATEV Mask              */
#define SCT_EV10_CTRL_MATCHMEM_Pos            20                                                      /*!< SCT EV10_CTRL: MATCHMEM Position        */
#define SCT_EV10_CTRL_MATCHMEM_Msk            (0x01UL << SCT_EV10_CTRL_MATCHMEM_Pos)                  /*!< SCT EV10_CTRL: MATCHMEM Mask            */
#define SCT_EV10_CTRL_DIRECTION_Pos           21                                                      /*!< SCT EV10_CTRL: DIRECTION Position       */
#define SCT_EV10_CTRL_DIRECTION_Msk           (0x03UL << SCT_EV10_CTRL_DIRECTION_Pos)                 /*!< SCT EV10_CTRL: DIRECTION Mask           */

/* -------------------------------  SCT_EV11_STATE  ------------------------------- */
#define SCT_EV11_STATE_STATEMSK0_Pos          0                                                       /*!< SCT EV11_STATE: STATEMSK0 Position      */
#define SCT_EV11_STATE_STATEMSK0_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK0_Pos)                /*!< SCT EV11_STATE: STATEMSK0 Mask          */
#define SCT_EV11_STATE_STATEMSK1_Pos          1                                                       /*!< SCT EV11_STATE: STATEMSK1 Position      */
#define SCT_EV11_STATE_STATEMSK1_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK1_Pos)                /*!< SCT EV11_STATE: STATEMSK1 Mask          */
#define SCT_EV11_STATE_STATEMSK2_Pos          2                                                       /*!< SCT EV11_STATE: STATEMSK2 Position      */
#define SCT_EV11_STATE_STATEMSK2_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK2_Pos)                /*!< SCT EV11_STATE: STATEMSK2 Mask          */
#define SCT_EV11_STATE_STATEMSK3_Pos          3                                                       /*!< SCT EV11_STATE: STATEMSK3 Position      */
#define SCT_EV11_STATE_STATEMSK3_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK3_Pos)                /*!< SCT EV11_STATE: STATEMSK3 Mask          */
#define SCT_EV11_STATE_STATEMSK4_Pos          4                                                       /*!< SCT EV11_STATE: STATEMSK4 Position      */
#define SCT_EV11_STATE_STATEMSK4_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK4_Pos)                /*!< SCT EV11_STATE: STATEMSK4 Mask          */
#define SCT_EV11_STATE_STATEMSK5_Pos          5                                                       /*!< SCT EV11_STATE: STATEMSK5 Position      */
#define SCT_EV11_STATE_STATEMSK5_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK5_Pos)                /*!< SCT EV11_STATE: STATEMSK5 Mask          */
#define SCT_EV11_STATE_STATEMSK6_Pos          6                                                       /*!< SCT EV11_STATE: STATEMSK6 Position      */
#define SCT_EV11_STATE_STATEMSK6_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK6_Pos)                /*!< SCT EV11_STATE: STATEMSK6 Mask          */
#define SCT_EV11_STATE_STATEMSK7_Pos          7                                                       /*!< SCT EV11_STATE: STATEMSK7 Position      */
#define SCT_EV11_STATE_STATEMSK7_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK7_Pos)                /*!< SCT EV11_STATE: STATEMSK7 Mask          */
#define SCT_EV11_STATE_STATEMSK8_Pos          8                                                       /*!< SCT EV11_STATE: STATEMSK8 Position      */
#define SCT_EV11_STATE_STATEMSK8_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK8_Pos)                /*!< SCT EV11_STATE: STATEMSK8 Mask          */
#define SCT_EV11_STATE_STATEMSK9_Pos          9                                                       /*!< SCT EV11_STATE: STATEMSK9 Position      */
#define SCT_EV11_STATE_STATEMSK9_Msk          (0x01UL << SCT_EV11_STATE_STATEMSK9_Pos)                /*!< SCT EV11_STATE: STATEMSK9 Mask          */
#define SCT_EV11_STATE_STATEMSK10_Pos         10                                                      /*!< SCT EV11_STATE: STATEMSK10 Position     */
#define SCT_EV11_STATE_STATEMSK10_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK10_Pos)               /*!< SCT EV11_STATE: STATEMSK10 Mask         */
#define SCT_EV11_STATE_STATEMSK11_Pos         11                                                      /*!< SCT EV11_STATE: STATEMSK11 Position     */
#define SCT_EV11_STATE_STATEMSK11_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK11_Pos)               /*!< SCT EV11_STATE: STATEMSK11 Mask         */
#define SCT_EV11_STATE_STATEMSK12_Pos         12                                                      /*!< SCT EV11_STATE: STATEMSK12 Position     */
#define SCT_EV11_STATE_STATEMSK12_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK12_Pos)               /*!< SCT EV11_STATE: STATEMSK12 Mask         */
#define SCT_EV11_STATE_STATEMSK13_Pos         13                                                      /*!< SCT EV11_STATE: STATEMSK13 Position     */
#define SCT_EV11_STATE_STATEMSK13_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK13_Pos)               /*!< SCT EV11_STATE: STATEMSK13 Mask         */
#define SCT_EV11_STATE_STATEMSK14_Pos         14                                                      /*!< SCT EV11_STATE: STATEMSK14 Position     */
#define SCT_EV11_STATE_STATEMSK14_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK14_Pos)               /*!< SCT EV11_STATE: STATEMSK14 Mask         */
#define SCT_EV11_STATE_STATEMSK15_Pos         15                                                      /*!< SCT EV11_STATE: STATEMSK15 Position     */
#define SCT_EV11_STATE_STATEMSK15_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK15_Pos)               /*!< SCT EV11_STATE: STATEMSK15 Mask         */
#define SCT_EV11_STATE_STATEMSK16_Pos         16                                                      /*!< SCT EV11_STATE: STATEMSK16 Position     */
#define SCT_EV11_STATE_STATEMSK16_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK16_Pos)               /*!< SCT EV11_STATE: STATEMSK16 Mask         */
#define SCT_EV11_STATE_STATEMSK17_Pos         17                                                      /*!< SCT EV11_STATE: STATEMSK17 Position     */
#define SCT_EV11_STATE_STATEMSK17_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK17_Pos)               /*!< SCT EV11_STATE: STATEMSK17 Mask         */
#define SCT_EV11_STATE_STATEMSK18_Pos         18                                                      /*!< SCT EV11_STATE: STATEMSK18 Position     */
#define SCT_EV11_STATE_STATEMSK18_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK18_Pos)               /*!< SCT EV11_STATE: STATEMSK18 Mask         */
#define SCT_EV11_STATE_STATEMSK19_Pos         19                                                      /*!< SCT EV11_STATE: STATEMSK19 Position     */
#define SCT_EV11_STATE_STATEMSK19_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK19_Pos)               /*!< SCT EV11_STATE: STATEMSK19 Mask         */
#define SCT_EV11_STATE_STATEMSK20_Pos         20                                                      /*!< SCT EV11_STATE: STATEMSK20 Position     */
#define SCT_EV11_STATE_STATEMSK20_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK20_Pos)               /*!< SCT EV11_STATE: STATEMSK20 Mask         */
#define SCT_EV11_STATE_STATEMSK21_Pos         21                                                      /*!< SCT EV11_STATE: STATEMSK21 Position     */
#define SCT_EV11_STATE_STATEMSK21_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK21_Pos)               /*!< SCT EV11_STATE: STATEMSK21 Mask         */
#define SCT_EV11_STATE_STATEMSK22_Pos         22                                                      /*!< SCT EV11_STATE: STATEMSK22 Position     */
#define SCT_EV11_STATE_STATEMSK22_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK22_Pos)               /*!< SCT EV11_STATE: STATEMSK22 Mask         */
#define SCT_EV11_STATE_STATEMSK23_Pos         23                                                      /*!< SCT EV11_STATE: STATEMSK23 Position     */
#define SCT_EV11_STATE_STATEMSK23_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK23_Pos)               /*!< SCT EV11_STATE: STATEMSK23 Mask         */
#define SCT_EV11_STATE_STATEMSK24_Pos         24                                                      /*!< SCT EV11_STATE: STATEMSK24 Position     */
#define SCT_EV11_STATE_STATEMSK24_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK24_Pos)               /*!< SCT EV11_STATE: STATEMSK24 Mask         */
#define SCT_EV11_STATE_STATEMSK25_Pos         25                                                      /*!< SCT EV11_STATE: STATEMSK25 Position     */
#define SCT_EV11_STATE_STATEMSK25_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK25_Pos)               /*!< SCT EV11_STATE: STATEMSK25 Mask         */
#define SCT_EV11_STATE_STATEMSK26_Pos         26                                                      /*!< SCT EV11_STATE: STATEMSK26 Position     */
#define SCT_EV11_STATE_STATEMSK26_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK26_Pos)               /*!< SCT EV11_STATE: STATEMSK26 Mask         */
#define SCT_EV11_STATE_STATEMSK27_Pos         27                                                      /*!< SCT EV11_STATE: STATEMSK27 Position     */
#define SCT_EV11_STATE_STATEMSK27_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK27_Pos)               /*!< SCT EV11_STATE: STATEMSK27 Mask         */
#define SCT_EV11_STATE_STATEMSK28_Pos         28                                                      /*!< SCT EV11_STATE: STATEMSK28 Position     */
#define SCT_EV11_STATE_STATEMSK28_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK28_Pos)               /*!< SCT EV11_STATE: STATEMSK28 Mask         */
#define SCT_EV11_STATE_STATEMSK29_Pos         29                                                      /*!< SCT EV11_STATE: STATEMSK29 Position     */
#define SCT_EV11_STATE_STATEMSK29_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK29_Pos)               /*!< SCT EV11_STATE: STATEMSK29 Mask         */
#define SCT_EV11_STATE_STATEMSK30_Pos         30                                                      /*!< SCT EV11_STATE: STATEMSK30 Position     */
#define SCT_EV11_STATE_STATEMSK30_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK30_Pos)               /*!< SCT EV11_STATE: STATEMSK30 Mask         */
#define SCT_EV11_STATE_STATEMSK31_Pos         31                                                      /*!< SCT EV11_STATE: STATEMSK31 Position     */
#define SCT_EV11_STATE_STATEMSK31_Msk         (0x01UL << SCT_EV11_STATE_STATEMSK31_Pos)               /*!< SCT EV11_STATE: STATEMSK31 Mask         */

/* --------------------------------  SCT_EV11_CTRL  ------------------------------- */
#define SCT_EV11_CTRL_MATCHSEL_Pos            0                                                       /*!< SCT EV11_CTRL: MATCHSEL Position        */
#define SCT_EV11_CTRL_MATCHSEL_Msk            (0x0fUL << SCT_EV11_CTRL_MATCHSEL_Pos)                  /*!< SCT EV11_CTRL: MATCHSEL Mask            */
#define SCT_EV11_CTRL_HEVENT_Pos              4                                                       /*!< SCT EV11_CTRL: HEVENT Position          */
#define SCT_EV11_CTRL_HEVENT_Msk              (0x01UL << SCT_EV11_CTRL_HEVENT_Pos)                    /*!< SCT EV11_CTRL: HEVENT Mask              */
#define SCT_EV11_CTRL_OUTSEL_Pos              5                                                       /*!< SCT EV11_CTRL: OUTSEL Position          */
#define SCT_EV11_CTRL_OUTSEL_Msk              (0x01UL << SCT_EV11_CTRL_OUTSEL_Pos)                    /*!< SCT EV11_CTRL: OUTSEL Mask              */
#define SCT_EV11_CTRL_IOSEL_Pos               6                                                       /*!< SCT EV11_CTRL: IOSEL Position           */
#define SCT_EV11_CTRL_IOSEL_Msk               (0x0fUL << SCT_EV11_CTRL_IOSEL_Pos)                     /*!< SCT EV11_CTRL: IOSEL Mask               */
#define SCT_EV11_CTRL_IOCOND_Pos              10                                                      /*!< SCT EV11_CTRL: IOCOND Position          */
#define SCT_EV11_CTRL_IOCOND_Msk              (0x03UL << SCT_EV11_CTRL_IOCOND_Pos)                    /*!< SCT EV11_CTRL: IOCOND Mask              */
#define SCT_EV11_CTRL_COMBMODE_Pos            12                                                      /*!< SCT EV11_CTRL: COMBMODE Position        */
#define SCT_EV11_CTRL_COMBMODE_Msk            (0x03UL << SCT_EV11_CTRL_COMBMODE_Pos)                  /*!< SCT EV11_CTRL: COMBMODE Mask            */
#define SCT_EV11_CTRL_STATELD_Pos             14                                                      /*!< SCT EV11_CTRL: STATELD Position         */
#define SCT_EV11_CTRL_STATELD_Msk             (0x01UL << SCT_EV11_CTRL_STATELD_Pos)                   /*!< SCT EV11_CTRL: STATELD Mask             */
#define SCT_EV11_CTRL_STATEV_Pos              15                                                      /*!< SCT EV11_CTRL: STATEV Position          */
#define SCT_EV11_CTRL_STATEV_Msk              (0x1fUL << SCT_EV11_CTRL_STATEV_Pos)                    /*!< SCT EV11_CTRL: STATEV Mask              */
#define SCT_EV11_CTRL_MATCHMEM_Pos            20                                                      /*!< SCT EV11_CTRL: MATCHMEM Position        */
#define SCT_EV11_CTRL_MATCHMEM_Msk            (0x01UL << SCT_EV11_CTRL_MATCHMEM_Pos)                  /*!< SCT EV11_CTRL: MATCHMEM Mask            */
#define SCT_EV11_CTRL_DIRECTION_Pos           21                                                      /*!< SCT EV11_CTRL: DIRECTION Position       */
#define SCT_EV11_CTRL_DIRECTION_Msk           (0x03UL << SCT_EV11_CTRL_DIRECTION_Pos)                 /*!< SCT EV11_CTRL: DIRECTION Mask           */

