roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  GPDMA_INTTCSTAT  ------------------------------ */
#define GPDMA_INTTCSTAT_INTTCSTAT0_Pos        0                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT0 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT0_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT0_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT0 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT1_Pos        1                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT1 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT1_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT1_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT1 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT2_Pos        2                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT2 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT2_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT2_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT2 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT3_Pos        3                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT3 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT3_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT3_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT3 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT4_Pos        4                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT4 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT4_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT4_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT4 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT5_Pos        5                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT5 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT5_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT5_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT5 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT6_Pos        6                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT6 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT6_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT6_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT6 Mask        */
#define GPDMA_INTTCSTAT_INTTCSTAT7_Pos        7                                                       /*!< GPDMA INTTCSTAT: INTTCSTAT7 Position    */
#define GPDMA_INTTCSTAT_INTTCSTAT7_Msk        (0x01UL << GPDMA_INTTCSTAT_INTTCSTAT7_Pos)              /*!< GPDMA INTTCSTAT: INTTCSTAT7 Mask        */

/* ------------------------------  GPDMA_INTTCCLEAR  ------------------------------ */
#define GPDMA_INTTCCLEAR_INTTCCLEAR0_Pos      0                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR0 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR0_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR0_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR0 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR1_Pos      1                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR1 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR1_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR1_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR1 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR2_Pos      2                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR2 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR2_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR2_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR2 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR3_Pos      3                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR3 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR3_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR3_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR3 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR4_Pos      4                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR4 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR4_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR4_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR4 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR5_Pos      5                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR5 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR5_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR5_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR5 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR6_Pos      6                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR6 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR6_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR6_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR6 Mask      */
#define GPDMA_INTTCCLEAR_INTTCCLEAR7_Pos      7                                                       /*!< GPDMA INTTCCLEAR: INTTCCLEAR7 Position  */
#define GPDMA_INTTCCLEAR_INTTCCLEAR7_Msk      (0x01UL << GPDMA_INTTCCLEAR_INTTCCLEAR7_Pos)            /*!< GPDMA INTTCCLEAR: INTTCCLEAR7 Mask      */

/* ------------------------------  GPDMA_INTERRSTAT  ------------------------------ */
#define GPDMA_INTERRSTAT_INTERRSTAT0_Pos      0                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT0 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT0_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT0_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT0 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT1_Pos      1                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT1 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT1_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT1_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT1 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT2_Pos      2                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT2 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT2_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT2_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT2 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT3_Pos      3                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT3 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT3_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT3_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT3 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT4_Pos      4                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT4 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT4_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT4_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT4 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT5_Pos      5                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT5 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT5_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT5_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT5 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT6_Pos      6                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT6 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT6_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT6_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT6 Mask      */
#define GPDMA_INTERRSTAT_INTERRSTAT7_Pos      7                                                       /*!< GPDMA INTERRSTAT: INTERRSTAT7 Position  */
#define GPDMA_INTERRSTAT_INTERRSTAT7_Msk      (0x01UL << GPDMA_INTERRSTAT_INTERRSTAT7_Pos)            /*!< GPDMA INTERRSTAT: INTERRSTAT7 Mask      */

/* -------------------------------  GPDMA_INTERRCLR  ------------------------------ */
#define GPDMA_INTERRCLR_INTERRCLR0_Pos        0                                                       /*!< GPDMA INTERRCLR: INTERRCLR0 Position    */
#define GPDMA_INTERRCLR_INTERRCLR0_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR0_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR0 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR1_Pos        1                                                       /*!< GPDMA INTERRCLR: INTERRCLR1 Position    */
#define GPDMA_INTERRCLR_INTERRCLR1_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR1_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR1 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR2_Pos        2                                                       /*!< GPDMA INTERRCLR: INTERRCLR2 Position    */
#define GPDMA_INTERRCLR_INTERRCLR2_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR2_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR2 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR3_Pos        3                                                       /*!< GPDMA INTERRCLR: INTERRCLR3 Position    */
#define GPDMA_INTERRCLR_INTERRCLR3_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR3_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR3 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR4_Pos        4                                                       /*!< GPDMA INTERRCLR: INTERRCLR4 Position    */
#define GPDMA_INTERRCLR_INTERRCLR4_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR4_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR4 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR5_Pos        5                                                       /*!< GPDMA INTERRCLR: INTERRCLR5 Position    */
#define GPDMA_INTERRCLR_INTERRCLR5_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR5_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR5 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR6_Pos        6                                                       /*!< GPDMA INTERRCLR: INTERRCLR6 Position    */
#define GPDMA_INTERRCLR_INTERRCLR6_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR6_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR6 Mask        */
#define GPDMA_INTERRCLR_INTERRCLR7_Pos        7                                                       /*!< GPDMA INTERRCLR: INTERRCLR7 Position    */
#define GPDMA_INTERRCLR_INTERRCLR7_Msk        (0x01UL << GPDMA_INTERRCLR_INTERRCLR7_Pos)              /*!< GPDMA INTERRCLR: INTERRCLR7 Mask        */

/* -----------------------------  GPDMA_RAWINTTCSTAT  ----------------------------- */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT0_Pos  0                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT0 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT0_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT0_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT0 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT1_Pos  1                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT1 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT1_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT1_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT1 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT2_Pos  2                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT2 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT2_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT2_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT2 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT3_Pos  3                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT3 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT3_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT3_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT3 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT4_Pos  4                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT4 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT4_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT4_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT4 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT5_Pos  5                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT5 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT5_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT5_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT5 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT6_Pos  6                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT6 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT6_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT6_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT6 Mask  */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT7_Pos  7                                                       /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT7 Position */
#define GPDMA_RAWINTTCSTAT_RAWINTTCSTAT7_Msk  (0x01UL << GPDMA_RAWINTTCSTAT_RAWINTTCSTAT7_Pos)        /*!< GPDMA RAWINTTCSTAT: RAWINTTCSTAT7 Mask  */

/* -----------------------------  GPDMA_RAWINTERRSTAT  ---------------------------- */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT0_Pos 0                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT0 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT0_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT0_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT0 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT1_Pos 1                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT1 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT1_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT1_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT1 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT2_Pos 2                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT2 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT2_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT2_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT2 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT3_Pos 3                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT3 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT3_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT3_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT3 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT4_Pos 4                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT4 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT4_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT4_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT4 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT5_Pos 5                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT5 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT5_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT5_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT5 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT6_Pos 6                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT6 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT6_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT6_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT6 Mask */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT7_Pos 7                                                      /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT7 Position */
#define GPDMA_RAWINTERRSTAT_RAWINTERRSTAT7_Msk (0x01UL << GPDMA_RAWINTERRSTAT_RAWINTERRSTAT7_Pos)     /*!< GPDMA RAWINTERRSTAT: RAWINTERRSTAT7 Mask */

