roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  GPDMA_C5CONTROL  ------------------------------ */
#define GPDMA_C5CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C5CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C5CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C5CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C5CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C5CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C5CONTROL: SBSIZE Position        */
#define GPDMA_C5CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C5CONTROL_SBSIZE_Pos)                  /*!< GPDMA C5CONTROL: SBSIZE Mask            */
#define GPDMA_C5CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C5CONTROL: DBSIZE Position        */
#define GPDMA_C5CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C5CONTROL_DBSIZE_Pos)                  /*!< GPDMA C5CONTROL: DBSIZE Mask            */
#define GPDMA_C5CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C5CONTROL: SWIDTH Position        */
#define GPDMA_C5CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C5CONTROL_SWIDTH_Pos)                  /*!< GPDMA C5CONTROL: SWIDTH Mask            */
#define GPDMA_C5CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C5CONTROL: DWIDTH Position        */
#define GPDMA_C5CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C5CONTROL_DWIDTH_Pos)                  /*!< GPDMA C5CONTROL: DWIDTH Mask            */
#define GPDMA_C5CONTROL_S_Pos                 24                                                      /*!< GPDMA C5CONTROL: S Position             */
#define GPDMA_C5CONTROL_S_Msk                 (0x01UL << GPDMA_C5CONTROL_S_Pos)                       /*!< GPDMA C5CONTROL: S Mask                 */
#define GPDMA_C5CONTROL_D_Pos                 25                                                      /*!< GPDMA C5CONTROL: D Position             */
#define GPDMA_C5CONTROL_D_Msk                 (0x01UL << GPDMA_C5CONTROL_D_Pos)                       /*!< GPDMA C5CONTROL: D Mask                 */
#define GPDMA_C5CONTROL_SI_Pos                26                                                      /*!< GPDMA C5CONTROL: SI Position            */
#define GPDMA_C5CONTROL_SI_Msk                (0x01UL << GPDMA_C5CONTROL_SI_Pos)                      /*!< GPDMA C5CONTROL: SI Mask                */
#define GPDMA_C5CONTROL_DI_Pos                27                                                      /*!< GPDMA C5CONTROL: DI Position            */
#define GPDMA_C5CONTROL_DI_Msk                (0x01UL << GPDMA_C5CONTROL_DI_Pos)                      /*!< GPDMA C5CONTROL: DI Mask                */
#define GPDMA_C5CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C5CONTROL: PROT1 Position         */
#define GPDMA_C5CONTROL_PROT1_Msk             (0x01UL << GPDMA_C5CONTROL_PROT1_Pos)                   /*!< GPDMA C5CONTROL: PROT1 Mask             */
#define GPDMA_C5CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C5CONTROL: PROT2 Position         */
#define GPDMA_C5CONTROL_PROT2_Msk             (0x01UL << GPDMA_C5CONTROL_PROT2_Pos)                   /*!< GPDMA C5CONTROL: PROT2 Mask             */
#define GPDMA_C5CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C5CONTROL: PROT3 Position         */
#define GPDMA_C5CONTROL_PROT3_Msk             (0x01UL << GPDMA_C5CONTROL_PROT3_Pos)                   /*!< GPDMA C5CONTROL: PROT3 Mask             */
#define GPDMA_C5CONTROL_I_Pos                 31                                                      /*!< GPDMA C5CONTROL: I Position             */
#define GPDMA_C5CONTROL_I_Msk                 (0x01UL << GPDMA_C5CONTROL_I_Pos)                       /*!< GPDMA C5CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C5CONFIG  ------------------------------- */
#define GPDMA_C5CONFIG_E_Pos                  0                                                       /*!< GPDMA C5CONFIG: E Position              */
#define GPDMA_C5CONFIG_E_Msk                  (0x01UL << GPDMA_C5CONFIG_E_Pos)                        /*!< GPDMA C5CONFIG: E Mask                  */
#define GPDMA_C5CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C5CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C5CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C5CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C5CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C5CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C5CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C5CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C5CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C5CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C5CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C5CONFIG: FLOWCNTRL Position      */
#define GPDMA_C5CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C5CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C5CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C5CONFIG_IE_Pos                 14                                                      /*!< GPDMA C5CONFIG: IE Position             */
#define GPDMA_C5CONFIG_IE_Msk                 (0x01UL << GPDMA_C5CONFIG_IE_Pos)                       /*!< GPDMA C5CONFIG: IE Mask                 */
#define GPDMA_C5CONFIG_ITC_Pos                15                                                      /*!< GPDMA C5CONFIG: ITC Position            */
#define GPDMA_C5CONFIG_ITC_Msk                (0x01UL << GPDMA_C5CONFIG_ITC_Pos)                      /*!< GPDMA C5CONFIG: ITC Mask                */
#define GPDMA_C5CONFIG_L_Pos                  16                                                      /*!< GPDMA C5CONFIG: L Position              */
#define GPDMA_C5CONFIG_L_Msk                  (0x01UL << GPDMA_C5CONFIG_L_Pos)                        /*!< GPDMA C5CONFIG: L Mask                  */
#define GPDMA_C5CONFIG_A_Pos                  17                                                      /*!< GPDMA C5CONFIG: A Position              */
#define GPDMA_C5CONFIG_A_Msk                  (0x01UL << GPDMA_C5CONFIG_A_Pos)                        /*!< GPDMA C5CONFIG: A Mask                  */
#define GPDMA_C5CONFIG_H_Pos                  18                                                      /*!< GPDMA C5CONFIG: H Position              */
#define GPDMA_C5CONFIG_H_Msk                  (0x01UL << GPDMA_C5CONFIG_H_Pos)                        /*!< GPDMA C5CONFIG: H Mask                  */

/* -------------------------------  GPDMA_C6SRCADDR  ------------------------------ */
#define GPDMA_C6SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C6SRCADDR: SRCADDR Position       */
#define GPDMA_C6SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C6SRCADDR_SRCADDR_Pos)           /*!< GPDMA C6SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C6DESTADDR  ------------------------------ */
#define GPDMA_C6DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C6DESTADDR: DESTADDR Position     */
#define GPDMA_C6DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C6DESTADDR_DESTADDR_Pos)         /*!< GPDMA C6DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C6LLI  -------------------------------- */
#define GPDMA_C6LLI_LM_Pos                    0                                                       /*!< GPDMA C6LLI: LM Position                */
#define GPDMA_C6LLI_LM_Msk                    (0x01UL << GPDMA_C6LLI_LM_Pos)                          /*!< GPDMA C6LLI: LM Mask                    */
#define GPDMA_C6LLI_R_Pos                     1                                                       /*!< GPDMA C6LLI: R Position                 */
#define GPDMA_C6LLI_R_Msk                     (0x01UL << GPDMA_C6LLI_R_Pos)                           /*!< GPDMA C6LLI: R Mask                     */
#define GPDMA_C6LLI_LLI_Pos                   2                                                       /*!< GPDMA C6LLI: LLI Position               */
#define GPDMA_C6LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C6LLI_LLI_Pos)                   /*!< GPDMA C6LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C6CONTROL  ------------------------------ */
#define GPDMA_C6CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C6CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C6CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C6CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C6CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C6CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C6CONTROL: SBSIZE Position        */
#define GPDMA_C6CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C6CONTROL_SBSIZE_Pos)                  /*!< GPDMA C6CONTROL: SBSIZE Mask            */
#define GPDMA_C6CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C6CONTROL: DBSIZE Position        */
#define GPDMA_C6CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C6CONTROL_DBSIZE_Pos)                  /*!< GPDMA C6CONTROL: DBSIZE Mask            */
#define GPDMA_C6CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C6CONTROL: SWIDTH Position        */
#define GPDMA_C6CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C6CONTROL_SWIDTH_Pos)                  /*!< GPDMA C6CONTROL: SWIDTH Mask            */
#define GPDMA_C6CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C6CONTROL: DWIDTH Position        */
#define GPDMA_C6CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C6CONTROL_DWIDTH_Pos)                  /*!< GPDMA C6CONTROL: DWIDTH Mask            */
#define GPDMA_C6CONTROL_S_Pos                 24                                                      /*!< GPDMA C6CONTROL: S Position             */
#define GPDMA_C6CONTROL_S_Msk                 (0x01UL << GPDMA_C6CONTROL_S_Pos)                       /*!< GPDMA C6CONTROL: S Mask                 */
#define GPDMA_C6CONTROL_D_Pos                 25                                                      /*!< GPDMA C6CONTROL: D Position             */
#define GPDMA_C6CONTROL_D_Msk                 (0x01UL << GPDMA_C6CONTROL_D_Pos)                       /*!< GPDMA C6CONTROL: D Mask                 */
#define GPDMA_C6CONTROL_SI_Pos                26                                                      /*!< GPDMA C6CONTROL: SI Position            */
#define GPDMA_C6CONTROL_SI_Msk                (0x01UL << GPDMA_C6CONTROL_SI_Pos)                      /*!< GPDMA C6CONTROL: SI Mask                */
#define GPDMA_C6CONTROL_DI_Pos                27                                                      /*!< GPDMA C6CONTROL: DI Position            */
#define GPDMA_C6CONTROL_DI_Msk                (0x01UL << GPDMA_C6CONTROL_DI_Pos)                      /*!< GPDMA C6CONTROL: DI Mask                */
#define GPDMA_C6CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C6CONTROL: PROT1 Position         */
#define GPDMA_C6CONTROL_PROT1_Msk             (0x01UL << GPDMA_C6CONTROL_PROT1_Pos)                   /*!< GPDMA C6CONTROL: PROT1 Mask             */
#define GPDMA_C6CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C6CONTROL: PROT2 Position         */
#define GPDMA_C6CONTROL_PROT2_Msk             (0x01UL << GPDMA_C6CONTROL_PROT2_Pos)                   /*!< GPDMA C6CONTROL: PROT2 Mask             */
#define GPDMA_C6CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C6CONTROL: PROT3 Position         */
#define GPDMA_C6CONTROL_PROT3_Msk             (0x01UL << GPDMA_C6CONTROL_PROT3_Pos)                   /*!< GPDMA C6CONTROL: PROT3 Mask             */
#define GPDMA_C6CONTROL_I_Pos                 31                                                      /*!< GPDMA C6CONTROL: I Position             */
#define GPDMA_C6CONTROL_I_Msk                 (0x01UL << GPDMA_C6CONTROL_I_Pos)                       /*!< GPDMA C6CONTROL: I Mask                 */

/* -------------------------------  GPDMA_C6CONFIG  ------------------------------- */
#define GPDMA_C6CONFIG_E_Pos                  0                                                       /*!< GPDMA C6CONFIG: E Position              */
#define GPDMA_C6CONFIG_E_Msk                  (0x01UL << GPDMA_C6CONFIG_E_Pos)                        /*!< GPDMA C6CONFIG: E Mask                  */
#define GPDMA_C6CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C6CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C6CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C6CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C6CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C6CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C6CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C6CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C6CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C6CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C6CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C6CONFIG: FLOWCNTRL Position      */
#define GPDMA_C6CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C6CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C6CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C6CONFIG_IE_Pos                 14                                                      /*!< GPDMA C6CONFIG: IE Position             */
#define GPDMA_C6CONFIG_IE_Msk                 (0x01UL << GPDMA_C6CONFIG_IE_Pos)                       /*!< GPDMA C6CONFIG: IE Mask                 */
#define GPDMA_C6CONFIG_ITC_Pos                15                                                      /*!< GPDMA C6CONFIG: ITC Position            */
#define GPDMA_C6CONFIG_ITC_Msk                (0x01UL << GPDMA_C6CONFIG_ITC_Pos)                      /*!< GPDMA C6CONFIG: ITC Mask                */
#define GPDMA_C6CONFIG_L_Pos                  16                                                      /*!< GPDMA C6CONFIG: L Position              */
#define GPDMA_C6CONFIG_L_Msk                  (0x01UL << GPDMA_C6CONFIG_L_Pos)                        /*!< GPDMA C6CONFIG: L Mask                  */
#define GPDMA_C6CONFIG_A_Pos                  17                                                      /*!< GPDMA C6CONFIG: A Position              */
#define GPDMA_C6CONFIG_A_Msk                  (0x01UL << GPDMA_C6CONFIG_A_Pos)                        /*!< GPDMA C6CONFIG: A Mask                  */
#define GPDMA_C6CONFIG_H_Pos                  18                                                      /*!< GPDMA C6CONFIG: H Position              */
#define GPDMA_C6CONFIG_H_Msk                  (0x01UL << GPDMA_C6CONFIG_H_Pos)                        /*!< GPDMA C6CONFIG: H Mask                  */

/* -------------------------------  GPDMA_C7SRCADDR  ------------------------------ */
#define GPDMA_C7SRCADDR_SRCADDR_Pos           0                                                       /*!< GPDMA C7SRCADDR: SRCADDR Position       */
#define GPDMA_C7SRCADDR_SRCADDR_Msk           (0xffffffffUL << GPDMA_C7SRCADDR_SRCADDR_Pos)           /*!< GPDMA C7SRCADDR: SRCADDR Mask           */

/* ------------------------------  GPDMA_C7DESTADDR  ------------------------------ */
#define GPDMA_C7DESTADDR_DESTADDR_Pos         0                                                       /*!< GPDMA C7DESTADDR: DESTADDR Position     */
#define GPDMA_C7DESTADDR_DESTADDR_Msk         (0xffffffffUL << GPDMA_C7DESTADDR_DESTADDR_Pos)         /*!< GPDMA C7DESTADDR: DESTADDR Mask         */

/* ---------------------------------  GPDMA_C7LLI  -------------------------------- */
#define GPDMA_C7LLI_LM_Pos                    0                                                       /*!< GPDMA C7LLI: LM Position                */
#define GPDMA_C7LLI_LM_Msk                    (0x01UL << GPDMA_C7LLI_LM_Pos)                          /*!< GPDMA C7LLI: LM Mask                    */
#define GPDMA_C7LLI_R_Pos                     1                                                       /*!< GPDMA C7LLI: R Position                 */
#define GPDMA_C7LLI_R_Msk                     (0x01UL << GPDMA_C7LLI_R_Pos)                           /*!< GPDMA C7LLI: R Mask                     */
#define GPDMA_C7LLI_LLI_Pos                   2                                                       /*!< GPDMA C7LLI: LLI Position               */
#define GPDMA_C7LLI_LLI_Msk                   (0x3fffffffUL << GPDMA_C7LLI_LLI_Pos)                   /*!< GPDMA C7LLI: LLI Mask                   */

/* -------------------------------  GPDMA_C7CONTROL  ------------------------------ */
#define GPDMA_C7CONTROL_TRANSFERSIZE_Pos      0                                                       /*!< GPDMA C7CONTROL: TRANSFERSIZE Position  */
#define GPDMA_C7CONTROL_TRANSFERSIZE_Msk      (0x00000fffUL << GPDMA_C7CONTROL_TRANSFERSIZE_Pos)      /*!< GPDMA C7CONTROL: TRANSFERSIZE Mask      */
#define GPDMA_C7CONTROL_SBSIZE_Pos            12                                                      /*!< GPDMA C7CONTROL: SBSIZE Position        */
#define GPDMA_C7CONTROL_SBSIZE_Msk            (0x07UL << GPDMA_C7CONTROL_SBSIZE_Pos)                  /*!< GPDMA C7CONTROL: SBSIZE Mask            */
#define GPDMA_C7CONTROL_DBSIZE_Pos            15                                                      /*!< GPDMA C7CONTROL: DBSIZE Position        */
#define GPDMA_C7CONTROL_DBSIZE_Msk            (0x07UL << GPDMA_C7CONTROL_DBSIZE_Pos)                  /*!< GPDMA C7CONTROL: DBSIZE Mask            */
#define GPDMA_C7CONTROL_SWIDTH_Pos            18                                                      /*!< GPDMA C7CONTROL: SWIDTH Position        */
#define GPDMA_C7CONTROL_SWIDTH_Msk            (0x07UL << GPDMA_C7CONTROL_SWIDTH_Pos)                  /*!< GPDMA C7CONTROL: SWIDTH Mask            */
#define GPDMA_C7CONTROL_DWIDTH_Pos            21                                                      /*!< GPDMA C7CONTROL: DWIDTH Position        */
#define GPDMA_C7CONTROL_DWIDTH_Msk            (0x07UL << GPDMA_C7CONTROL_DWIDTH_Pos)                  /*!< GPDMA C7CONTROL: DWIDTH Mask            */
#define GPDMA_C7CONTROL_S_Pos                 24                                                      /*!< GPDMA C7CONTROL: S Position             */
#define GPDMA_C7CONTROL_S_Msk                 (0x01UL << GPDMA_C7CONTROL_S_Pos)                       /*!< GPDMA C7CONTROL: S Mask                 */
#define GPDMA_C7CONTROL_D_Pos                 25                                                      /*!< GPDMA C7CONTROL: D Position             */
#define GPDMA_C7CONTROL_D_Msk                 (0x01UL << GPDMA_C7CONTROL_D_Pos)                       /*!< GPDMA C7CONTROL: D Mask                 */
#define GPDMA_C7CONTROL_SI_Pos                26                                                      /*!< GPDMA C7CONTROL: SI Position            */
#define GPDMA_C7CONTROL_SI_Msk                (0x01UL << GPDMA_C7CONTROL_SI_Pos)                      /*!< GPDMA C7CONTROL: SI Mask                */
#define GPDMA_C7CONTROL_DI_Pos                27                                                      /*!< GPDMA C7CONTROL: DI Position            */
#define GPDMA_C7CONTROL_DI_Msk                (0x01UL << GPDMA_C7CONTROL_DI_Pos)                      /*!< GPDMA C7CONTROL: DI Mask                */
#define GPDMA_C7CONTROL_PROT1_Pos             28                                                      /*!< GPDMA C7CONTROL: PROT1 Position         */
#define GPDMA_C7CONTROL_PROT1_Msk             (0x01UL << GPDMA_C7CONTROL_PROT1_Pos)                   /*!< GPDMA C7CONTROL: PROT1 Mask             */
#define GPDMA_C7CONTROL_PROT2_Pos             29                                                      /*!< GPDMA C7CONTROL: PROT2 Position         */
#define GPDMA_C7CONTROL_PROT2_Msk             (0x01UL << GPDMA_C7CONTROL_PROT2_Pos)                   /*!< GPDMA C7CONTROL: PROT2 Mask             */
#define GPDMA_C7CONTROL_PROT3_Pos             30                                                      /*!< GPDMA C7CONTROL: PROT3 Position         */
#define GPDMA_C7CONTROL_PROT3_Msk             (0x01UL << GPDMA_C7CONTROL_PROT3_Pos)                   /*!< GPDMA C7CONTROL: PROT3 Mask             */
#define GPDMA_C7CONTROL_I_Pos                 31                                                      /*!< GPDMA C7CONTROL: I Position             */
#define GPDMA_C7CONTROL_I_Msk                 (0x01UL << GPDMA_C7CONTROL_I_Pos)                       /*!< GPDMA C7CONTROL: I Mask                 */

