roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  GPDMA_C7CONFIG  ------------------------------- */
#define GPDMA_C7CONFIG_E_Pos                  0                                                       /*!< GPDMA C7CONFIG: E Position              */
#define GPDMA_C7CONFIG_E_Msk                  (0x01UL << GPDMA_C7CONFIG_E_Pos)                        /*!< GPDMA C7CONFIG: E Mask                  */
#define GPDMA_C7CONFIG_SRCPERIPHERAL_Pos      1                                                       /*!< GPDMA C7CONFIG: SRCPERIPHERAL Position  */
#define GPDMA_C7CONFIG_SRCPERIPHERAL_Msk      (0x1fUL << GPDMA_C7CONFIG_SRCPERIPHERAL_Pos)            /*!< GPDMA C7CONFIG: SRCPERIPHERAL Mask      */
#define GPDMA_C7CONFIG_DESTPERIPHERAL_Pos     6                                                       /*!< GPDMA C7CONFIG: DESTPERIPHERAL Position */
#define GPDMA_C7CONFIG_DESTPERIPHERAL_Msk     (0x1fUL << GPDMA_C7CONFIG_DESTPERIPHERAL_Pos)           /*!< GPDMA C7CONFIG: DESTPERIPHERAL Mask     */
#define GPDMA_C7CONFIG_FLOWCNTRL_Pos          11                                                      /*!< GPDMA C7CONFIG: FLOWCNTRL Position      */
#define GPDMA_C7CONFIG_FLOWCNTRL_Msk          (0x07UL << GPDMA_C7CONFIG_FLOWCNTRL_Pos)                /*!< GPDMA C7CONFIG: FLOWCNTRL Mask          */
#define GPDMA_C7CONFIG_IE_Pos                 14                                                      /*!< GPDMA C7CONFIG: IE Position             */
#define GPDMA_C7CONFIG_IE_Msk                 (0x01UL << GPDMA_C7CONFIG_IE_Pos)                       /*!< GPDMA C7CONFIG: IE Mask                 */
#define GPDMA_C7CONFIG_ITC_Pos                15                                                      /*!< GPDMA C7CONFIG: ITC Position            */
#define GPDMA_C7CONFIG_ITC_Msk                (0x01UL << GPDMA_C7CONFIG_ITC_Pos)                      /*!< GPDMA C7CONFIG: ITC Mask                */
#define GPDMA_C7CONFIG_L_Pos                  16                                                      /*!< GPDMA C7CONFIG: L Position              */
#define GPDMA_C7CONFIG_L_Msk                  (0x01UL << GPDMA_C7CONFIG_L_Pos)                        /*!< GPDMA C7CONFIG: L Mask                  */
#define GPDMA_C7CONFIG_A_Pos                  17                                                      /*!< GPDMA C7CONFIG: A Position              */
#define GPDMA_C7CONFIG_A_Msk                  (0x01UL << GPDMA_C7CONFIG_A_Pos)                        /*!< GPDMA C7CONFIG: A Mask                  */
#define GPDMA_C7CONFIG_H_Pos                  18                                                      /*!< GPDMA C7CONFIG: H Position              */
#define GPDMA_C7CONFIG_H_Msk                  (0x01UL << GPDMA_C7CONFIG_H_Pos)                        /*!< GPDMA C7CONFIG: H Mask                  */


/* ================================================================================ */
/* ================         struct 'SPIFI' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  SPIFI_CTRL  --------------------------------- */
#define SPIFI_CTRL_TIMEOUT_Pos                0                                                       /*!< SPIFI CTRL: TIMEOUT Position            */
#define SPIFI_CTRL_TIMEOUT_Msk                (0x0000ffffUL << SPIFI_CTRL_TIMEOUT_Pos)                /*!< SPIFI CTRL: TIMEOUT Mask                */
#define SPIFI_CTRL_CSHIGH_Pos                 16                                                      /*!< SPIFI CTRL: CSHIGH Position             */
#define SPIFI_CTRL_CSHIGH_Msk                 (0x0fUL << SPIFI_CTRL_CSHIGH_Pos)                       /*!< SPIFI CTRL: CSHIGH Mask                 */
#define SPIFI_CTRL_D_PRFTCH_DIS_Pos           21                                                      /*!< SPIFI CTRL: D_PRFTCH_DIS Position       */
#define SPIFI_CTRL_D_PRFTCH_DIS_Msk           (0x01UL << SPIFI_CTRL_D_PRFTCH_DIS_Pos)                 /*!< SPIFI CTRL: D_PRFTCH_DIS Mask           */
#define SPIFI_CTRL_INTEN_Pos                  22                                                      /*!< SPIFI CTRL: INTEN Position              */
#define SPIFI_CTRL_INTEN_Msk                  (0x01UL << SPIFI_CTRL_INTEN_Pos)                        /*!< SPIFI CTRL: INTEN Mask                  */
#define SPIFI_CTRL_MODE3_Pos                  23                                                      /*!< SPIFI CTRL: MODE3 Position              */
#define SPIFI_CTRL_MODE3_Msk                  (0x01UL << SPIFI_CTRL_MODE3_Pos)                        /*!< SPIFI CTRL: MODE3 Mask                  */
#define SPIFI_CTRL_PRFTCH_DIS_Pos             27                                                      /*!< SPIFI CTRL: PRFTCH_DIS Position         */
#define SPIFI_CTRL_PRFTCH_DIS_Msk             (0x01UL << SPIFI_CTRL_PRFTCH_DIS_Pos)                   /*!< SPIFI CTRL: PRFTCH_DIS Mask             */
#define SPIFI_CTRL_DUAL_Pos                   28                                                      /*!< SPIFI CTRL: DUAL Position               */
#define SPIFI_CTRL_DUAL_Msk                   (0x01UL << SPIFI_CTRL_DUAL_Pos)                         /*!< SPIFI CTRL: DUAL Mask                   */
#define SPIFI_CTRL_RFCLK_Pos                  29                                                      /*!< SPIFI CTRL: RFCLK Position              */
#define SPIFI_CTRL_RFCLK_Msk                  (0x01UL << SPIFI_CTRL_RFCLK_Pos)                        /*!< SPIFI CTRL: RFCLK Mask                  */
#define SPIFI_CTRL_FBCLK_Pos                  30                                                      /*!< SPIFI CTRL: FBCLK Position              */
#define SPIFI_CTRL_FBCLK_Msk                  (0x01UL << SPIFI_CTRL_FBCLK_Pos)                        /*!< SPIFI CTRL: FBCLK Mask                  */
#define SPIFI_CTRL_DMAEN_Pos                  31                                                      /*!< SPIFI CTRL: DMAEN Position              */
#define SPIFI_CTRL_DMAEN_Msk                  (0x01UL << SPIFI_CTRL_DMAEN_Pos)                        /*!< SPIFI CTRL: DMAEN Mask                  */

