roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SPIFI_CMD  --------------------------------- */
#define SPIFI_CMD_DATALEN_Pos                 0                                                       /*!< SPIFI CMD: DATALEN Position             */
#define SPIFI_CMD_DATALEN_Msk                 (0x00003fffUL << SPIFI_CMD_DATALEN_Pos)                 /*!< SPIFI CMD: DATALEN Mask                 */
#define SPIFI_CMD_POLL_Pos                    14                                                      /*!< SPIFI CMD: POLL Position                */
#define SPIFI_CMD_POLL_Msk                    (0x01UL << SPIFI_CMD_POLL_Pos)                          /*!< SPIFI CMD: POLL Mask                    */
#define SPIFI_CMD_DOUT_Pos                    15                                                      /*!< SPIFI CMD: DOUT Position                */
#define SPIFI_CMD_DOUT_Msk                    (0x01UL << SPIFI_CMD_DOUT_Pos)                          /*!< SPIFI CMD: DOUT Mask                    */
#define SPIFI_CMD_INTLEN_Pos                  16                                                      /*!< SPIFI CMD: INTLEN Position              */
#define SPIFI_CMD_INTLEN_Msk                  (0x07UL << SPIFI_CMD_INTLEN_Pos)                        /*!< SPIFI CMD: INTLEN Mask                  */
#define SPIFI_CMD_FIELDFORM_Pos               19                                                      /*!< SPIFI CMD: FIELDFORM Position           */
#define SPIFI_CMD_FIELDFORM_Msk               (0x03UL << SPIFI_CMD_FIELDFORM_Pos)                     /*!< SPIFI CMD: FIELDFORM Mask               */
#define SPIFI_CMD_FRAMEFORM_Pos               21                                                      /*!< SPIFI CMD: FRAMEFORM Position           */
#define SPIFI_CMD_FRAMEFORM_Msk               (0x07UL << SPIFI_CMD_FRAMEFORM_Pos)                     /*!< SPIFI CMD: FRAMEFORM Mask               */
#define SPIFI_CMD_OPCODE_Pos                  24                                                      /*!< SPIFI CMD: OPCODE Position              */
#define SPIFI_CMD_OPCODE_Msk                  (0x000000ffUL << SPIFI_CMD_OPCODE_Pos)                  /*!< SPIFI CMD: OPCODE Mask                  */

/* ---------------------------------  SPIFI_ADDR  --------------------------------- */
#define SPIFI_ADDR_ADDRESS_Pos                0                                                       /*!< SPIFI ADDR: ADDRESS Position            */
#define SPIFI_ADDR_ADDRESS_Msk                (0xffffffffUL << SPIFI_ADDR_ADDRESS_Pos)                /*!< SPIFI ADDR: ADDRESS Mask                */

/* ---------------------------------  SPIFI_IDATA  -------------------------------- */
#define SPIFI_IDATA_IDATA_Pos                 0                                                       /*!< SPIFI IDATA: IDATA Position             */
#define SPIFI_IDATA_IDATA_Msk                 (0xffffffffUL << SPIFI_IDATA_IDATA_Pos)                 /*!< SPIFI IDATA: IDATA Mask                 */

/* --------------------------------  SPIFI_CLIMIT  -------------------------------- */
#define SPIFI_CLIMIT_CLIMIT_Pos               0                                                       /*!< SPIFI CLIMIT: CLIMIT Position           */
#define SPIFI_CLIMIT_CLIMIT_Msk               (0xffffffffUL << SPIFI_CLIMIT_CLIMIT_Pos)               /*!< SPIFI CLIMIT: CLIMIT Mask               */

/* ---------------------------------  SPIFI_DATA  --------------------------------- */
#define SPIFI_DATA_DATA_Pos                   0                                                       /*!< SPIFI DATA: DATA Position               */
#define SPIFI_DATA_DATA_Msk                   (0xffffffffUL << SPIFI_DATA_DATA_Pos)                   /*!< SPIFI DATA: DATA Mask                   */

/* ---------------------------------  SPIFI_MCMD  --------------------------------- */
#define SPIFI_MCMD_POLL_Pos                   14                                                      /*!< SPIFI MCMD: POLL Position               */
#define SPIFI_MCMD_POLL_Msk                   (0x01UL << SPIFI_MCMD_POLL_Pos)                         /*!< SPIFI MCMD: POLL Mask                   */
#define SPIFI_MCMD_DOUT_Pos                   15                                                      /*!< SPIFI MCMD: DOUT Position               */
#define SPIFI_MCMD_DOUT_Msk                   (0x01UL << SPIFI_MCMD_DOUT_Pos)                         /*!< SPIFI MCMD: DOUT Mask                   */
#define SPIFI_MCMD_INTLEN_Pos                 16                                                      /*!< SPIFI MCMD: INTLEN Position             */
#define SPIFI_MCMD_INTLEN_Msk                 (0x07UL << SPIFI_MCMD_INTLEN_Pos)                       /*!< SPIFI MCMD: INTLEN Mask                 */
#define SPIFI_MCMD_FIELDFORM_Pos              19                                                      /*!< SPIFI MCMD: FIELDFORM Position          */
#define SPIFI_MCMD_FIELDFORM_Msk              (0x03UL << SPIFI_MCMD_FIELDFORM_Pos)                    /*!< SPIFI MCMD: FIELDFORM Mask              */
#define SPIFI_MCMD_FRAMEFORM_Pos              21                                                      /*!< SPIFI MCMD: FRAMEFORM Position          */
#define SPIFI_MCMD_FRAMEFORM_Msk              (0x07UL << SPIFI_MCMD_FRAMEFORM_Pos)                    /*!< SPIFI MCMD: FRAMEFORM Mask              */
#define SPIFI_MCMD_OPCODE_Pos                 24                                                      /*!< SPIFI MCMD: OPCODE Position             */
#define SPIFI_MCMD_OPCODE_Msk                 (0x000000ffUL << SPIFI_MCMD_OPCODE_Pos)                 /*!< SPIFI MCMD: OPCODE Mask                 */

/* ---------------------------------  SPIFI_STAT  --------------------------------- */
#define SPIFI_STAT_MCINIT_Pos                 0                                                       /*!< SPIFI STAT: MCINIT Position             */
#define SPIFI_STAT_MCINIT_Msk                 (0x01UL << SPIFI_STAT_MCINIT_Pos)                       /*!< SPIFI STAT: MCINIT Mask                 */
#define SPIFI_STAT_CMD_Pos                    1                                                       /*!< SPIFI STAT: CMD Position                */
#define SPIFI_STAT_CMD_Msk                    (0x01UL << SPIFI_STAT_CMD_Pos)                          /*!< SPIFI STAT: CMD Mask                    */
#define SPIFI_STAT_RESET_Pos                  4                                                       /*!< SPIFI STAT: RESET Position              */
#define SPIFI_STAT_RESET_Msk                  (0x01UL << SPIFI_STAT_RESET_Pos)                        /*!< SPIFI STAT: RESET Mask                  */
#define SPIFI_STAT_INTRQ_Pos                  5                                                       /*!< SPIFI STAT: INTRQ Position              */
#define SPIFI_STAT_INTRQ_Msk                  (0x01UL << SPIFI_STAT_INTRQ_Pos)                        /*!< SPIFI STAT: INTRQ Mask                  */
#define SPIFI_STAT_VERSION_Pos                24                                                      /*!< SPIFI STAT: VERSION Position            */
#define SPIFI_STAT_VERSION_Msk                (0x000000ffUL << SPIFI_STAT_VERSION_Pos)                /*!< SPIFI STAT: VERSION Mask                */


/* ================================================================================ */
/* ================         struct 'SDMMC' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  SDMMC_CTRL  --------------------------------- */
#define SDMMC_CTRL_CONTROLLER_RESET_Pos       0                                                       /*!< SDMMC CTRL: CONTROLLER_RESET Position   */
#define SDMMC_CTRL_CONTROLLER_RESET_Msk       (0x01UL << SDMMC_CTRL_CONTROLLER_RESET_Pos)             /*!< SDMMC CTRL: CONTROLLER_RESET Mask       */
#define SDMMC_CTRL_FIFO_RESET_Pos             1                                                       /*!< SDMMC CTRL: FIFO_RESET Position         */
#define SDMMC_CTRL_FIFO_RESET_Msk             (0x01UL << SDMMC_CTRL_FIFO_RESET_Pos)                   /*!< SDMMC CTRL: FIFO_RESET Mask             */
#define SDMMC_CTRL_DMA_RESET_Pos              2                                                       /*!< SDMMC CTRL: DMA_RESET Position          */
#define SDMMC_CTRL_DMA_RESET_Msk              (0x01UL << SDMMC_CTRL_DMA_RESET_Pos)                    /*!< SDMMC CTRL: DMA_RESET Mask              */
#define SDMMC_CTRL_INT_ENABLE_Pos             4                                                       /*!< SDMMC CTRL: INT_ENABLE Position         */
#define SDMMC_CTRL_INT_ENABLE_Msk             (0x01UL << SDMMC_CTRL_INT_ENABLE_Pos)                   /*!< SDMMC CTRL: INT_ENABLE Mask             */
#define SDMMC_CTRL_READ_WAIT_Pos              6                                                       /*!< SDMMC CTRL: READ_WAIT Position          */
#define SDMMC_CTRL_READ_WAIT_Msk              (0x01UL << SDMMC_CTRL_READ_WAIT_Pos)                    /*!< SDMMC CTRL: READ_WAIT Mask              */
#define SDMMC_CTRL_SEND_IRQ_RESPONSE_Pos      7                                                       /*!< SDMMC CTRL: SEND_IRQ_RESPONSE Position  */
#define SDMMC_CTRL_SEND_IRQ_RESPONSE_Msk      (0x01UL << SDMMC_CTRL_SEND_IRQ_RESPONSE_Pos)            /*!< SDMMC CTRL: SEND_IRQ_RESPONSE Mask      */
#define SDMMC_CTRL_ABORT_READ_DATA_Pos        8                                                       /*!< SDMMC CTRL: ABORT_READ_DATA Position    */
#define SDMMC_CTRL_ABORT_READ_DATA_Msk        (0x01UL << SDMMC_CTRL_ABORT_READ_DATA_Pos)              /*!< SDMMC CTRL: ABORT_READ_DATA Mask        */
#define SDMMC_CTRL_SEND_CCSD_Pos              9                                                       /*!< SDMMC CTRL: SEND_CCSD Position          */
#define SDMMC_CTRL_SEND_CCSD_Msk              (0x01UL << SDMMC_CTRL_SEND_CCSD_Pos)                    /*!< SDMMC CTRL: SEND_CCSD Mask              */
#define SDMMC_CTRL_SEND_AUTO_STOP_Pos         10                                                      /*!< SDMMC CTRL: SEND_AUTO_STOP Position     */
#define SDMMC_CTRL_SEND_AUTO_STOP_Msk         (0x01UL << SDMMC_CTRL_SEND_AUTO_STOP_Pos)               /*!< SDMMC CTRL: SEND_AUTO_STOP Mask         */
#define SDMMC_CTRL_CEATA_DEVICE_INTERRUPT_STATUS_Pos 11                                               /*!< SDMMC CTRL: CEATA_DEVICE_INTERRUPT_STATUS Position */
#define SDMMC_CTRL_CEATA_DEVICE_INTERRUPT_STATUS_Msk (0x01UL << SDMMC_CTRL_CEATA_DEVICE_INTERRUPT_STATUS_Pos)/*!< SDMMC CTRL: CEATA_DEVICE_INTERRUPT_STATUS Mask */
#define SDMMC_CTRL_CARD_VOLTAGE_A0_Pos        16                                                      /*!< SDMMC CTRL: CARD_VOLTAGE_A0 Position    */
#define SDMMC_CTRL_CARD_VOLTAGE_A0_Msk        (0x01UL << SDMMC_CTRL_CARD_VOLTAGE_A0_Pos)              /*!< SDMMC CTRL: CARD_VOLTAGE_A0 Mask        */
#define SDMMC_CTRL_CARD_VOLTAGE_A1_Pos        17                                                      /*!< SDMMC CTRL: CARD_VOLTAGE_A1 Position    */
#define SDMMC_CTRL_CARD_VOLTAGE_A1_Msk        (0x01UL << SDMMC_CTRL_CARD_VOLTAGE_A1_Pos)              /*!< SDMMC CTRL: CARD_VOLTAGE_A1 Mask        */
#define SDMMC_CTRL_CARD_VOLTAGE_A2_Pos        18                                                      /*!< SDMMC CTRL: CARD_VOLTAGE_A2 Position    */
#define SDMMC_CTRL_CARD_VOLTAGE_A2_Msk        (0x01UL << SDMMC_CTRL_CARD_VOLTAGE_A2_Pos)              /*!< SDMMC CTRL: CARD_VOLTAGE_A2 Mask        */
#define SDMMC_CTRL_USE_INTERNAL_DMAC_Pos      25                                                      /*!< SDMMC CTRL: USE_INTERNAL_DMAC Position  */
#define SDMMC_CTRL_USE_INTERNAL_DMAC_Msk      (0x01UL << SDMMC_CTRL_USE_INTERNAL_DMAC_Pos)            /*!< SDMMC CTRL: USE_INTERNAL_DMAC Mask      */

/* ---------------------------------  SDMMC_PWREN  -------------------------------- */
#define SDMMC_PWREN_POWER_ENABLE_Pos          0                                                       /*!< SDMMC PWREN: POWER_ENABLE Position      */
#define SDMMC_PWREN_POWER_ENABLE_Msk          (0x01UL << SDMMC_PWREN_POWER_ENABLE_Pos)                /*!< SDMMC PWREN: POWER_ENABLE Mask          */

/* --------------------------------  SDMMC_CLKDIV  -------------------------------- */
#define SDMMC_CLKDIV_CLK_DIVIDER0_Pos         0                                                       /*!< SDMMC CLKDIV: CLK_DIVIDER0 Position     */
#define SDMMC_CLKDIV_CLK_DIVIDER0_Msk         (0x000000ffUL << SDMMC_CLKDIV_CLK_DIVIDER0_Pos)         /*!< SDMMC CLKDIV: CLK_DIVIDER0 Mask         */
#define SDMMC_CLKDIV_CLK_DIVIDER1_Pos         8                                                       /*!< SDMMC CLKDIV: CLK_DIVIDER1 Position     */
#define SDMMC_CLKDIV_CLK_DIVIDER1_Msk         (0x000000ffUL << SDMMC_CLKDIV_CLK_DIVIDER1_Pos)         /*!< SDMMC CLKDIV: CLK_DIVIDER1 Mask         */
#define SDMMC_CLKDIV_CLK_DIVIDER2_Pos         16                                                      /*!< SDMMC CLKDIV: CLK_DIVIDER2 Position     */
#define SDMMC_CLKDIV_CLK_DIVIDER2_Msk         (0x000000ffUL << SDMMC_CLKDIV_CLK_DIVIDER2_Pos)         /*!< SDMMC CLKDIV: CLK_DIVIDER2 Mask         */
#define SDMMC_CLKDIV_CLK_DIVIDER3_Pos         24                                                      /*!< SDMMC CLKDIV: CLK_DIVIDER3 Position     */
#define SDMMC_CLKDIV_CLK_DIVIDER3_Msk         (0x000000ffUL << SDMMC_CLKDIV_CLK_DIVIDER3_Pos)         /*!< SDMMC CLKDIV: CLK_DIVIDER3 Mask         */

/* --------------------------------  SDMMC_CLKSRC  -------------------------------- */
#define SDMMC_CLKSRC_CLK_SOURCE_Pos           0                                                       /*!< SDMMC CLKSRC: CLK_SOURCE Position       */
#define SDMMC_CLKSRC_CLK_SOURCE_Msk           (0x03UL << SDMMC_CLKSRC_CLK_SOURCE_Pos)                 /*!< SDMMC CLKSRC: CLK_SOURCE Mask           */

/* --------------------------------  SDMMC_CLKENA  -------------------------------- */
#define SDMMC_CLKENA_CCLK_ENABLE_Pos          0                                                       /*!< SDMMC CLKENA: CCLK_ENABLE Position      */
#define SDMMC_CLKENA_CCLK_ENABLE_Msk          (0x01UL << SDMMC_CLKENA_CCLK_ENABLE_Pos)                /*!< SDMMC CLKENA: CCLK_ENABLE Mask          */
#define SDMMC_CLKENA_CCLK_LOW_POWER_Pos       16                                                      /*!< SDMMC CLKENA: CCLK_LOW_POWER Position   */
#define SDMMC_CLKENA_CCLK_LOW_POWER_Msk       (0x01UL << SDMMC_CLKENA_CCLK_LOW_POWER_Pos)             /*!< SDMMC CLKENA: CCLK_LOW_POWER Mask       */

/* ---------------------------------  SDMMC_TMOUT  -------------------------------- */
#define SDMMC_TMOUT_RESPONSE_TIMEOUT_Pos      0                                                       /*!< SDMMC TMOUT: RESPONSE_TIMEOUT Position  */
#define SDMMC_TMOUT_RESPONSE_TIMEOUT_Msk      (0x000000ffUL << SDMMC_TMOUT_RESPONSE_TIMEOUT_Pos)      /*!< SDMMC TMOUT: RESPONSE_TIMEOUT Mask      */
#define SDMMC_TMOUT_DATA_TIMEOUT_Pos          8                                                       /*!< SDMMC TMOUT: DATA_TIMEOUT Position      */
#define SDMMC_TMOUT_DATA_TIMEOUT_Msk          (0x00ffffffUL << SDMMC_TMOUT_DATA_TIMEOUT_Pos)          /*!< SDMMC TMOUT: DATA_TIMEOUT Mask          */

/* ---------------------------------  SDMMC_CTYPE  -------------------------------- */
#define SDMMC_CTYPE_CARD_WIDTH0_Pos           0                                                       /*!< SDMMC CTYPE: CARD_WIDTH0 Position       */
#define SDMMC_CTYPE_CARD_WIDTH0_Msk           (0x01UL << SDMMC_CTYPE_CARD_WIDTH0_Pos)                 /*!< SDMMC CTYPE: CARD_WIDTH0 Mask           */
#define SDMMC_CTYPE_CARD_WIDTH1_Pos           16                                                      /*!< SDMMC CTYPE: CARD_WIDTH1 Position       */
#define SDMMC_CTYPE_CARD_WIDTH1_Msk           (0x01UL << SDMMC_CTYPE_CARD_WIDTH1_Pos)                 /*!< SDMMC CTYPE: CARD_WIDTH1 Mask           */

/* --------------------------------  SDMMC_BLKSIZ  -------------------------------- */
#define SDMMC_BLKSIZ_BLOCK_SIZE_Pos           0                                                       /*!< SDMMC BLKSIZ: BLOCK_SIZE Position       */
#define SDMMC_BLKSIZ_BLOCK_SIZE_Msk           (0x0000ffffUL << SDMMC_BLKSIZ_BLOCK_SIZE_Pos)           /*!< SDMMC BLKSIZ: BLOCK_SIZE Mask           */

/* --------------------------------  SDMMC_BYTCNT  -------------------------------- */
#define SDMMC_BYTCNT_BYTE_COUNT_Pos           0                                                       /*!< SDMMC BYTCNT: BYTE_COUNT Position       */
#define SDMMC_BYTCNT_BYTE_COUNT_Msk           (0xffffffffUL << SDMMC_BYTCNT_BYTE_COUNT_Pos)           /*!< SDMMC BYTCNT: BYTE_COUNT Mask           */

/* --------------------------------  SDMMC_INTMASK  ------------------------------- */
#define SDMMC_INTMASK_CDET_Pos                0                                                       /*!< SDMMC INTMASK: CDET Position            */
#define SDMMC_INTMASK_CDET_Msk                (0x01UL << SDMMC_INTMASK_CDET_Pos)                      /*!< SDMMC INTMASK: CDET Mask                */
#define SDMMC_INTMASK_RE_Pos                  1                                                       /*!< SDMMC INTMASK: RE Position              */
#define SDMMC_INTMASK_RE_Msk                  (0x01UL << SDMMC_INTMASK_RE_Pos)                        /*!< SDMMC INTMASK: RE Mask                  */
#define SDMMC_INTMASK_CDONE_Pos               2                                                       /*!< SDMMC INTMASK: CDONE Position           */
#define SDMMC_INTMASK_CDONE_Msk               (0x01UL << SDMMC_INTMASK_CDONE_Pos)                     /*!< SDMMC INTMASK: CDONE Mask               */
#define SDMMC_INTMASK_DTO_Pos                 3                                                       /*!< SDMMC INTMASK: DTO Position             */
#define SDMMC_INTMASK_DTO_Msk                 (0x01UL << SDMMC_INTMASK_DTO_Pos)                       /*!< SDMMC INTMASK: DTO Mask                 */
#define SDMMC_INTMASK_TXDR_Pos                4                                                       /*!< SDMMC INTMASK: TXDR Position            */
#define SDMMC_INTMASK_TXDR_Msk                (0x01UL << SDMMC_INTMASK_TXDR_Pos)                      /*!< SDMMC INTMASK: TXDR Mask                */
#define SDMMC_INTMASK_RXDR_Pos                5                                                       /*!< SDMMC INTMASK: RXDR Position            */
#define SDMMC_INTMASK_RXDR_Msk                (0x01UL << SDMMC_INTMASK_RXDR_Pos)                      /*!< SDMMC INTMASK: RXDR Mask                */
#define SDMMC_INTMASK_RCRC_Pos                6                                                       /*!< SDMMC INTMASK: RCRC Position            */
#define SDMMC_INTMASK_RCRC_Msk                (0x01UL << SDMMC_INTMASK_RCRC_Pos)                      /*!< SDMMC INTMASK: RCRC Mask                */
#define SDMMC_INTMASK_DCRC_Pos                7                                                       /*!< SDMMC INTMASK: DCRC Position            */
#define SDMMC_INTMASK_DCRC_Msk                (0x01UL << SDMMC_INTMASK_DCRC_Pos)                      /*!< SDMMC INTMASK: DCRC Mask                */
#define SDMMC_INTMASK_RTO_Pos                 8                                                       /*!< SDMMC INTMASK: RTO Position             */
#define SDMMC_INTMASK_RTO_Msk                 (0x01UL << SDMMC_INTMASK_RTO_Pos)                       /*!< SDMMC INTMASK: RTO Mask                 */
#define SDMMC_INTMASK_DRTO_Pos                9                                                       /*!< SDMMC INTMASK: DRTO Position            */
#define SDMMC_INTMASK_DRTO_Msk                (0x01UL << SDMMC_INTMASK_DRTO_Pos)                      /*!< SDMMC INTMASK: DRTO Mask                */
#define SDMMC_INTMASK_HTO_Pos                 10                                                      /*!< SDMMC INTMASK: HTO Position             */
#define SDMMC_INTMASK_HTO_Msk                 (0x01UL << SDMMC_INTMASK_HTO_Pos)                       /*!< SDMMC INTMASK: HTO Mask                 */
#define SDMMC_INTMASK_FRUN_Pos                11                                                      /*!< SDMMC INTMASK: FRUN Position            */
#define SDMMC_INTMASK_FRUN_Msk                (0x01UL << SDMMC_INTMASK_FRUN_Pos)                      /*!< SDMMC INTMASK: FRUN Mask                */
#define SDMMC_INTMASK_HLE_Pos                 12                                                      /*!< SDMMC INTMASK: HLE Position             */
#define SDMMC_INTMASK_HLE_Msk                 (0x01UL << SDMMC_INTMASK_HLE_Pos)                       /*!< SDMMC INTMASK: HLE Mask                 */
#define SDMMC_INTMASK_SBE_Pos                 13                                                      /*!< SDMMC INTMASK: SBE Position             */
#define SDMMC_INTMASK_SBE_Msk                 (0x01UL << SDMMC_INTMASK_SBE_Pos)                       /*!< SDMMC INTMASK: SBE Mask                 */
#define SDMMC_INTMASK_ACD_Pos                 14                                                      /*!< SDMMC INTMASK: ACD Position             */
#define SDMMC_INTMASK_ACD_Msk                 (0x01UL << SDMMC_INTMASK_ACD_Pos)                       /*!< SDMMC INTMASK: ACD Mask                 */
#define SDMMC_INTMASK_EBE_Pos                 15                                                      /*!< SDMMC INTMASK: EBE Position             */
#define SDMMC_INTMASK_EBE_Msk                 (0x01UL << SDMMC_INTMASK_EBE_Pos)                       /*!< SDMMC INTMASK: EBE Mask                 */
#define SDMMC_INTMASK_SDIO_INT_MASK_Pos       16                                                      /*!< SDMMC INTMASK: SDIO_INT_MASK Position   */
#define SDMMC_INTMASK_SDIO_INT_MASK_Msk       (0x01UL << SDMMC_INTMASK_SDIO_INT_MASK_Pos)             /*!< SDMMC INTMASK: SDIO_INT_MASK Mask       */

/* --------------------------------  SDMMC_CMDARG  -------------------------------- */
#define SDMMC_CMDARG_CMD_ARG_Pos              0                                                       /*!< SDMMC CMDARG: CMD_ARG Position          */
#define SDMMC_CMDARG_CMD_ARG_Msk              (0xffffffffUL << SDMMC_CMDARG_CMD_ARG_Pos)              /*!< SDMMC CMDARG: CMD_ARG Mask              */

