roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SDMMC_CMD  --------------------------------- */
#define SDMMC_CMD_CMD_INDEX_Pos               0                                                       /*!< SDMMC CMD: CMD_INDEX Position           */
#define SDMMC_CMD_CMD_INDEX_Msk               (0x3fUL << SDMMC_CMD_CMD_INDEX_Pos)                     /*!< SDMMC CMD: CMD_INDEX Mask               */
#define SDMMC_CMD_RESPONSE_EXPECT_Pos         6                                                       /*!< SDMMC CMD: RESPONSE_EXPECT Position     */
#define SDMMC_CMD_RESPONSE_EXPECT_Msk         (0x01UL << SDMMC_CMD_RESPONSE_EXPECT_Pos)               /*!< SDMMC CMD: RESPONSE_EXPECT Mask         */
#define SDMMC_CMD_RESPONSE_LENGTH_Pos         7                                                       /*!< SDMMC CMD: RESPONSE_LENGTH Position     */
#define SDMMC_CMD_RESPONSE_LENGTH_Msk         (0x01UL << SDMMC_CMD_RESPONSE_LENGTH_Pos)               /*!< SDMMC CMD: RESPONSE_LENGTH Mask         */
#define SDMMC_CMD_CHECK_RESPONSE_CRC_Pos      8                                                       /*!< SDMMC CMD: CHECK_RESPONSE_CRC Position  */
#define SDMMC_CMD_CHECK_RESPONSE_CRC_Msk      (0x01UL << SDMMC_CMD_CHECK_RESPONSE_CRC_Pos)            /*!< SDMMC CMD: CHECK_RESPONSE_CRC Mask      */
#define SDMMC_CMD_DATA_EXPECTED_Pos           9                                                       /*!< SDMMC CMD: DATA_EXPECTED Position       */
#define SDMMC_CMD_DATA_EXPECTED_Msk           (0x01UL << SDMMC_CMD_DATA_EXPECTED_Pos)                 /*!< SDMMC CMD: DATA_EXPECTED Mask           */
#define SDMMC_CMD_READ_WRITE_Pos              10                                                      /*!< SDMMC CMD: READ_WRITE Position          */
#define SDMMC_CMD_READ_WRITE_Msk              (0x01UL << SDMMC_CMD_READ_WRITE_Pos)                    /*!< SDMMC CMD: READ_WRITE Mask              */
#define SDMMC_CMD_TRANSFER_MODE_Pos           11                                                      /*!< SDMMC CMD: TRANSFER_MODE Position       */
#define SDMMC_CMD_TRANSFER_MODE_Msk           (0x01UL << SDMMC_CMD_TRANSFER_MODE_Pos)                 /*!< SDMMC CMD: TRANSFER_MODE Mask           */
#define SDMMC_CMD_SEND_AUTO_STOP_Pos          12                                                      /*!< SDMMC CMD: SEND_AUTO_STOP Position      */
#define SDMMC_CMD_SEND_AUTO_STOP_Msk          (0x01UL << SDMMC_CMD_SEND_AUTO_STOP_Pos)                /*!< SDMMC CMD: SEND_AUTO_STOP Mask          */
#define SDMMC_CMD_WAIT_PRVDATA_COMPLETE_Pos   13                                                      /*!< SDMMC CMD: WAIT_PRVDATA_COMPLETE Position */
#define SDMMC_CMD_WAIT_PRVDATA_COMPLETE_Msk   (0x01UL << SDMMC_CMD_WAIT_PRVDATA_COMPLETE_Pos)         /*!< SDMMC CMD: WAIT_PRVDATA_COMPLETE Mask   */
#define SDMMC_CMD_STOP_ABORT_CMD_Pos          14                                                      /*!< SDMMC CMD: STOP_ABORT_CMD Position      */
#define SDMMC_CMD_STOP_ABORT_CMD_Msk          (0x01UL << SDMMC_CMD_STOP_ABORT_CMD_Pos)                /*!< SDMMC CMD: STOP_ABORT_CMD Mask          */
#define SDMMC_CMD_SEND_INITIALIZATION_Pos     15                                                      /*!< SDMMC CMD: SEND_INITIALIZATION Position */
#define SDMMC_CMD_SEND_INITIALIZATION_Msk     (0x01UL << SDMMC_CMD_SEND_INITIALIZATION_Pos)           /*!< SDMMC CMD: SEND_INITIALIZATION Mask     */
#define SDMMC_CMD_UPDATE_CLOCK_REGISTERS_ONLY_Pos 21                                                  /*!< SDMMC CMD: UPDATE_CLOCK_REGISTERS_ONLY Position */
#define SDMMC_CMD_UPDATE_CLOCK_REGISTERS_ONLY_Msk (0x01UL << SDMMC_CMD_UPDATE_CLOCK_REGISTERS_ONLY_Pos)/*!< SDMMC CMD: UPDATE_CLOCK_REGISTERS_ONLY Mask */
#define SDMMC_CMD_READ_CEATA_DEVICE_Pos       22                                                      /*!< SDMMC CMD: READ_CEATA_DEVICE Position   */
#define SDMMC_CMD_READ_CEATA_DEVICE_Msk       (0x01UL << SDMMC_CMD_READ_CEATA_DEVICE_Pos)             /*!< SDMMC CMD: READ_CEATA_DEVICE Mask       */
#define SDMMC_CMD_CCS_EXPECTED_Pos            23                                                      /*!< SDMMC CMD: CCS_EXPECTED Position        */
#define SDMMC_CMD_CCS_EXPECTED_Msk            (0x01UL << SDMMC_CMD_CCS_EXPECTED_Pos)                  /*!< SDMMC CMD: CCS_EXPECTED Mask            */
#define SDMMC_CMD_ENABLE_BOOT_Pos             24                                                      /*!< SDMMC CMD: ENABLE_BOOT Position         */
#define SDMMC_CMD_ENABLE_BOOT_Msk             (0x01UL << SDMMC_CMD_ENABLE_BOOT_Pos)                   /*!< SDMMC CMD: ENABLE_BOOT Mask             */
#define SDMMC_CMD_EXPECT_BOOT_ACK_Pos         25                                                      /*!< SDMMC CMD: EXPECT_BOOT_ACK Position     */
#define SDMMC_CMD_EXPECT_BOOT_ACK_Msk         (0x01UL << SDMMC_CMD_EXPECT_BOOT_ACK_Pos)               /*!< SDMMC CMD: EXPECT_BOOT_ACK Mask         */
#define SDMMC_CMD_DISABLE_BOOT_Pos            26                                                      /*!< SDMMC CMD: DISABLE_BOOT Position        */
#define SDMMC_CMD_DISABLE_BOOT_Msk            (0x01UL << SDMMC_CMD_DISABLE_BOOT_Pos)                  /*!< SDMMC CMD: DISABLE_BOOT Mask            */
#define SDMMC_CMD_BOOT_MODE_Pos               27                                                      /*!< SDMMC CMD: BOOT_MODE Position           */
#define SDMMC_CMD_BOOT_MODE_Msk               (0x01UL << SDMMC_CMD_BOOT_MODE_Pos)                     /*!< SDMMC CMD: BOOT_MODE Mask               */
#define SDMMC_CMD_VOLT_SWITCH_Pos             28                                                      /*!< SDMMC CMD: VOLT_SWITCH Position         */
#define SDMMC_CMD_VOLT_SWITCH_Msk             (0x01UL << SDMMC_CMD_VOLT_SWITCH_Pos)                   /*!< SDMMC CMD: VOLT_SWITCH Mask             */
#define SDMMC_CMD_START_CMD_Pos               31                                                      /*!< SDMMC CMD: START_CMD Position           */
#define SDMMC_CMD_START_CMD_Msk               (0x01UL << SDMMC_CMD_START_CMD_Pos)                     /*!< SDMMC CMD: START_CMD Mask               */

