roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SDMMC_RINTSTS  ------------------------------- */
#define SDMMC_RINTSTS_CDET_Pos                0                                                       /*!< SDMMC RINTSTS: CDET Position            */
#define SDMMC_RINTSTS_CDET_Msk                (0x01UL << SDMMC_RINTSTS_CDET_Pos)                      /*!< SDMMC RINTSTS: CDET Mask                */
#define SDMMC_RINTSTS_RE_Pos                  1                                                       /*!< SDMMC RINTSTS: RE Position              */
#define SDMMC_RINTSTS_RE_Msk                  (0x01UL << SDMMC_RINTSTS_RE_Pos)                        /*!< SDMMC RINTSTS: RE Mask                  */
#define SDMMC_RINTSTS_CDONE_Pos               2                                                       /*!< SDMMC RINTSTS: CDONE Position           */
#define SDMMC_RINTSTS_CDONE_Msk               (0x01UL << SDMMC_RINTSTS_CDONE_Pos)                     /*!< SDMMC RINTSTS: CDONE Mask               */
#define SDMMC_RINTSTS_DTO_Pos                 3                                                       /*!< SDMMC RINTSTS: DTO Position             */
#define SDMMC_RINTSTS_DTO_Msk                 (0x01UL << SDMMC_RINTSTS_DTO_Pos)                       /*!< SDMMC RINTSTS: DTO Mask                 */
#define SDMMC_RINTSTS_TXDR_Pos                4                                                       /*!< SDMMC RINTSTS: TXDR Position            */
#define SDMMC_RINTSTS_TXDR_Msk                (0x01UL << SDMMC_RINTSTS_TXDR_Pos)                      /*!< SDMMC RINTSTS: TXDR Mask                */
#define SDMMC_RINTSTS_RXDR_Pos                5                                                       /*!< SDMMC RINTSTS: RXDR Position            */
#define SDMMC_RINTSTS_RXDR_Msk                (0x01UL << SDMMC_RINTSTS_RXDR_Pos)                      /*!< SDMMC RINTSTS: RXDR Mask                */
#define SDMMC_RINTSTS_RCRC_Pos                6                                                       /*!< SDMMC RINTSTS: RCRC Position            */
#define SDMMC_RINTSTS_RCRC_Msk                (0x01UL << SDMMC_RINTSTS_RCRC_Pos)                      /*!< SDMMC RINTSTS: RCRC Mask                */
#define SDMMC_RINTSTS_DCRC_Pos                7                                                       /*!< SDMMC RINTSTS: DCRC Position            */
#define SDMMC_RINTSTS_DCRC_Msk                (0x01UL << SDMMC_RINTSTS_DCRC_Pos)                      /*!< SDMMC RINTSTS: DCRC Mask                */
#define SDMMC_RINTSTS_RTO_BAR_Pos             8                                                       /*!< SDMMC RINTSTS: RTO_BAR Position         */
#define SDMMC_RINTSTS_RTO_BAR_Msk             (0x01UL << SDMMC_RINTSTS_RTO_BAR_Pos)                   /*!< SDMMC RINTSTS: RTO_BAR Mask             */
#define SDMMC_RINTSTS_DRTO_BDS_Pos            9                                                       /*!< SDMMC RINTSTS: DRTO_BDS Position        */
#define SDMMC_RINTSTS_DRTO_BDS_Msk            (0x01UL << SDMMC_RINTSTS_DRTO_BDS_Pos)                  /*!< SDMMC RINTSTS: DRTO_BDS Mask            */
#define SDMMC_RINTSTS_HTO_Pos                 10                                                      /*!< SDMMC RINTSTS: HTO Position             */
#define SDMMC_RINTSTS_HTO_Msk                 (0x01UL << SDMMC_RINTSTS_HTO_Pos)                       /*!< SDMMC RINTSTS: HTO Mask                 */
#define SDMMC_RINTSTS_FRUN_Pos                11                                                      /*!< SDMMC RINTSTS: FRUN Position            */
#define SDMMC_RINTSTS_FRUN_Msk                (0x01UL << SDMMC_RINTSTS_FRUN_Pos)                      /*!< SDMMC RINTSTS: FRUN Mask                */
#define SDMMC_RINTSTS_HLE_Pos                 12                                                      /*!< SDMMC RINTSTS: HLE Position             */
#define SDMMC_RINTSTS_HLE_Msk                 (0x01UL << SDMMC_RINTSTS_HLE_Pos)                       /*!< SDMMC RINTSTS: HLE Mask                 */
#define SDMMC_RINTSTS_SBE_Pos                 13                                                      /*!< SDMMC RINTSTS: SBE Position             */
#define SDMMC_RINTSTS_SBE_Msk                 (0x01UL << SDMMC_RINTSTS_SBE_Pos)                       /*!< SDMMC RINTSTS: SBE Mask                 */
#define SDMMC_RINTSTS_ACD_Pos                 14                                                      /*!< SDMMC RINTSTS: ACD Position             */
#define SDMMC_RINTSTS_ACD_Msk                 (0x01UL << SDMMC_RINTSTS_ACD_Pos)                       /*!< SDMMC RINTSTS: ACD Mask                 */
#define SDMMC_RINTSTS_EBE_Pos                 15                                                      /*!< SDMMC RINTSTS: EBE Position             */
#define SDMMC_RINTSTS_EBE_Msk                 (0x01UL << SDMMC_RINTSTS_EBE_Pos)                       /*!< SDMMC RINTSTS: EBE Mask                 */
#define SDMMC_RINTSTS_SDIO_INTERRUPT_Pos      16                                                      /*!< SDMMC RINTSTS: SDIO_INTERRUPT Position  */
#define SDMMC_RINTSTS_SDIO_INTERRUPT_Msk      (0x01UL << SDMMC_RINTSTS_SDIO_INTERRUPT_Pos)            /*!< SDMMC RINTSTS: SDIO_INTERRUPT Mask      */

/* --------------------------------  SDMMC_STATUS  -------------------------------- */
#define SDMMC_STATUS_FIFO_RX_WATERMARK_Pos    0                                                       /*!< SDMMC STATUS: FIFO_RX_WATERMARK Position */
#define SDMMC_STATUS_FIFO_RX_WATERMARK_Msk    (0x01UL << SDMMC_STATUS_FIFO_RX_WATERMARK_Pos)          /*!< SDMMC STATUS: FIFO_RX_WATERMARK Mask    */
#define SDMMC_STATUS_FIFO_TX_WATERMARK_Pos    1                                                       /*!< SDMMC STATUS: FIFO_TX_WATERMARK Position */
#define SDMMC_STATUS_FIFO_TX_WATERMARK_Msk    (0x01UL << SDMMC_STATUS_FIFO_TX_WATERMARK_Pos)          /*!< SDMMC STATUS: FIFO_TX_WATERMARK Mask    */
#define SDMMC_STATUS_FIFO_EMPTY_Pos           2                                                       /*!< SDMMC STATUS: FIFO_EMPTY Position       */
#define SDMMC_STATUS_FIFO_EMPTY_Msk           (0x01UL << SDMMC_STATUS_FIFO_EMPTY_Pos)                 /*!< SDMMC STATUS: FIFO_EMPTY Mask           */
#define SDMMC_STATUS_FIFO_FULL_Pos            3                                                       /*!< SDMMC STATUS: FIFO_FULL Position        */
#define SDMMC_STATUS_FIFO_FULL_Msk            (0x01UL << SDMMC_STATUS_FIFO_FULL_Pos)                  /*!< SDMMC STATUS: FIFO_FULL Mask            */
#define SDMMC_STATUS_CMDFSMSTATES_Pos         4                                                       /*!< SDMMC STATUS: CMDFSMSTATES Position     */
#define SDMMC_STATUS_CMDFSMSTATES_Msk         (0x0fUL << SDMMC_STATUS_CMDFSMSTATES_Pos)               /*!< SDMMC STATUS: CMDFSMSTATES Mask         */
#define SDMMC_STATUS_DATA_3_STATUS_Pos        8                                                       /*!< SDMMC STATUS: DATA_3_STATUS Position    */
#define SDMMC_STATUS_DATA_3_STATUS_Msk        (0x01UL << SDMMC_STATUS_DATA_3_STATUS_Pos)              /*!< SDMMC STATUS: DATA_3_STATUS Mask        */
#define SDMMC_STATUS_DATA_BUSY_Pos            9                                                       /*!< SDMMC STATUS: DATA_BUSY Position        */
#define SDMMC_STATUS_DATA_BUSY_Msk            (0x01UL << SDMMC_STATUS_DATA_BUSY_Pos)                  /*!< SDMMC STATUS: DATA_BUSY Mask            */
#define SDMMC_STATUS_DATA_STATE_MC_BUSY_Pos   10                                                      /*!< SDMMC STATUS: DATA_STATE_MC_BUSY Position */
#define SDMMC_STATUS_DATA_STATE_MC_BUSY_Msk   (0x01UL << SDMMC_STATUS_DATA_STATE_MC_BUSY_Pos)         /*!< SDMMC STATUS: DATA_STATE_MC_BUSY Mask   */
#define SDMMC_STATUS_RESPONSE_INDEX_Pos       11                                                      /*!< SDMMC STATUS: RESPONSE_INDEX Position   */
#define SDMMC_STATUS_RESPONSE_INDEX_Msk       (0x3fUL << SDMMC_STATUS_RESPONSE_INDEX_Pos)             /*!< SDMMC STATUS: RESPONSE_INDEX Mask       */
#define SDMMC_STATUS_FIFO_COUNT_Pos           17                                                      /*!< SDMMC STATUS: FIFO_COUNT Position       */
#define SDMMC_STATUS_FIFO_COUNT_Msk           (0x00001fffUL << SDMMC_STATUS_FIFO_COUNT_Pos)           /*!< SDMMC STATUS: FIFO_COUNT Mask           */
#define SDMMC_STATUS_DMA_ACK_Pos              30                                                      /*!< SDMMC STATUS: DMA_ACK Position          */
#define SDMMC_STATUS_DMA_ACK_Msk              (0x01UL << SDMMC_STATUS_DMA_ACK_Pos)                    /*!< SDMMC STATUS: DMA_ACK Mask              */
#define SDMMC_STATUS_DMA_REQ_Pos              31                                                      /*!< SDMMC STATUS: DMA_REQ Position          */
#define SDMMC_STATUS_DMA_REQ_Msk              (0x01UL << SDMMC_STATUS_DMA_REQ_Pos)                    /*!< SDMMC STATUS: DMA_REQ Mask              */

/* --------------------------------  SDMMC_FIFOTH  -------------------------------- */
#define SDMMC_FIFOTH_TX_WMARK_Pos             0                                                       /*!< SDMMC FIFOTH: TX_WMARK Position         */
#define SDMMC_FIFOTH_TX_WMARK_Msk             (0x00000fffUL << SDMMC_FIFOTH_TX_WMARK_Pos)             /*!< SDMMC FIFOTH: TX_WMARK Mask             */
#define SDMMC_FIFOTH_RX_WMARK_Pos             16                                                      /*!< SDMMC FIFOTH: RX_WMARK Position         */
#define SDMMC_FIFOTH_RX_WMARK_Msk             (0x00000fffUL << SDMMC_FIFOTH_RX_WMARK_Pos)             /*!< SDMMC FIFOTH: RX_WMARK Mask             */
#define SDMMC_FIFOTH_DMA_MTS_Pos              28                                                      /*!< SDMMC FIFOTH: DMA_MTS Position          */
#define SDMMC_FIFOTH_DMA_MTS_Msk              (0x07UL << SDMMC_FIFOTH_DMA_MTS_Pos)                    /*!< SDMMC FIFOTH: DMA_MTS Mask              */

/* --------------------------------  SDMMC_CDETECT  ------------------------------- */
#define SDMMC_CDETECT_CARD_DETECT_Pos         0                                                       /*!< SDMMC CDETECT: CARD_DETECT Position     */
#define SDMMC_CDETECT_CARD_DETECT_Msk         (0x01UL << SDMMC_CDETECT_CARD_DETECT_Pos)               /*!< SDMMC CDETECT: CARD_DETECT Mask         */

