roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SDMMC_WRTPRT  -------------------------------- */
#define SDMMC_WRTPRT_WRITE_PROTECT_Pos        0                                                       /*!< SDMMC WRTPRT: WRITE_PROTECT Position    */
#define SDMMC_WRTPRT_WRITE_PROTECT_Msk        (0x01UL << SDMMC_WRTPRT_WRITE_PROTECT_Pos)              /*!< SDMMC WRTPRT: WRITE_PROTECT Mask        */

/* --------------------------------  SDMMC_TCBCNT  -------------------------------- */
#define SDMMC_TCBCNT_TRANS_CARD_BYTE_COUNT_Pos 0                                                      /*!< SDMMC TCBCNT: TRANS_CARD_BYTE_COUNT Position */
#define SDMMC_TCBCNT_TRANS_CARD_BYTE_COUNT_Msk (0xffffffffUL << SDMMC_TCBCNT_TRANS_CARD_BYTE_COUNT_Pos)/*!< SDMMC TCBCNT: TRANS_CARD_BYTE_COUNT Mask */

/* --------------------------------  SDMMC_TBBCNT  -------------------------------- */
#define SDMMC_TBBCNT_TRANS_FIFO_BYTE_COUNT_Pos 0                                                      /*!< SDMMC TBBCNT: TRANS_FIFO_BYTE_COUNT Position */
#define SDMMC_TBBCNT_TRANS_FIFO_BYTE_COUNT_Msk (0xffffffffUL << SDMMC_TBBCNT_TRANS_FIFO_BYTE_COUNT_Pos)/*!< SDMMC TBBCNT: TRANS_FIFO_BYTE_COUNT Mask */

/* --------------------------------  SDMMC_DEBNCE  -------------------------------- */
#define SDMMC_DEBNCE_DEBOUNCE_COUNT_Pos       0                                                       /*!< SDMMC DEBNCE: DEBOUNCE_COUNT Position   */
#define SDMMC_DEBNCE_DEBOUNCE_COUNT_Msk       (0x00ffffffUL << SDMMC_DEBNCE_DEBOUNCE_COUNT_Pos)       /*!< SDMMC DEBNCE: DEBOUNCE_COUNT Mask       */

/* ---------------------------------  SDMMC_RST_N  -------------------------------- */
#define SDMMC_RST_N_CARD_RESET_Pos            0                                                       /*!< SDMMC RST_N: CARD_RESET Position        */
#define SDMMC_RST_N_CARD_RESET_Msk            (0x01UL << SDMMC_RST_N_CARD_RESET_Pos)                  /*!< SDMMC RST_N: CARD_RESET Mask            */

/* ---------------------------------  SDMMC_BMOD  --------------------------------- */
#define SDMMC_BMOD_SWR_Pos                    0                                                       /*!< SDMMC BMOD: SWR Position                */
#define SDMMC_BMOD_SWR_Msk                    (0x01UL << SDMMC_BMOD_SWR_Pos)                          /*!< SDMMC BMOD: SWR Mask                    */
#define SDMMC_BMOD_FB_Pos                     1                                                       /*!< SDMMC BMOD: FB Position                 */
#define SDMMC_BMOD_FB_Msk                     (0x01UL << SDMMC_BMOD_FB_Pos)                           /*!< SDMMC BMOD: FB Mask                     */
#define SDMMC_BMOD_DSL_Pos                    2                                                       /*!< SDMMC BMOD: DSL Position                */
#define SDMMC_BMOD_DSL_Msk                    (0x1fUL << SDMMC_BMOD_DSL_Pos)                          /*!< SDMMC BMOD: DSL Mask                    */
#define SDMMC_BMOD_DE_Pos                     7                                                       /*!< SDMMC BMOD: DE Position                 */
#define SDMMC_BMOD_DE_Msk                     (0x01UL << SDMMC_BMOD_DE_Pos)                           /*!< SDMMC BMOD: DE Mask                     */
#define SDMMC_BMOD_PBL_Pos                    8                                                       /*!< SDMMC BMOD: PBL Position                */
#define SDMMC_BMOD_PBL_Msk                    (0x07UL << SDMMC_BMOD_PBL_Pos)                          /*!< SDMMC BMOD: PBL Mask                    */

/* --------------------------------  SDMMC_PLDMND  -------------------------------- */
#define SDMMC_PLDMND_PD_Pos                   0                                                       /*!< SDMMC PLDMND: PD Position               */
#define SDMMC_PLDMND_PD_Msk                   (0xffffffffUL << SDMMC_PLDMND_PD_Pos)                   /*!< SDMMC PLDMND: PD Mask                   */

/* --------------------------------  SDMMC_DBADDR  -------------------------------- */
#define SDMMC_DBADDR_SDL_Pos                  0                                                       /*!< SDMMC DBADDR: SDL Position              */
#define SDMMC_DBADDR_SDL_Msk                  (0xffffffffUL << SDMMC_DBADDR_SDL_Pos)                  /*!< SDMMC DBADDR: SDL Mask                  */

/* ---------------------------------  SDMMC_IDSTS  -------------------------------- */
#define SDMMC_IDSTS_TI_Pos                    0                                                       /*!< SDMMC IDSTS: TI Position                */
#define SDMMC_IDSTS_TI_Msk                    (0x01UL << SDMMC_IDSTS_TI_Pos)                          /*!< SDMMC IDSTS: TI Mask                    */
#define SDMMC_IDSTS_RI_Pos                    1                                                       /*!< SDMMC IDSTS: RI Position                */
#define SDMMC_IDSTS_RI_Msk                    (0x01UL << SDMMC_IDSTS_RI_Pos)                          /*!< SDMMC IDSTS: RI Mask                    */
#define SDMMC_IDSTS_FBE_Pos                   2                                                       /*!< SDMMC IDSTS: FBE Position               */
#define SDMMC_IDSTS_FBE_Msk                   (0x01UL << SDMMC_IDSTS_FBE_Pos)                         /*!< SDMMC IDSTS: FBE Mask                   */
#define SDMMC_IDSTS_DU_Pos                    4                                                       /*!< SDMMC IDSTS: DU Position                */
#define SDMMC_IDSTS_DU_Msk                    (0x01UL << SDMMC_IDSTS_DU_Pos)                          /*!< SDMMC IDSTS: DU Mask                    */
#define SDMMC_IDSTS_CES_Pos                   5                                                       /*!< SDMMC IDSTS: CES Position               */
#define SDMMC_IDSTS_CES_Msk                   (0x01UL << SDMMC_IDSTS_CES_Pos)                         /*!< SDMMC IDSTS: CES Mask                   */
#define SDMMC_IDSTS_NIS_Pos                   8                                                       /*!< SDMMC IDSTS: NIS Position               */
#define SDMMC_IDSTS_NIS_Msk                   (0x01UL << SDMMC_IDSTS_NIS_Pos)                         /*!< SDMMC IDSTS: NIS Mask                   */
#define SDMMC_IDSTS_AIS_Pos                   9                                                       /*!< SDMMC IDSTS: AIS Position               */
#define SDMMC_IDSTS_AIS_Msk                   (0x01UL << SDMMC_IDSTS_AIS_Pos)                         /*!< SDMMC IDSTS: AIS Mask                   */
#define SDMMC_IDSTS_EB_Pos                    10                                                      /*!< SDMMC IDSTS: EB Position                */
#define SDMMC_IDSTS_EB_Msk                    (0x07UL << SDMMC_IDSTS_EB_Pos)                          /*!< SDMMC IDSTS: EB Mask                    */
#define SDMMC_IDSTS_FSM_Pos                   13                                                      /*!< SDMMC IDSTS: FSM Position               */
#define SDMMC_IDSTS_FSM_Msk                   (0x0fUL << SDMMC_IDSTS_FSM_Pos)                         /*!< SDMMC IDSTS: FSM Mask                   */

/* --------------------------------  SDMMC_IDINTEN  ------------------------------- */
#define SDMMC_IDINTEN_TI_Pos                  0                                                       /*!< SDMMC IDINTEN: TI Position              */
#define SDMMC_IDINTEN_TI_Msk                  (0x01UL << SDMMC_IDINTEN_TI_Pos)                        /*!< SDMMC IDINTEN: TI Mask                  */
#define SDMMC_IDINTEN_RI_Pos                  1                                                       /*!< SDMMC IDINTEN: RI Position              */
#define SDMMC_IDINTEN_RI_Msk                  (0x01UL << SDMMC_IDINTEN_RI_Pos)                        /*!< SDMMC IDINTEN: RI Mask                  */
#define SDMMC_IDINTEN_FBE_Pos                 2                                                       /*!< SDMMC IDINTEN: FBE Position             */
#define SDMMC_IDINTEN_FBE_Msk                 (0x01UL << SDMMC_IDINTEN_FBE_Pos)                       /*!< SDMMC IDINTEN: FBE Mask                 */
#define SDMMC_IDINTEN_DU_Pos                  4                                                       /*!< SDMMC IDINTEN: DU Position              */
#define SDMMC_IDINTEN_DU_Msk                  (0x01UL << SDMMC_IDINTEN_DU_Pos)                        /*!< SDMMC IDINTEN: DU Mask                  */
#define SDMMC_IDINTEN_CES_Pos                 5                                                       /*!< SDMMC IDINTEN: CES Position             */
#define SDMMC_IDINTEN_CES_Msk                 (0x01UL << SDMMC_IDINTEN_CES_Pos)                       /*!< SDMMC IDINTEN: CES Mask                 */
#define SDMMC_IDINTEN_NIS_Pos                 8                                                       /*!< SDMMC IDINTEN: NIS Position             */
#define SDMMC_IDINTEN_NIS_Msk                 (0x01UL << SDMMC_IDINTEN_NIS_Pos)                       /*!< SDMMC IDINTEN: NIS Mask                 */
#define SDMMC_IDINTEN_AIS_Pos                 9                                                       /*!< SDMMC IDINTEN: AIS Position             */
#define SDMMC_IDINTEN_AIS_Msk                 (0x01UL << SDMMC_IDINTEN_AIS_Pos)                       /*!< SDMMC IDINTEN: AIS Mask                 */

/* --------------------------------  SDMMC_DSCADDR  ------------------------------- */
#define SDMMC_DSCADDR_HDA_Pos                 0                                                       /*!< SDMMC DSCADDR: HDA Position             */
#define SDMMC_DSCADDR_HDA_Msk                 (0xffffffffUL << SDMMC_DSCADDR_HDA_Pos)                 /*!< SDMMC DSCADDR: HDA Mask                 */

