roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SDMMC_BUFADDR  ------------------------------- */
#define SDMMC_BUFADDR_HBA_Pos                 0                                                       /*!< SDMMC BUFADDR: HBA Position             */
#define SDMMC_BUFADDR_HBA_Msk                 (0xffffffffUL << SDMMC_BUFADDR_HBA_Pos)                 /*!< SDMMC BUFADDR: HBA Mask                 */


/* ================================================================================ */
/* ================          struct 'EMC' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  EMC_CONTROL  -------------------------------- */
#define EMC_CONTROL_E_Pos                     0                                                       /*!< EMC CONTROL: E Position                 */
#define EMC_CONTROL_E_Msk                     (0x01UL << EMC_CONTROL_E_Pos)                           /*!< EMC CONTROL: E Mask                     */
#define EMC_CONTROL_M_Pos                     1                                                       /*!< EMC CONTROL: M Position                 */
#define EMC_CONTROL_M_Msk                     (0x01UL << EMC_CONTROL_M_Pos)                           /*!< EMC CONTROL: M Mask                     */
#define EMC_CONTROL_L_Pos                     2                                                       /*!< EMC CONTROL: L Position                 */
#define EMC_CONTROL_L_Msk                     (0x01UL << EMC_CONTROL_L_Pos)                           /*!< EMC CONTROL: L Mask                     */

/* ---------------------------------  EMC_STATUS  --------------------------------- */
#define EMC_STATUS_B_Pos                      0                                                       /*!< EMC STATUS: B Position                  */
#define EMC_STATUS_B_Msk                      (0x01UL << EMC_STATUS_B_Pos)                            /*!< EMC STATUS: B Mask                      */
#define EMC_STATUS_S_Pos                      1                                                       /*!< EMC STATUS: S Position                  */
#define EMC_STATUS_S_Msk                      (0x01UL << EMC_STATUS_S_Pos)                            /*!< EMC STATUS: S Mask                      */
#define EMC_STATUS_SA_Pos                     2                                                       /*!< EMC STATUS: SA Position                 */
#define EMC_STATUS_SA_Msk                     (0x01UL << EMC_STATUS_SA_Pos)                           /*!< EMC STATUS: SA Mask                     */

/* ---------------------------------  EMC_CONFIG  --------------------------------- */
#define EMC_CONFIG_EM_Pos                     0                                                       /*!< EMC CONFIG: EM Position                 */
#define EMC_CONFIG_EM_Msk                     (0x01UL << EMC_CONFIG_EM_Pos)                           /*!< EMC CONFIG: EM Mask                     */

/* -----------------------------  EMC_DYNAMICCONTROL  ----------------------------- */
#define EMC_DYNAMICCONTROL_CE_Pos             0                                                       /*!< EMC DYNAMICCONTROL: CE Position         */
#define EMC_DYNAMICCONTROL_CE_Msk             (0x01UL << EMC_DYNAMICCONTROL_CE_Pos)                   /*!< EMC DYNAMICCONTROL: CE Mask             */
#define EMC_DYNAMICCONTROL_CS_Pos             1                                                       /*!< EMC DYNAMICCONTROL: CS Position         */
#define EMC_DYNAMICCONTROL_CS_Msk             (0x01UL << EMC_DYNAMICCONTROL_CS_Pos)                   /*!< EMC DYNAMICCONTROL: CS Mask             */
#define EMC_DYNAMICCONTROL_SR_Pos             2                                                       /*!< EMC DYNAMICCONTROL: SR Position         */
#define EMC_DYNAMICCONTROL_SR_Msk             (0x01UL << EMC_DYNAMICCONTROL_SR_Pos)                   /*!< EMC DYNAMICCONTROL: SR Mask             */
#define EMC_DYNAMICCONTROL_MMC_Pos            5                                                       /*!< EMC DYNAMICCONTROL: MMC Position        */
#define EMC_DYNAMICCONTROL_MMC_Msk            (0x01UL << EMC_DYNAMICCONTROL_MMC_Pos)                  /*!< EMC DYNAMICCONTROL: MMC Mask            */
#define EMC_DYNAMICCONTROL_I_Pos              7                                                       /*!< EMC DYNAMICCONTROL: I Position          */
#define EMC_DYNAMICCONTROL_I_Msk              (0x03UL << EMC_DYNAMICCONTROL_I_Pos)                    /*!< EMC DYNAMICCONTROL: I Mask              */

/* -----------------------------  EMC_DYNAMICREFRESH  ----------------------------- */
#define EMC_DYNAMICREFRESH_REFRESH_Pos        0                                                       /*!< EMC DYNAMICREFRESH: REFRESH Position    */
#define EMC_DYNAMICREFRESH_REFRESH_Msk        (0x000007ffUL << EMC_DYNAMICREFRESH_REFRESH_Pos)        /*!< EMC DYNAMICREFRESH: REFRESH Mask        */

/* ----------------------------  EMC_DYNAMICREADCONFIG  --------------------------- */
#define EMC_DYNAMICREADCONFIG_RD_Pos          0                                                       /*!< EMC DYNAMICREADCONFIG: RD Position      */
#define EMC_DYNAMICREADCONFIG_RD_Msk          (0x03UL << EMC_DYNAMICREADCONFIG_RD_Pos)                /*!< EMC DYNAMICREADCONFIG: RD Mask          */

/* --------------------------------  EMC_DYNAMICRP  ------------------------------- */
#define EMC_DYNAMICRP_TRP_Pos                 0                                                       /*!< EMC DYNAMICRP: TRP Position             */
#define EMC_DYNAMICRP_TRP_Msk                 (0x0fUL << EMC_DYNAMICRP_TRP_Pos)                       /*!< EMC DYNAMICRP: TRP Mask                 */

/* -------------------------------  EMC_DYNAMICRAS  ------------------------------- */
#define EMC_DYNAMICRAS_TRAS_Pos               0                                                       /*!< EMC DYNAMICRAS: TRAS Position           */
#define EMC_DYNAMICRAS_TRAS_Msk               (0x0fUL << EMC_DYNAMICRAS_TRAS_Pos)                     /*!< EMC DYNAMICRAS: TRAS Mask               */

/* -------------------------------  EMC_DYNAMICSREX  ------------------------------ */
#define EMC_DYNAMICSREX_TSREX_Pos             0                                                       /*!< EMC DYNAMICSREX: TSREX Position         */
#define EMC_DYNAMICSREX_TSREX_Msk             (0x0fUL << EMC_DYNAMICSREX_TSREX_Pos)                   /*!< EMC DYNAMICSREX: TSREX Mask             */

/* -------------------------------  EMC_DYNAMICAPR  ------------------------------- */
#define EMC_DYNAMICAPR_TAPR_Pos               0                                                       /*!< EMC DYNAMICAPR: TAPR Position           */
#define EMC_DYNAMICAPR_TAPR_Msk               (0x0fUL << EMC_DYNAMICAPR_TAPR_Pos)                     /*!< EMC DYNAMICAPR: TAPR Mask               */

/* -------------------------------  EMC_DYNAMICDAL  ------------------------------- */
#define EMC_DYNAMICDAL_TDAL_Pos               0                                                       /*!< EMC DYNAMICDAL: TDAL Position           */
#define EMC_DYNAMICDAL_TDAL_Msk               (0x0fUL << EMC_DYNAMICDAL_TDAL_Pos)                     /*!< EMC DYNAMICDAL: TDAL Mask               */

/* --------------------------------  EMC_DYNAMICWR  ------------------------------- */
#define EMC_DYNAMICWR_TWR_Pos                 0                                                       /*!< EMC DYNAMICWR: TWR Position             */
#define EMC_DYNAMICWR_TWR_Msk                 (0x0fUL << EMC_DYNAMICWR_TWR_Pos)                       /*!< EMC DYNAMICWR: TWR Mask                 */

