roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  EMC_DYNAMICRC  ------------------------------- */
#define EMC_DYNAMICRC_TRC_Pos                 0                                                       /*!< EMC DYNAMICRC: TRC Position             */
#define EMC_DYNAMICRC_TRC_Msk                 (0x1fUL << EMC_DYNAMICRC_TRC_Pos)                       /*!< EMC DYNAMICRC: TRC Mask                 */

/* -------------------------------  EMC_DYNAMICRFC  ------------------------------- */
#define EMC_DYNAMICRFC_TRFC_Pos               0                                                       /*!< EMC DYNAMICRFC: TRFC Position           */
#define EMC_DYNAMICRFC_TRFC_Msk               (0x1fUL << EMC_DYNAMICRFC_TRFC_Pos)                     /*!< EMC DYNAMICRFC: TRFC Mask               */

/* -------------------------------  EMC_DYNAMICXSR  ------------------------------- */
#define EMC_DYNAMICXSR_TXSR_Pos               0                                                       /*!< EMC DYNAMICXSR: TXSR Position           */
#define EMC_DYNAMICXSR_TXSR_Msk               (0x1fUL << EMC_DYNAMICXSR_TXSR_Pos)                     /*!< EMC DYNAMICXSR: TXSR Mask               */

/* -------------------------------  EMC_DYNAMICRRD  ------------------------------- */
#define EMC_DYNAMICRRD_TRRD_Pos               0                                                       /*!< EMC DYNAMICRRD: TRRD Position           */
#define EMC_DYNAMICRRD_TRRD_Msk               (0x0fUL << EMC_DYNAMICRRD_TRRD_Pos)                     /*!< EMC DYNAMICRRD: TRRD Mask               */

/* -------------------------------  EMC_DYNAMICMRD  ------------------------------- */
#define EMC_DYNAMICMRD_TMRD_Pos               0                                                       /*!< EMC DYNAMICMRD: TMRD Position           */
#define EMC_DYNAMICMRD_TMRD_Msk               (0x0fUL << EMC_DYNAMICMRD_TMRD_Pos)                     /*!< EMC DYNAMICMRD: TMRD Mask               */

/* ---------------------------  EMC_STATICEXTENDEDWAIT  --------------------------- */
#define EMC_STATICEXTENDEDWAIT_EXTENDEDWAIT_Pos 0                                                     /*!< EMC STATICEXTENDEDWAIT: EXTENDEDWAIT Position */
#define EMC_STATICEXTENDEDWAIT_EXTENDEDWAIT_Msk (0x000003ffUL << EMC_STATICEXTENDEDWAIT_EXTENDEDWAIT_Pos)/*!< EMC STATICEXTENDEDWAIT: EXTENDEDWAIT Mask */

/* -----------------------------  EMC_DYNAMICCONFIG0  ----------------------------- */
#define EMC_DYNAMICCONFIG0_MD_Pos             3                                                       /*!< EMC DYNAMICCONFIG0: MD Position         */
#define EMC_DYNAMICCONFIG0_MD_Msk             (0x03UL << EMC_DYNAMICCONFIG0_MD_Pos)                   /*!< EMC DYNAMICCONFIG0: MD Mask             */
#define EMC_DYNAMICCONFIG0_AM0_Pos            7                                                       /*!< EMC DYNAMICCONFIG0: AM0 Position        */
#define EMC_DYNAMICCONFIG0_AM0_Msk            (0x3fUL << EMC_DYNAMICCONFIG0_AM0_Pos)                  /*!< EMC DYNAMICCONFIG0: AM0 Mask            */
#define EMC_DYNAMICCONFIG0_AM1_Pos            14                                                      /*!< EMC DYNAMICCONFIG0: AM1 Position        */
#define EMC_DYNAMICCONFIG0_AM1_Msk            (0x01UL << EMC_DYNAMICCONFIG0_AM1_Pos)                  /*!< EMC DYNAMICCONFIG0: AM1 Mask            */
#define EMC_DYNAMICCONFIG0_B_Pos              19                                                      /*!< EMC DYNAMICCONFIG0: B Position          */
#define EMC_DYNAMICCONFIG0_B_Msk              (0x01UL << EMC_DYNAMICCONFIG0_B_Pos)                    /*!< EMC DYNAMICCONFIG0: B Mask              */
#define EMC_DYNAMICCONFIG0_P_Pos              20                                                      /*!< EMC DYNAMICCONFIG0: P Position          */
#define EMC_DYNAMICCONFIG0_P_Msk              (0x01UL << EMC_DYNAMICCONFIG0_P_Pos)                    /*!< EMC DYNAMICCONFIG0: P Mask              */

/* -----------------------------  EMC_DYNAMICRASCAS0  ----------------------------- */
#define EMC_DYNAMICRASCAS0_RAS_Pos            0                                                       /*!< EMC DYNAMICRASCAS0: RAS Position        */
#define EMC_DYNAMICRASCAS0_RAS_Msk            (0x03UL << EMC_DYNAMICRASCAS0_RAS_Pos)                  /*!< EMC DYNAMICRASCAS0: RAS Mask            */
#define EMC_DYNAMICRASCAS0_CAS_Pos            8                                                       /*!< EMC DYNAMICRASCAS0: CAS Position        */
#define EMC_DYNAMICRASCAS0_CAS_Msk            (0x03UL << EMC_DYNAMICRASCAS0_CAS_Pos)                  /*!< EMC DYNAMICRASCAS0: CAS Mask            */

/* -----------------------------  EMC_DYNAMICCONFIG1  ----------------------------- */
#define EMC_DYNAMICCONFIG1_MD_Pos             3                                                       /*!< EMC DYNAMICCONFIG1: MD Position         */
#define EMC_DYNAMICCONFIG1_MD_Msk             (0x03UL << EMC_DYNAMICCONFIG1_MD_Pos)                   /*!< EMC DYNAMICCONFIG1: MD Mask             */
#define EMC_DYNAMICCONFIG1_AM0_Pos            7                                                       /*!< EMC DYNAMICCONFIG1: AM0 Position        */
#define EMC_DYNAMICCONFIG1_AM0_Msk            (0x3fUL << EMC_DYNAMICCONFIG1_AM0_Pos)                  /*!< EMC DYNAMICCONFIG1: AM0 Mask            */
#define EMC_DYNAMICCONFIG1_AM1_Pos            14                                                      /*!< EMC DYNAMICCONFIG1: AM1 Position        */
#define EMC_DYNAMICCONFIG1_AM1_Msk            (0x01UL << EMC_DYNAMICCONFIG1_AM1_Pos)                  /*!< EMC DYNAMICCONFIG1: AM1 Mask            */
#define EMC_DYNAMICCONFIG1_B_Pos              19                                                      /*!< EMC DYNAMICCONFIG1: B Position          */
#define EMC_DYNAMICCONFIG1_B_Msk              (0x01UL << EMC_DYNAMICCONFIG1_B_Pos)                    /*!< EMC DYNAMICCONFIG1: B Mask              */
#define EMC_DYNAMICCONFIG1_P_Pos              20                                                      /*!< EMC DYNAMICCONFIG1: P Position          */
#define EMC_DYNAMICCONFIG1_P_Msk              (0x01UL << EMC_DYNAMICCONFIG1_P_Pos)                    /*!< EMC DYNAMICCONFIG1: P Mask              */

/* -----------------------------  EMC_DYNAMICRASCAS1  ----------------------------- */
#define EMC_DYNAMICRASCAS1_RAS_Pos            0                                                       /*!< EMC DYNAMICRASCAS1: RAS Position        */
#define EMC_DYNAMICRASCAS1_RAS_Msk            (0x03UL << EMC_DYNAMICRASCAS1_RAS_Pos)                  /*!< EMC DYNAMICRASCAS1: RAS Mask            */
#define EMC_DYNAMICRASCAS1_CAS_Pos            8                                                       /*!< EMC DYNAMICRASCAS1: CAS Position        */
#define EMC_DYNAMICRASCAS1_CAS_Msk            (0x03UL << EMC_DYNAMICRASCAS1_CAS_Pos)                  /*!< EMC DYNAMICRASCAS1: CAS Mask            */

