roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  EMC_DYNAMICCONFIG2  ----------------------------- */
#define EMC_DYNAMICCONFIG2_MD_Pos             3                                                       /*!< EMC DYNAMICCONFIG2: MD Position         */
#define EMC_DYNAMICCONFIG2_MD_Msk             (0x03UL << EMC_DYNAMICCONFIG2_MD_Pos)                   /*!< EMC DYNAMICCONFIG2: MD Mask             */
#define EMC_DYNAMICCONFIG2_AM0_Pos            7                                                       /*!< EMC DYNAMICCONFIG2: AM0 Position        */
#define EMC_DYNAMICCONFIG2_AM0_Msk            (0x3fUL << EMC_DYNAMICCONFIG2_AM0_Pos)                  /*!< EMC DYNAMICCONFIG2: AM0 Mask            */
#define EMC_DYNAMICCONFIG2_AM1_Pos            14                                                      /*!< EMC DYNAMICCONFIG2: AM1 Position        */
#define EMC_DYNAMICCONFIG2_AM1_Msk            (0x01UL << EMC_DYNAMICCONFIG2_AM1_Pos)                  /*!< EMC DYNAMICCONFIG2: AM1 Mask            */
#define EMC_DYNAMICCONFIG2_B_Pos              19                                                      /*!< EMC DYNAMICCONFIG2: B Position          */
#define EMC_DYNAMICCONFIG2_B_Msk              (0x01UL << EMC_DYNAMICCONFIG2_B_Pos)                    /*!< EMC DYNAMICCONFIG2: B Mask              */
#define EMC_DYNAMICCONFIG2_P_Pos              20                                                      /*!< EMC DYNAMICCONFIG2: P Position          */
#define EMC_DYNAMICCONFIG2_P_Msk              (0x01UL << EMC_DYNAMICCONFIG2_P_Pos)                    /*!< EMC DYNAMICCONFIG2: P Mask              */

/* -----------------------------  EMC_DYNAMICRASCAS2  ----------------------------- */
#define EMC_DYNAMICRASCAS2_RAS_Pos            0                                                       /*!< EMC DYNAMICRASCAS2: RAS Position        */
#define EMC_DYNAMICRASCAS2_RAS_Msk            (0x03UL << EMC_DYNAMICRASCAS2_RAS_Pos)                  /*!< EMC DYNAMICRASCAS2: RAS Mask            */
#define EMC_DYNAMICRASCAS2_CAS_Pos            8                                                       /*!< EMC DYNAMICRASCAS2: CAS Position        */
#define EMC_DYNAMICRASCAS2_CAS_Msk            (0x03UL << EMC_DYNAMICRASCAS2_CAS_Pos)                  /*!< EMC DYNAMICRASCAS2: CAS Mask            */

/* -----------------------------  EMC_DYNAMICCONFIG3  ----------------------------- */
#define EMC_DYNAMICCONFIG3_MD_Pos             3                                                       /*!< EMC DYNAMICCONFIG3: MD Position         */
#define EMC_DYNAMICCONFIG3_MD_Msk             (0x03UL << EMC_DYNAMICCONFIG3_MD_Pos)                   /*!< EMC DYNAMICCONFIG3: MD Mask             */
#define EMC_DYNAMICCONFIG3_AM0_Pos            7                                                       /*!< EMC DYNAMICCONFIG3: AM0 Position        */
#define EMC_DYNAMICCONFIG3_AM0_Msk            (0x3fUL << EMC_DYNAMICCONFIG3_AM0_Pos)                  /*!< EMC DYNAMICCONFIG3: AM0 Mask            */
#define EMC_DYNAMICCONFIG3_AM1_Pos            14                                                      /*!< EMC DYNAMICCONFIG3: AM1 Position        */
#define EMC_DYNAMICCONFIG3_AM1_Msk            (0x01UL << EMC_DYNAMICCONFIG3_AM1_Pos)                  /*!< EMC DYNAMICCONFIG3: AM1 Mask            */
#define EMC_DYNAMICCONFIG3_B_Pos              19                                                      /*!< EMC DYNAMICCONFIG3: B Position          */
#define EMC_DYNAMICCONFIG3_B_Msk              (0x01UL << EMC_DYNAMICCONFIG3_B_Pos)                    /*!< EMC DYNAMICCONFIG3: B Mask              */
#define EMC_DYNAMICCONFIG3_P_Pos              20                                                      /*!< EMC DYNAMICCONFIG3: P Position          */
#define EMC_DYNAMICCONFIG3_P_Msk              (0x01UL << EMC_DYNAMICCONFIG3_P_Pos)                    /*!< EMC DYNAMICCONFIG3: P Mask              */

/* -----------------------------  EMC_DYNAMICRASCAS3  ----------------------------- */
#define EMC_DYNAMICRASCAS3_RAS_Pos            0                                                       /*!< EMC DYNAMICRASCAS3: RAS Position        */
#define EMC_DYNAMICRASCAS3_RAS_Msk            (0x03UL << EMC_DYNAMICRASCAS3_RAS_Pos)                  /*!< EMC DYNAMICRASCAS3: RAS Mask            */
#define EMC_DYNAMICRASCAS3_CAS_Pos            8                                                       /*!< EMC DYNAMICRASCAS3: CAS Position        */
#define EMC_DYNAMICRASCAS3_CAS_Msk            (0x03UL << EMC_DYNAMICRASCAS3_CAS_Pos)                  /*!< EMC DYNAMICRASCAS3: CAS Mask            */

/* ------------------------------  EMC_STATICCONFIG0  ----------------------------- */
#define EMC_STATICCONFIG0_MW_Pos              0                                                       /*!< EMC STATICCONFIG0: MW Position          */
#define EMC_STATICCONFIG0_MW_Msk              (0x03UL << EMC_STATICCONFIG0_MW_Pos)                    /*!< EMC STATICCONFIG0: MW Mask              */
#define EMC_STATICCONFIG0_PM_Pos              3                                                       /*!< EMC STATICCONFIG0: PM Position          */
#define EMC_STATICCONFIG0_PM_Msk              (0x01UL << EMC_STATICCONFIG0_PM_Pos)                    /*!< EMC STATICCONFIG0: PM Mask              */
#define EMC_STATICCONFIG0_PC_Pos              6                                                       /*!< EMC STATICCONFIG0: PC Position          */
#define EMC_STATICCONFIG0_PC_Msk              (0x01UL << EMC_STATICCONFIG0_PC_Pos)                    /*!< EMC STATICCONFIG0: PC Mask              */
#define EMC_STATICCONFIG0_PB_Pos              7                                                       /*!< EMC STATICCONFIG0: PB Position          */
#define EMC_STATICCONFIG0_PB_Msk              (0x01UL << EMC_STATICCONFIG0_PB_Pos)                    /*!< EMC STATICCONFIG0: PB Mask              */
#define EMC_STATICCONFIG0_EW_Pos              8                                                       /*!< EMC STATICCONFIG0: EW Position          */
#define EMC_STATICCONFIG0_EW_Msk              (0x01UL << EMC_STATICCONFIG0_EW_Pos)                    /*!< EMC STATICCONFIG0: EW Mask              */
#define EMC_STATICCONFIG0_B_Pos               19                                                      /*!< EMC STATICCONFIG0: B Position           */
#define EMC_STATICCONFIG0_B_Msk               (0x01UL << EMC_STATICCONFIG0_B_Pos)                     /*!< EMC STATICCONFIG0: B Mask               */
#define EMC_STATICCONFIG0_P_Pos               20                                                      /*!< EMC STATICCONFIG0: P Position           */
#define EMC_STATICCONFIG0_P_Msk               (0x01UL << EMC_STATICCONFIG0_P_Pos)                     /*!< EMC STATICCONFIG0: P Mask               */

/* -----------------------------  EMC_STATICWAITWEN0  ----------------------------- */
#define EMC_STATICWAITWEN0_WAITWEN_Pos        0                                                       /*!< EMC STATICWAITWEN0: WAITWEN Position    */
#define EMC_STATICWAITWEN0_WAITWEN_Msk        (0x0fUL << EMC_STATICWAITWEN0_WAITWEN_Pos)              /*!< EMC STATICWAITWEN0: WAITWEN Mask        */

