roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ------------------------------  EMC_STATICCONFIG2  ----------------------------- */
#define EMC_STATICCONFIG2_MW_Pos              0                                                       /*!< EMC STATICCONFIG2: MW Position          */
#define EMC_STATICCONFIG2_MW_Msk              (0x03UL << EMC_STATICCONFIG2_MW_Pos)                    /*!< EMC STATICCONFIG2: MW Mask              */
#define EMC_STATICCONFIG2_PM_Pos              3                                                       /*!< EMC STATICCONFIG2: PM Position          */
#define EMC_STATICCONFIG2_PM_Msk              (0x01UL << EMC_STATICCONFIG2_PM_Pos)                    /*!< EMC STATICCONFIG2: PM Mask              */
#define EMC_STATICCONFIG2_PC_Pos              6                                                       /*!< EMC STATICCONFIG2: PC Position          */
#define EMC_STATICCONFIG2_PC_Msk              (0x01UL << EMC_STATICCONFIG2_PC_Pos)                    /*!< EMC STATICCONFIG2: PC Mask              */
#define EMC_STATICCONFIG2_PB_Pos              7                                                       /*!< EMC STATICCONFIG2: PB Position          */
#define EMC_STATICCONFIG2_PB_Msk              (0x01UL << EMC_STATICCONFIG2_PB_Pos)                    /*!< EMC STATICCONFIG2: PB Mask              */
#define EMC_STATICCONFIG2_EW_Pos              8                                                       /*!< EMC STATICCONFIG2: EW Position          */
#define EMC_STATICCONFIG2_EW_Msk              (0x01UL << EMC_STATICCONFIG2_EW_Pos)                    /*!< EMC STATICCONFIG2: EW Mask              */
#define EMC_STATICCONFIG2_B_Pos               19                                                      /*!< EMC STATICCONFIG2: B Position           */
#define EMC_STATICCONFIG2_B_Msk               (0x01UL << EMC_STATICCONFIG2_B_Pos)                     /*!< EMC STATICCONFIG2: B Mask               */
#define EMC_STATICCONFIG2_P_Pos               20                                                      /*!< EMC STATICCONFIG2: P Position           */
#define EMC_STATICCONFIG2_P_Msk               (0x01UL << EMC_STATICCONFIG2_P_Pos)                     /*!< EMC STATICCONFIG2: P Mask               */

/* -----------------------------  EMC_STATICWAITWEN2  ----------------------------- */
#define EMC_STATICWAITWEN2_WAITWEN_Pos        0                                                       /*!< EMC STATICWAITWEN2: WAITWEN Position    */
#define EMC_STATICWAITWEN2_WAITWEN_Msk        (0x0fUL << EMC_STATICWAITWEN2_WAITWEN_Pos)              /*!< EMC STATICWAITWEN2: WAITWEN Mask        */

/* -----------------------------  EMC_STATICWAITOEN2  ----------------------------- */
#define EMC_STATICWAITOEN2_WAITOEN_Pos        0                                                       /*!< EMC STATICWAITOEN2: WAITOEN Position    */
#define EMC_STATICWAITOEN2_WAITOEN_Msk        (0x0fUL << EMC_STATICWAITOEN2_WAITOEN_Pos)              /*!< EMC STATICWAITOEN2: WAITOEN Mask        */

/* ------------------------------  EMC_STATICWAITRD2  ----------------------------- */
#define EMC_STATICWAITRD2_WAITRD_Pos          0                                                       /*!< EMC STATICWAITRD2: WAITRD Position      */
#define EMC_STATICWAITRD2_WAITRD_Msk          (0x1fUL << EMC_STATICWAITRD2_WAITRD_Pos)                /*!< EMC STATICWAITRD2: WAITRD Mask          */

/* -----------------------------  EMC_STATICWAITPAGE2  ---------------------------- */
#define EMC_STATICWAITPAGE2_WAITPAGE_Pos      0                                                       /*!< EMC STATICWAITPAGE2: WAITPAGE Position  */
#define EMC_STATICWAITPAGE2_WAITPAGE_Msk      (0x1fUL << EMC_STATICWAITPAGE2_WAITPAGE_Pos)            /*!< EMC STATICWAITPAGE2: WAITPAGE Mask      */

/* ------------------------------  EMC_STATICWAITWR2  ----------------------------- */
#define EMC_STATICWAITWR2_WAITWR_Pos          0                                                       /*!< EMC STATICWAITWR2: WAITWR Position      */
#define EMC_STATICWAITWR2_WAITWR_Msk          (0x1fUL << EMC_STATICWAITWR2_WAITWR_Pos)                /*!< EMC STATICWAITWR2: WAITWR Mask          */

/* -----------------------------  EMC_STATICWAITTURN2  ---------------------------- */
#define EMC_STATICWAITTURN2_WAITTURN_Pos      0                                                       /*!< EMC STATICWAITTURN2: WAITTURN Position  */
#define EMC_STATICWAITTURN2_WAITTURN_Msk      (0x0fUL << EMC_STATICWAITTURN2_WAITTURN_Pos)            /*!< EMC STATICWAITTURN2: WAITTURN Mask      */

/* ------------------------------  EMC_STATICCONFIG3  ----------------------------- */
#define EMC_STATICCONFIG3_MW_Pos              0                                                       /*!< EMC STATICCONFIG3: MW Position          */
#define EMC_STATICCONFIG3_MW_Msk              (0x03UL << EMC_STATICCONFIG3_MW_Pos)                    /*!< EMC STATICCONFIG3: MW Mask              */
#define EMC_STATICCONFIG3_PM_Pos              3                                                       /*!< EMC STATICCONFIG3: PM Position          */
#define EMC_STATICCONFIG3_PM_Msk              (0x01UL << EMC_STATICCONFIG3_PM_Pos)                    /*!< EMC STATICCONFIG3: PM Mask              */
#define EMC_STATICCONFIG3_PC_Pos              6                                                       /*!< EMC STATICCONFIG3: PC Position          */
#define EMC_STATICCONFIG3_PC_Msk              (0x01UL << EMC_STATICCONFIG3_PC_Pos)                    /*!< EMC STATICCONFIG3: PC Mask              */
#define EMC_STATICCONFIG3_PB_Pos              7                                                       /*!< EMC STATICCONFIG3: PB Position          */
#define EMC_STATICCONFIG3_PB_Msk              (0x01UL << EMC_STATICCONFIG3_PB_Pos)                    /*!< EMC STATICCONFIG3: PB Mask              */
#define EMC_STATICCONFIG3_EW_Pos              8                                                       /*!< EMC STATICCONFIG3: EW Position          */
#define EMC_STATICCONFIG3_EW_Msk              (0x01UL << EMC_STATICCONFIG3_EW_Pos)                    /*!< EMC STATICCONFIG3: EW Mask              */
#define EMC_STATICCONFIG3_B_Pos               19                                                      /*!< EMC STATICCONFIG3: B Position           */
#define EMC_STATICCONFIG3_B_Msk               (0x01UL << EMC_STATICCONFIG3_B_Pos)                     /*!< EMC STATICCONFIG3: B Mask               */
#define EMC_STATICCONFIG3_P_Pos               20                                                      /*!< EMC STATICCONFIG3: P Position           */
#define EMC_STATICCONFIG3_P_Msk               (0x01UL << EMC_STATICCONFIG3_P_Pos)                     /*!< EMC STATICCONFIG3: P Mask               */

/* -----------------------------  EMC_STATICWAITWEN3  ----------------------------- */
#define EMC_STATICWAITWEN3_WAITWEN_Pos        0                                                       /*!< EMC STATICWAITWEN3: WAITWEN Position    */
#define EMC_STATICWAITWEN3_WAITWEN_Msk        (0x0fUL << EMC_STATICWAITWEN3_WAITWEN_Pos)              /*!< EMC STATICWAITWEN3: WAITWEN Mask        */

/* -----------------------------  EMC_STATICWAITOEN3  ----------------------------- */
#define EMC_STATICWAITOEN3_WAITOEN_Pos        0                                                       /*!< EMC STATICWAITOEN3: WAITOEN Position    */
#define EMC_STATICWAITOEN3_WAITOEN_Msk        (0x0fUL << EMC_STATICWAITOEN3_WAITOEN_Pos)              /*!< EMC STATICWAITOEN3: WAITOEN Mask        */

/* ------------------------------  EMC_STATICWAITRD3  ----------------------------- */
#define EMC_STATICWAITRD3_WAITRD_Pos          0                                                       /*!< EMC STATICWAITRD3: WAITRD Position      */
#define EMC_STATICWAITRD3_WAITRD_Msk          (0x1fUL << EMC_STATICWAITRD3_WAITRD_Pos)                /*!< EMC STATICWAITRD3: WAITRD Mask          */

