roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  EMC_STATICWAITPAGE3  ---------------------------- */
#define EMC_STATICWAITPAGE3_WAITPAGE_Pos      0                                                       /*!< EMC STATICWAITPAGE3: WAITPAGE Position  */
#define EMC_STATICWAITPAGE3_WAITPAGE_Msk      (0x1fUL << EMC_STATICWAITPAGE3_WAITPAGE_Pos)            /*!< EMC STATICWAITPAGE3: WAITPAGE Mask      */

/* ------------------------------  EMC_STATICWAITWR3  ----------------------------- */
#define EMC_STATICWAITWR3_WAITWR_Pos          0                                                       /*!< EMC STATICWAITWR3: WAITWR Position      */
#define EMC_STATICWAITWR3_WAITWR_Msk          (0x1fUL << EMC_STATICWAITWR3_WAITWR_Pos)                /*!< EMC STATICWAITWR3: WAITWR Mask          */

/* -----------------------------  EMC_STATICWAITTURN3  ---------------------------- */
#define EMC_STATICWAITTURN3_WAITTURN_Pos      0                                                       /*!< EMC STATICWAITTURN3: WAITTURN Position  */
#define EMC_STATICWAITTURN3_WAITTURN_Msk      (0x0fUL << EMC_STATICWAITTURN3_WAITTURN_Pos)            /*!< EMC STATICWAITTURN3: WAITTURN Mask      */


/* ================================================================================ */
/* ================          struct 'USB0' Position & Mask         ================ */
/* ================================================================================ */


/* -------------------------------  USB0_CAPLENGTH  ------------------------------- */
#define USB0_CAPLENGTH_CAPLENGTH_Pos          0                                                       /*!< USB0 CAPLENGTH: CAPLENGTH Position      */
#define USB0_CAPLENGTH_CAPLENGTH_Msk          (0x000000ffUL << USB0_CAPLENGTH_CAPLENGTH_Pos)          /*!< USB0 CAPLENGTH: CAPLENGTH Mask          */
#define USB0_CAPLENGTH_HCIVERSION_Pos         8                                                       /*!< USB0 CAPLENGTH: HCIVERSION Position     */
#define USB0_CAPLENGTH_HCIVERSION_Msk         (0x0000ffffUL << USB0_CAPLENGTH_HCIVERSION_Pos)         /*!< USB0 CAPLENGTH: HCIVERSION Mask         */

/* -------------------------------  USB0_HCSPARAMS  ------------------------------- */
#define USB0_HCSPARAMS_N_PORTS_Pos            0                                                       /*!< USB0 HCSPARAMS: N_PORTS Position        */
#define USB0_HCSPARAMS_N_PORTS_Msk            (0x0fUL << USB0_HCSPARAMS_N_PORTS_Pos)                  /*!< USB0 HCSPARAMS: N_PORTS Mask            */
#define USB0_HCSPARAMS_PPC_Pos                4                                                       /*!< USB0 HCSPARAMS: PPC Position            */
#define USB0_HCSPARAMS_PPC_Msk                (0x01UL << USB0_HCSPARAMS_PPC_Pos)                      /*!< USB0 HCSPARAMS: PPC Mask                */
#define USB0_HCSPARAMS_N_PCC_Pos              8                                                       /*!< USB0 HCSPARAMS: N_PCC Position          */
#define USB0_HCSPARAMS_N_PCC_Msk              (0x0fUL << USB0_HCSPARAMS_N_PCC_Pos)                    /*!< USB0 HCSPARAMS: N_PCC Mask              */
#define USB0_HCSPARAMS_N_CC_Pos               12                                                      /*!< USB0 HCSPARAMS: N_CC Position           */
#define USB0_HCSPARAMS_N_CC_Msk               (0x0fUL << USB0_HCSPARAMS_N_CC_Pos)                     /*!< USB0 HCSPARAMS: N_CC Mask               */
#define USB0_HCSPARAMS_PI_Pos                 16                                                      /*!< USB0 HCSPARAMS: PI Position             */
#define USB0_HCSPARAMS_PI_Msk                 (0x01UL << USB0_HCSPARAMS_PI_Pos)                       /*!< USB0 HCSPARAMS: PI Mask                 */
#define USB0_HCSPARAMS_N_PTT_Pos              20                                                      /*!< USB0 HCSPARAMS: N_PTT Position          */
#define USB0_HCSPARAMS_N_PTT_Msk              (0x0fUL << USB0_HCSPARAMS_N_PTT_Pos)                    /*!< USB0 HCSPARAMS: N_PTT Mask              */
#define USB0_HCSPARAMS_N_TT_Pos               24                                                      /*!< USB0 HCSPARAMS: N_TT Position           */
#define USB0_HCSPARAMS_N_TT_Msk               (0x0fUL << USB0_HCSPARAMS_N_TT_Pos)                     /*!< USB0 HCSPARAMS: N_TT Mask               */

/* -------------------------------  USB0_HCCPARAMS  ------------------------------- */
#define USB0_HCCPARAMS_ADC_Pos                0                                                       /*!< USB0 HCCPARAMS: ADC Position            */
#define USB0_HCCPARAMS_ADC_Msk                (0x01UL << USB0_HCCPARAMS_ADC_Pos)                      /*!< USB0 HCCPARAMS: ADC Mask                */
#define USB0_HCCPARAMS_PFL_Pos                1                                                       /*!< USB0 HCCPARAMS: PFL Position            */
#define USB0_HCCPARAMS_PFL_Msk                (0x01UL << USB0_HCCPARAMS_PFL_Pos)                      /*!< USB0 HCCPARAMS: PFL Mask                */
#define USB0_HCCPARAMS_ASP_Pos                2                                                       /*!< USB0 HCCPARAMS: ASP Position            */
#define USB0_HCCPARAMS_ASP_Msk                (0x01UL << USB0_HCCPARAMS_ASP_Pos)                      /*!< USB0 HCCPARAMS: ASP Mask                */
#define USB0_HCCPARAMS_IST_Pos                4                                                       /*!< USB0 HCCPARAMS: IST Position            */
#define USB0_HCCPARAMS_IST_Msk                (0x0fUL << USB0_HCCPARAMS_IST_Pos)                      /*!< USB0 HCCPARAMS: IST Mask                */
#define USB0_HCCPARAMS_EECP_Pos               8                                                       /*!< USB0 HCCPARAMS: EECP Position           */
#define USB0_HCCPARAMS_EECP_Msk               (0x000000ffUL << USB0_HCCPARAMS_EECP_Pos)               /*!< USB0 HCCPARAMS: EECP Mask               */

/* -------------------------------  USB0_DCIVERSION  ------------------------------ */
#define USB0_DCIVERSION_DCIVERSION_Pos        0                                                       /*!< USB0 DCIVERSION: DCIVERSION Position    */
#define USB0_DCIVERSION_DCIVERSION_Msk        (0x0000ffffUL << USB0_DCIVERSION_DCIVERSION_Pos)        /*!< USB0 DCIVERSION: DCIVERSION Mask        */

/* --------------------------------  USB0_USBCMD_D  ------------------------------- */
#define USB0_USBCMD_D_RS_Pos                  0                                                       /*!< USB0 USBCMD_D: RS Position              */
#define USB0_USBCMD_D_RS_Msk                  (0x01UL << USB0_USBCMD_D_RS_Pos)                        /*!< USB0 USBCMD_D: RS Mask                  */
#define USB0_USBCMD_D_RST_Pos                 1                                                       /*!< USB0 USBCMD_D: RST Position             */
#define USB0_USBCMD_D_RST_Msk                 (0x01UL << USB0_USBCMD_D_RST_Pos)                       /*!< USB0 USBCMD_D: RST Mask                 */
#define USB0_USBCMD_D_SUTW_Pos                13                                                      /*!< USB0 USBCMD_D: SUTW Position            */
#define USB0_USBCMD_D_SUTW_Msk                (0x01UL << USB0_USBCMD_D_SUTW_Pos)                      /*!< USB0 USBCMD_D: SUTW Mask                */
#define USB0_USBCMD_D_ATDTW_Pos               14                                                      /*!< USB0 USBCMD_D: ATDTW Position           */
#define USB0_USBCMD_D_ATDTW_Msk               (0x01UL << USB0_USBCMD_D_ATDTW_Pos)                     /*!< USB0 USBCMD_D: ATDTW Mask               */
#define USB0_USBCMD_D_ITC_Pos                 16                                                      /*!< USB0 USBCMD_D: ITC Position             */
#define USB0_USBCMD_D_ITC_Msk                 (0x000000ffUL << USB0_USBCMD_D_ITC_Pos)                 /*!< USB0 USBCMD_D: ITC Mask                 */

/* --------------------------------  USB0_USBCMD_H  ------------------------------- */
#define USB0_USBCMD_H_RS_Pos                  0                                                       /*!< USB0 USBCMD_H: RS Position              */
#define USB0_USBCMD_H_RS_Msk                  (0x01UL << USB0_USBCMD_H_RS_Pos)                        /*!< USB0 USBCMD_H: RS Mask                  */
#define USB0_USBCMD_H_RST_Pos                 1                                                       /*!< USB0 USBCMD_H: RST Position             */
#define USB0_USBCMD_H_RST_Msk                 (0x01UL << USB0_USBCMD_H_RST_Pos)                       /*!< USB0 USBCMD_H: RST Mask                 */
#define USB0_USBCMD_H_FS0_Pos                 2                                                       /*!< USB0 USBCMD_H: FS0 Position             */
#define USB0_USBCMD_H_FS0_Msk                 (0x01UL << USB0_USBCMD_H_FS0_Pos)                       /*!< USB0 USBCMD_H: FS0 Mask                 */
#define USB0_USBCMD_H_FS1_Pos                 3                                                       /*!< USB0 USBCMD_H: FS1 Position             */
#define USB0_USBCMD_H_FS1_Msk                 (0x01UL << USB0_USBCMD_H_FS1_Pos)                       /*!< USB0 USBCMD_H: FS1 Mask                 */
#define USB0_USBCMD_H_PSE_Pos                 4                                                       /*!< USB0 USBCMD_H: PSE Position             */
#define USB0_USBCMD_H_PSE_Msk                 (0x01UL << USB0_USBCMD_H_PSE_Pos)                       /*!< USB0 USBCMD_H: PSE Mask                 */
#define USB0_USBCMD_H_ASE_Pos                 5                                                       /*!< USB0 USBCMD_H: ASE Position             */
#define USB0_USBCMD_H_ASE_Msk                 (0x01UL << USB0_USBCMD_H_ASE_Pos)                       /*!< USB0 USBCMD_H: ASE Mask                 */
#define USB0_USBCMD_H_IAA_Pos                 6                                                       /*!< USB0 USBCMD_H: IAA Position             */
#define USB0_USBCMD_H_IAA_Msk                 (0x01UL << USB0_USBCMD_H_IAA_Pos)                       /*!< USB0 USBCMD_H: IAA Mask                 */
#define USB0_USBCMD_H_ASP1_0_Pos              8                                                       /*!< USB0 USBCMD_H: ASP1_0 Position          */
#define USB0_USBCMD_H_ASP1_0_Msk              (0x03UL << USB0_USBCMD_H_ASP1_0_Pos)                    /*!< USB0 USBCMD_H: ASP1_0 Mask              */
#define USB0_USBCMD_H_ASPE_Pos                11                                                      /*!< USB0 USBCMD_H: ASPE Position            */
#define USB0_USBCMD_H_ASPE_Msk                (0x01UL << USB0_USBCMD_H_ASPE_Pos)                      /*!< USB0 USBCMD_H: ASPE Mask                */
#define USB0_USBCMD_H_FS2_Pos                 15                                                      /*!< USB0 USBCMD_H: FS2 Position             */
#define USB0_USBCMD_H_FS2_Msk                 (0x01UL << USB0_USBCMD_H_FS2_Pos)                       /*!< USB0 USBCMD_H: FS2 Mask                 */
#define USB0_USBCMD_H_ITC_Pos                 16                                                      /*!< USB0 USBCMD_H: ITC Position             */
#define USB0_USBCMD_H_ITC_Msk                 (0x000000ffUL << USB0_USBCMD_H_ITC_Pos)                 /*!< USB0 USBCMD_H: ITC Mask                 */

