roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  USB0_USBSTS_D  ------------------------------- */
#define USB0_USBSTS_D_UI_Pos                  0                                                       /*!< USB0 USBSTS_D: UI Position              */
#define USB0_USBSTS_D_UI_Msk                  (0x01UL << USB0_USBSTS_D_UI_Pos)                        /*!< USB0 USBSTS_D: UI Mask                  */
#define USB0_USBSTS_D_UEI_Pos                 1                                                       /*!< USB0 USBSTS_D: UEI Position             */
#define USB0_USBSTS_D_UEI_Msk                 (0x01UL << USB0_USBSTS_D_UEI_Pos)                       /*!< USB0 USBSTS_D: UEI Mask                 */
#define USB0_USBSTS_D_PCI_Pos                 2                                                       /*!< USB0 USBSTS_D: PCI Position             */
#define USB0_USBSTS_D_PCI_Msk                 (0x01UL << USB0_USBSTS_D_PCI_Pos)                       /*!< USB0 USBSTS_D: PCI Mask                 */
#define USB0_USBSTS_D_AAI_Pos                 5                                                       /*!< USB0 USBSTS_D: AAI Position             */
#define USB0_USBSTS_D_AAI_Msk                 (0x01UL << USB0_USBSTS_D_AAI_Pos)                       /*!< USB0 USBSTS_D: AAI Mask                 */
#define USB0_USBSTS_D_URI_Pos                 6                                                       /*!< USB0 USBSTS_D: URI Position             */
#define USB0_USBSTS_D_URI_Msk                 (0x01UL << USB0_USBSTS_D_URI_Pos)                       /*!< USB0 USBSTS_D: URI Mask                 */
#define USB0_USBSTS_D_SRI_Pos                 7                                                       /*!< USB0 USBSTS_D: SRI Position             */
#define USB0_USBSTS_D_SRI_Msk                 (0x01UL << USB0_USBSTS_D_SRI_Pos)                       /*!< USB0 USBSTS_D: SRI Mask                 */
#define USB0_USBSTS_D_SLI_Pos                 8                                                       /*!< USB0 USBSTS_D: SLI Position             */
#define USB0_USBSTS_D_SLI_Msk                 (0x01UL << USB0_USBSTS_D_SLI_Pos)                       /*!< USB0 USBSTS_D: SLI Mask                 */
#define USB0_USBSTS_D_NAKI_Pos                16                                                      /*!< USB0 USBSTS_D: NAKI Position            */
#define USB0_USBSTS_D_NAKI_Msk                (0x01UL << USB0_USBSTS_D_NAKI_Pos)                      /*!< USB0 USBSTS_D: NAKI Mask                */

/* --------------------------------  USB0_USBSTS_H  ------------------------------- */
#define USB0_USBSTS_H_UI_Pos                  0                                                       /*!< USB0 USBSTS_H: UI Position              */
#define USB0_USBSTS_H_UI_Msk                  (0x01UL << USB0_USBSTS_H_UI_Pos)                        /*!< USB0 USBSTS_H: UI Mask                  */
#define USB0_USBSTS_H_UEI_Pos                 1                                                       /*!< USB0 USBSTS_H: UEI Position             */
#define USB0_USBSTS_H_UEI_Msk                 (0x01UL << USB0_USBSTS_H_UEI_Pos)                       /*!< USB0 USBSTS_H: UEI Mask                 */
#define USB0_USBSTS_H_PCI_Pos                 2                                                       /*!< USB0 USBSTS_H: PCI Position             */
#define USB0_USBSTS_H_PCI_Msk                 (0x01UL << USB0_USBSTS_H_PCI_Pos)                       /*!< USB0 USBSTS_H: PCI Mask                 */
#define USB0_USBSTS_H_FRI_Pos                 3                                                       /*!< USB0 USBSTS_H: FRI Position             */
#define USB0_USBSTS_H_FRI_Msk                 (0x01UL << USB0_USBSTS_H_FRI_Pos)                       /*!< USB0 USBSTS_H: FRI Mask                 */
#define USB0_USBSTS_H_AAI_Pos                 5                                                       /*!< USB0 USBSTS_H: AAI Position             */
#define USB0_USBSTS_H_AAI_Msk                 (0x01UL << USB0_USBSTS_H_AAI_Pos)                       /*!< USB0 USBSTS_H: AAI Mask                 */
#define USB0_USBSTS_H_SRI_Pos                 7                                                       /*!< USB0 USBSTS_H: SRI Position             */
#define USB0_USBSTS_H_SRI_Msk                 (0x01UL << USB0_USBSTS_H_SRI_Pos)                       /*!< USB0 USBSTS_H: SRI Mask                 */
#define USB0_USBSTS_H_HCH_Pos                 12                                                      /*!< USB0 USBSTS_H: HCH Position             */
#define USB0_USBSTS_H_HCH_Msk                 (0x01UL << USB0_USBSTS_H_HCH_Pos)                       /*!< USB0 USBSTS_H: HCH Mask                 */
#define USB0_USBSTS_H_RCL_Pos                 13                                                      /*!< USB0 USBSTS_H: RCL Position             */
#define USB0_USBSTS_H_RCL_Msk                 (0x01UL << USB0_USBSTS_H_RCL_Pos)                       /*!< USB0 USBSTS_H: RCL Mask                 */
#define USB0_USBSTS_H_PS_Pos                  14                                                      /*!< USB0 USBSTS_H: PS Position              */
#define USB0_USBSTS_H_PS_Msk                  (0x01UL << USB0_USBSTS_H_PS_Pos)                        /*!< USB0 USBSTS_H: PS Mask                  */
#define USB0_USBSTS_H_AS_Pos                  15                                                      /*!< USB0 USBSTS_H: AS Position              */
#define USB0_USBSTS_H_AS_Msk                  (0x01UL << USB0_USBSTS_H_AS_Pos)                        /*!< USB0 USBSTS_H: AS Mask                  */
#define USB0_USBSTS_H_UAI_Pos                 18                                                      /*!< USB0 USBSTS_H: UAI Position             */
#define USB0_USBSTS_H_UAI_Msk                 (0x01UL << USB0_USBSTS_H_UAI_Pos)                       /*!< USB0 USBSTS_H: UAI Mask                 */
#define USB0_USBSTS_H_UPI_Pos                 19                                                      /*!< USB0 USBSTS_H: UPI Position             */
#define USB0_USBSTS_H_UPI_Msk                 (0x01UL << USB0_USBSTS_H_UPI_Pos)                       /*!< USB0 USBSTS_H: UPI Mask                 */

/* -------------------------------  USB0_USBINTR_D  ------------------------------- */
#define USB0_USBINTR_D_UE_Pos                 0                                                       /*!< USB0 USBINTR_D: UE Position             */
#define USB0_USBINTR_D_UE_Msk                 (0x01UL << USB0_USBINTR_D_UE_Pos)                       /*!< USB0 USBINTR_D: UE Mask                 */
#define USB0_USBINTR_D_UEE_Pos                1                                                       /*!< USB0 USBINTR_D: UEE Position            */
#define USB0_USBINTR_D_UEE_Msk                (0x01UL << USB0_USBINTR_D_UEE_Pos)                      /*!< USB0 USBINTR_D: UEE Mask                */
#define USB0_USBINTR_D_PCE_Pos                2                                                       /*!< USB0 USBINTR_D: PCE Position            */
#define USB0_USBINTR_D_PCE_Msk                (0x01UL << USB0_USBINTR_D_PCE_Pos)                      /*!< USB0 USBINTR_D: PCE Mask                */
#define USB0_USBINTR_D_URE_Pos                6                                                       /*!< USB0 USBINTR_D: URE Position            */
#define USB0_USBINTR_D_URE_Msk                (0x01UL << USB0_USBINTR_D_URE_Pos)                      /*!< USB0 USBINTR_D: URE Mask                */
#define USB0_USBINTR_D_SRE_Pos                7                                                       /*!< USB0 USBINTR_D: SRE Position            */
#define USB0_USBINTR_D_SRE_Msk                (0x01UL << USB0_USBINTR_D_SRE_Pos)                      /*!< USB0 USBINTR_D: SRE Mask                */
#define USB0_USBINTR_D_SLE_Pos                8                                                       /*!< USB0 USBINTR_D: SLE Position            */
#define USB0_USBINTR_D_SLE_Msk                (0x01UL << USB0_USBINTR_D_SLE_Pos)                      /*!< USB0 USBINTR_D: SLE Mask                */
#define USB0_USBINTR_D_NAKE_Pos               16                                                      /*!< USB0 USBINTR_D: NAKE Position           */
#define USB0_USBINTR_D_NAKE_Msk               (0x01UL << USB0_USBINTR_D_NAKE_Pos)                     /*!< USB0 USBINTR_D: NAKE Mask               */

