roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  USB0_ENDPTFLUSH  ------------------------------ */
#define USB0_ENDPTFLUSH_FERB0_Pos             0                                                       /*!< USB0 ENDPTFLUSH: FERB0 Position         */
#define USB0_ENDPTFLUSH_FERB0_Msk             (0x01UL << USB0_ENDPTFLUSH_FERB0_Pos)                   /*!< USB0 ENDPTFLUSH: FERB0 Mask             */
#define USB0_ENDPTFLUSH_FERB1_Pos             1                                                       /*!< USB0 ENDPTFLUSH: FERB1 Position         */
#define USB0_ENDPTFLUSH_FERB1_Msk             (0x01UL << USB0_ENDPTFLUSH_FERB1_Pos)                   /*!< USB0 ENDPTFLUSH: FERB1 Mask             */
#define USB0_ENDPTFLUSH_FERB2_Pos             2                                                       /*!< USB0 ENDPTFLUSH: FERB2 Position         */
#define USB0_ENDPTFLUSH_FERB2_Msk             (0x01UL << USB0_ENDPTFLUSH_FERB2_Pos)                   /*!< USB0 ENDPTFLUSH: FERB2 Mask             */
#define USB0_ENDPTFLUSH_FERB3_Pos             3                                                       /*!< USB0 ENDPTFLUSH: FERB3 Position         */
#define USB0_ENDPTFLUSH_FERB3_Msk             (0x01UL << USB0_ENDPTFLUSH_FERB3_Pos)                   /*!< USB0 ENDPTFLUSH: FERB3 Mask             */
#define USB0_ENDPTFLUSH_FERB4_Pos             4                                                       /*!< USB0 ENDPTFLUSH: FERB4 Position         */
#define USB0_ENDPTFLUSH_FERB4_Msk             (0x01UL << USB0_ENDPTFLUSH_FERB4_Pos)                   /*!< USB0 ENDPTFLUSH: FERB4 Mask             */
#define USB0_ENDPTFLUSH_FERB5_Pos             5                                                       /*!< USB0 ENDPTFLUSH: FERB5 Position         */
#define USB0_ENDPTFLUSH_FERB5_Msk             (0x01UL << USB0_ENDPTFLUSH_FERB5_Pos)                   /*!< USB0 ENDPTFLUSH: FERB5 Mask             */
#define USB0_ENDPTFLUSH_FETB0_Pos             16                                                      /*!< USB0 ENDPTFLUSH: FETB0 Position         */
#define USB0_ENDPTFLUSH_FETB0_Msk             (0x01UL << USB0_ENDPTFLUSH_FETB0_Pos)                   /*!< USB0 ENDPTFLUSH: FETB0 Mask             */
#define USB0_ENDPTFLUSH_FETB1_Pos             17                                                      /*!< USB0 ENDPTFLUSH: FETB1 Position         */
#define USB0_ENDPTFLUSH_FETB1_Msk             (0x01UL << USB0_ENDPTFLUSH_FETB1_Pos)                   /*!< USB0 ENDPTFLUSH: FETB1 Mask             */
#define USB0_ENDPTFLUSH_FETB2_Pos             18                                                      /*!< USB0 ENDPTFLUSH: FETB2 Position         */
#define USB0_ENDPTFLUSH_FETB2_Msk             (0x01UL << USB0_ENDPTFLUSH_FETB2_Pos)                   /*!< USB0 ENDPTFLUSH: FETB2 Mask             */
#define USB0_ENDPTFLUSH_FETB3_Pos             19                                                      /*!< USB0 ENDPTFLUSH: FETB3 Position         */
#define USB0_ENDPTFLUSH_FETB3_Msk             (0x01UL << USB0_ENDPTFLUSH_FETB3_Pos)                   /*!< USB0 ENDPTFLUSH: FETB3 Mask             */
#define USB0_ENDPTFLUSH_FETB4_Pos             20                                                      /*!< USB0 ENDPTFLUSH: FETB4 Position         */
#define USB0_ENDPTFLUSH_FETB4_Msk             (0x01UL << USB0_ENDPTFLUSH_FETB4_Pos)                   /*!< USB0 ENDPTFLUSH: FETB4 Mask             */
#define USB0_ENDPTFLUSH_FETB5_Pos             21                                                      /*!< USB0 ENDPTFLUSH: FETB5 Position         */
#define USB0_ENDPTFLUSH_FETB5_Msk             (0x01UL << USB0_ENDPTFLUSH_FETB5_Pos)                   /*!< USB0 ENDPTFLUSH: FETB5 Mask             */

/* -------------------------------  USB0_ENDPTSTAT  ------------------------------- */
#define USB0_ENDPTSTAT_ERBR0_Pos              0                                                       /*!< USB0 ENDPTSTAT: ERBR0 Position          */
#define USB0_ENDPTSTAT_ERBR0_Msk              (0x01UL << USB0_ENDPTSTAT_ERBR0_Pos)                    /*!< USB0 ENDPTSTAT: ERBR0 Mask              */
#define USB0_ENDPTSTAT_ERBR1_Pos              1                                                       /*!< USB0 ENDPTSTAT: ERBR1 Position          */
#define USB0_ENDPTSTAT_ERBR1_Msk              (0x01UL << USB0_ENDPTSTAT_ERBR1_Pos)                    /*!< USB0 ENDPTSTAT: ERBR1 Mask              */
#define USB0_ENDPTSTAT_ERBR2_Pos              2                                                       /*!< USB0 ENDPTSTAT: ERBR2 Position          */
#define USB0_ENDPTSTAT_ERBR2_Msk              (0x01UL << USB0_ENDPTSTAT_ERBR2_Pos)                    /*!< USB0 ENDPTSTAT: ERBR2 Mask              */
#define USB0_ENDPTSTAT_ERBR3_Pos              3                                                       /*!< USB0 ENDPTSTAT: ERBR3 Position          */
#define USB0_ENDPTSTAT_ERBR3_Msk              (0x01UL << USB0_ENDPTSTAT_ERBR3_Pos)                    /*!< USB0 ENDPTSTAT: ERBR3 Mask              */
#define USB0_ENDPTSTAT_ERBR4_Pos              4                                                       /*!< USB0 ENDPTSTAT: ERBR4 Position          */
#define USB0_ENDPTSTAT_ERBR4_Msk              (0x01UL << USB0_ENDPTSTAT_ERBR4_Pos)                    /*!< USB0 ENDPTSTAT: ERBR4 Mask              */
#define USB0_ENDPTSTAT_ERBR5_Pos              5                                                       /*!< USB0 ENDPTSTAT: ERBR5 Position          */
#define USB0_ENDPTSTAT_ERBR5_Msk              (0x01UL << USB0_ENDPTSTAT_ERBR5_Pos)                    /*!< USB0 ENDPTSTAT: ERBR5 Mask              */
#define USB0_ENDPTSTAT_ETBR0_Pos              16                                                      /*!< USB0 ENDPTSTAT: ETBR0 Position          */
#define USB0_ENDPTSTAT_ETBR0_Msk              (0x01UL << USB0_ENDPTSTAT_ETBR0_Pos)                    /*!< USB0 ENDPTSTAT: ETBR0 Mask              */
#define USB0_ENDPTSTAT_ETBR1_Pos              17                                                      /*!< USB0 ENDPTSTAT: ETBR1 Position          */
#define USB0_ENDPTSTAT_ETBR1_Msk              (0x01UL << USB0_ENDPTSTAT_ETBR1_Pos)                    /*!< USB0 ENDPTSTAT: ETBR1 Mask              */
#define USB0_ENDPTSTAT_ETBR2_Pos              18                                                      /*!< USB0 ENDPTSTAT: ETBR2 Position          */
#define USB0_ENDPTSTAT_ETBR2_Msk              (0x01UL << USB0_ENDPTSTAT_ETBR2_Pos)                    /*!< USB0 ENDPTSTAT: ETBR2 Mask              */
#define USB0_ENDPTSTAT_ETBR3_Pos              19                                                      /*!< USB0 ENDPTSTAT: ETBR3 Position          */
#define USB0_ENDPTSTAT_ETBR3_Msk              (0x01UL << USB0_ENDPTSTAT_ETBR3_Pos)                    /*!< USB0 ENDPTSTAT: ETBR3 Mask              */
#define USB0_ENDPTSTAT_ETBR4_Pos              20                                                      /*!< USB0 ENDPTSTAT: ETBR4 Position          */
#define USB0_ENDPTSTAT_ETBR4_Msk              (0x01UL << USB0_ENDPTSTAT_ETBR4_Pos)                    /*!< USB0 ENDPTSTAT: ETBR4 Mask              */
#define USB0_ENDPTSTAT_ETBR5_Pos              21                                                      /*!< USB0 ENDPTSTAT: ETBR5 Position          */
#define USB0_ENDPTSTAT_ETBR5_Msk              (0x01UL << USB0_ENDPTSTAT_ETBR5_Pos)                    /*!< USB0 ENDPTSTAT: ETBR5 Mask              */

/* -----------------------------  USB0_ENDPTCOMPLETE  ----------------------------- */
#define USB0_ENDPTCOMPLETE_ERCE0_Pos          0                                                       /*!< USB0 ENDPTCOMPLETE: ERCE0 Position      */
#define USB0_ENDPTCOMPLETE_ERCE0_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ERCE0_Pos)                /*!< USB0 ENDPTCOMPLETE: ERCE0 Mask          */
#define USB0_ENDPTCOMPLETE_ERCE1_Pos          1                                                       /*!< USB0 ENDPTCOMPLETE: ERCE1 Position      */
#define USB0_ENDPTCOMPLETE_ERCE1_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ERCE1_Pos)                /*!< USB0 ENDPTCOMPLETE: ERCE1 Mask          */
#define USB0_ENDPTCOMPLETE_ERCE2_Pos          2                                                       /*!< USB0 ENDPTCOMPLETE: ERCE2 Position      */
#define USB0_ENDPTCOMPLETE_ERCE2_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ERCE2_Pos)                /*!< USB0 ENDPTCOMPLETE: ERCE2 Mask          */
#define USB0_ENDPTCOMPLETE_ERCE3_Pos          3                                                       /*!< USB0 ENDPTCOMPLETE: ERCE3 Position      */
#define USB0_ENDPTCOMPLETE_ERCE3_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ERCE3_Pos)                /*!< USB0 ENDPTCOMPLETE: ERCE3 Mask          */
#define USB0_ENDPTCOMPLETE_ERCE4_Pos          4                                                       /*!< USB0 ENDPTCOMPLETE: ERCE4 Position      */
#define USB0_ENDPTCOMPLETE_ERCE4_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ERCE4_Pos)                /*!< USB0 ENDPTCOMPLETE: ERCE4 Mask          */
#define USB0_ENDPTCOMPLETE_ERCE5_Pos          5                                                       /*!< USB0 ENDPTCOMPLETE: ERCE5 Position      */
#define USB0_ENDPTCOMPLETE_ERCE5_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ERCE5_Pos)                /*!< USB0 ENDPTCOMPLETE: ERCE5 Mask          */
#define USB0_ENDPTCOMPLETE_ETCE0_Pos          16                                                      /*!< USB0 ENDPTCOMPLETE: ETCE0 Position      */
#define USB0_ENDPTCOMPLETE_ETCE0_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ETCE0_Pos)                /*!< USB0 ENDPTCOMPLETE: ETCE0 Mask          */
#define USB0_ENDPTCOMPLETE_ETCE1_Pos          17                                                      /*!< USB0 ENDPTCOMPLETE: ETCE1 Position      */
#define USB0_ENDPTCOMPLETE_ETCE1_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ETCE1_Pos)                /*!< USB0 ENDPTCOMPLETE: ETCE1 Mask          */
#define USB0_ENDPTCOMPLETE_ETCE2_Pos          18                                                      /*!< USB0 ENDPTCOMPLETE: ETCE2 Position      */
#define USB0_ENDPTCOMPLETE_ETCE2_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ETCE2_Pos)                /*!< USB0 ENDPTCOMPLETE: ETCE2 Mask          */
#define USB0_ENDPTCOMPLETE_ETCE3_Pos          19                                                      /*!< USB0 ENDPTCOMPLETE: ETCE3 Position      */
#define USB0_ENDPTCOMPLETE_ETCE3_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ETCE3_Pos)                /*!< USB0 ENDPTCOMPLETE: ETCE3 Mask          */
#define USB0_ENDPTCOMPLETE_ETCE4_Pos          20                                                      /*!< USB0 ENDPTCOMPLETE: ETCE4 Position      */
#define USB0_ENDPTCOMPLETE_ETCE4_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ETCE4_Pos)                /*!< USB0 ENDPTCOMPLETE: ETCE4 Mask          */
#define USB0_ENDPTCOMPLETE_ETCE5_Pos          21                                                      /*!< USB0 ENDPTCOMPLETE: ETCE5 Position      */
#define USB0_ENDPTCOMPLETE_ETCE5_Msk          (0x01UL << USB0_ENDPTCOMPLETE_ETCE5_Pos)                /*!< USB0 ENDPTCOMPLETE: ETCE5 Mask          */

