roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  USB1_CAPLENGTH  ------------------------------- */
#define USB1_CAPLENGTH_CAPLENGTH_Pos          0                                                       /*!< USB1 CAPLENGTH: CAPLENGTH Position      */
#define USB1_CAPLENGTH_CAPLENGTH_Msk          (0x000000ffUL << USB1_CAPLENGTH_CAPLENGTH_Pos)          /*!< USB1 CAPLENGTH: CAPLENGTH Mask          */
#define USB1_CAPLENGTH_HCIVERSION_Pos         8                                                       /*!< USB1 CAPLENGTH: HCIVERSION Position     */
#define USB1_CAPLENGTH_HCIVERSION_Msk         (0x0000ffffUL << USB1_CAPLENGTH_HCIVERSION_Pos)         /*!< USB1 CAPLENGTH: HCIVERSION Mask         */

/* -------------------------------  USB1_HCSPARAMS  ------------------------------- */
#define USB1_HCSPARAMS_N_PORTS_Pos            0                                                       /*!< USB1 HCSPARAMS: N_PORTS Position        */
#define USB1_HCSPARAMS_N_PORTS_Msk            (0x0fUL << USB1_HCSPARAMS_N_PORTS_Pos)                  /*!< USB1 HCSPARAMS: N_PORTS Mask            */
#define USB1_HCSPARAMS_PPC_Pos                4                                                       /*!< USB1 HCSPARAMS: PPC Position            */
#define USB1_HCSPARAMS_PPC_Msk                (0x01UL << USB1_HCSPARAMS_PPC_Pos)                      /*!< USB1 HCSPARAMS: PPC Mask                */
#define USB1_HCSPARAMS_N_PCC_Pos              8                                                       /*!< USB1 HCSPARAMS: N_PCC Position          */
#define USB1_HCSPARAMS_N_PCC_Msk              (0x0fUL << USB1_HCSPARAMS_N_PCC_Pos)                    /*!< USB1 HCSPARAMS: N_PCC Mask              */
#define USB1_HCSPARAMS_N_CC_Pos               12                                                      /*!< USB1 HCSPARAMS: N_CC Position           */
#define USB1_HCSPARAMS_N_CC_Msk               (0x0fUL << USB1_HCSPARAMS_N_CC_Pos)                     /*!< USB1 HCSPARAMS: N_CC Mask               */
#define USB1_HCSPARAMS_PI_Pos                 16                                                      /*!< USB1 HCSPARAMS: PI Position             */
#define USB1_HCSPARAMS_PI_Msk                 (0x01UL << USB1_HCSPARAMS_PI_Pos)                       /*!< USB1 HCSPARAMS: PI Mask                 */
#define USB1_HCSPARAMS_N_PTT_Pos              20                                                      /*!< USB1 HCSPARAMS: N_PTT Position          */
#define USB1_HCSPARAMS_N_PTT_Msk              (0x0fUL << USB1_HCSPARAMS_N_PTT_Pos)                    /*!< USB1 HCSPARAMS: N_PTT Mask              */
#define USB1_HCSPARAMS_N_TT_Pos               24                                                      /*!< USB1 HCSPARAMS: N_TT Position           */
#define USB1_HCSPARAMS_N_TT_Msk               (0x0fUL << USB1_HCSPARAMS_N_TT_Pos)                     /*!< USB1 HCSPARAMS: N_TT Mask               */

/* -------------------------------  USB1_HCCPARAMS  ------------------------------- */
#define USB1_HCCPARAMS_ADC_Pos                0                                                       /*!< USB1 HCCPARAMS: ADC Position            */
#define USB1_HCCPARAMS_ADC_Msk                (0x01UL << USB1_HCCPARAMS_ADC_Pos)                      /*!< USB1 HCCPARAMS: ADC Mask                */
#define USB1_HCCPARAMS_PFL_Pos                1                                                       /*!< USB1 HCCPARAMS: PFL Position            */
#define USB1_HCCPARAMS_PFL_Msk                (0x01UL << USB1_HCCPARAMS_PFL_Pos)                      /*!< USB1 HCCPARAMS: PFL Mask                */
#define USB1_HCCPARAMS_ASP_Pos                2                                                       /*!< USB1 HCCPARAMS: ASP Position            */
#define USB1_HCCPARAMS_ASP_Msk                (0x01UL << USB1_HCCPARAMS_ASP_Pos)                      /*!< USB1 HCCPARAMS: ASP Mask                */
#define USB1_HCCPARAMS_IST_Pos                4                                                       /*!< USB1 HCCPARAMS: IST Position            */
#define USB1_HCCPARAMS_IST_Msk                (0x0fUL << USB1_HCCPARAMS_IST_Pos)                      /*!< USB1 HCCPARAMS: IST Mask                */
#define USB1_HCCPARAMS_EECP_Pos               8                                                       /*!< USB1 HCCPARAMS: EECP Position           */
#define USB1_HCCPARAMS_EECP_Msk               (0x000000ffUL << USB1_HCCPARAMS_EECP_Pos)               /*!< USB1 HCCPARAMS: EECP Mask               */

/* -------------------------------  USB1_DCIVERSION  ------------------------------ */
#define USB1_DCIVERSION_DCIVERSION_Pos        0                                                       /*!< USB1 DCIVERSION: DCIVERSION Position    */
#define USB1_DCIVERSION_DCIVERSION_Msk        (0x0000ffffUL << USB1_DCIVERSION_DCIVERSION_Pos)        /*!< USB1 DCIVERSION: DCIVERSION Mask        */

/* --------------------------------  USB1_USBCMD_D  ------------------------------- */
#define USB1_USBCMD_D_RS_Pos                  0                                                       /*!< USB1 USBCMD_D: RS Position              */
#define USB1_USBCMD_D_RS_Msk                  (0x01UL << USB1_USBCMD_D_RS_Pos)                        /*!< USB1 USBCMD_D: RS Mask                  */
#define USB1_USBCMD_D_RST_Pos                 1                                                       /*!< USB1 USBCMD_D: RST Position             */
#define USB1_USBCMD_D_RST_Msk                 (0x01UL << USB1_USBCMD_D_RST_Pos)                       /*!< USB1 USBCMD_D: RST Mask                 */
#define USB1_USBCMD_D_SUTW_Pos                13                                                      /*!< USB1 USBCMD_D: SUTW Position            */
#define USB1_USBCMD_D_SUTW_Msk                (0x01UL << USB1_USBCMD_D_SUTW_Pos)                      /*!< USB1 USBCMD_D: SUTW Mask                */
#define USB1_USBCMD_D_ATDTW_Pos               14                                                      /*!< USB1 USBCMD_D: ATDTW Position           */
#define USB1_USBCMD_D_ATDTW_Msk               (0x01UL << USB1_USBCMD_D_ATDTW_Pos)                     /*!< USB1 USBCMD_D: ATDTW Mask               */
#define USB1_USBCMD_D_FS2_Pos                 15                                                      /*!< USB1 USBCMD_D: FS2 Position             */
#define USB1_USBCMD_D_FS2_Msk                 (0x01UL << USB1_USBCMD_D_FS2_Pos)                       /*!< USB1 USBCMD_D: FS2 Mask                 */
#define USB1_USBCMD_D_ITC_Pos                 16                                                      /*!< USB1 USBCMD_D: ITC Position             */
#define USB1_USBCMD_D_ITC_Msk                 (0x000000ffUL << USB1_USBCMD_D_ITC_Pos)                 /*!< USB1 USBCMD_D: ITC Mask                 */

