roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  USB1_USBMODE_D  ------------------------------- */
#define USB1_USBMODE_D_CM1_0_Pos              0                                                       /*!< USB1 USBMODE_D: CM1_0 Position          */
#define USB1_USBMODE_D_CM1_0_Msk              (0x03UL << USB1_USBMODE_D_CM1_0_Pos)                    /*!< USB1 USBMODE_D: CM1_0 Mask              */
#define USB1_USBMODE_D_ES_Pos                 2                                                       /*!< USB1 USBMODE_D: ES Position             */
#define USB1_USBMODE_D_ES_Msk                 (0x01UL << USB1_USBMODE_D_ES_Pos)                       /*!< USB1 USBMODE_D: ES Mask                 */
#define USB1_USBMODE_D_SLOM_Pos               3                                                       /*!< USB1 USBMODE_D: SLOM Position           */
#define USB1_USBMODE_D_SLOM_Msk               (0x01UL << USB1_USBMODE_D_SLOM_Pos)                     /*!< USB1 USBMODE_D: SLOM Mask               */
#define USB1_USBMODE_D_SDIS_Pos               4                                                       /*!< USB1 USBMODE_D: SDIS Position           */
#define USB1_USBMODE_D_SDIS_Msk               (0x01UL << USB1_USBMODE_D_SDIS_Pos)                     /*!< USB1 USBMODE_D: SDIS Mask               */

/* -------------------------------  USB1_USBMODE_H  ------------------------------- */
#define USB1_USBMODE_H_CM1_0_Pos              0                                                       /*!< USB1 USBMODE_H: CM1_0 Position          */
#define USB1_USBMODE_H_CM1_0_Msk              (0x03UL << USB1_USBMODE_H_CM1_0_Pos)                    /*!< USB1 USBMODE_H: CM1_0 Mask              */
#define USB1_USBMODE_H_ES_Pos                 2                                                       /*!< USB1 USBMODE_H: ES Position             */
#define USB1_USBMODE_H_ES_Msk                 (0x01UL << USB1_USBMODE_H_ES_Pos)                       /*!< USB1 USBMODE_H: ES Mask                 */
#define USB1_USBMODE_H_SDIS_Pos               4                                                       /*!< USB1 USBMODE_H: SDIS Position           */
#define USB1_USBMODE_H_SDIS_Msk               (0x01UL << USB1_USBMODE_H_SDIS_Pos)                     /*!< USB1 USBMODE_H: SDIS Mask               */
#define USB1_USBMODE_H_VBPS_Pos               5                                                       /*!< USB1 USBMODE_H: VBPS Position           */
#define USB1_USBMODE_H_VBPS_Msk               (0x01UL << USB1_USBMODE_H_VBPS_Pos)                     /*!< USB1 USBMODE_H: VBPS Mask               */

/* -----------------------------  USB1_ENDPTSETUPSTAT  ---------------------------- */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT0_Pos 0                                                     /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT0 Position */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT0_Msk (0x01UL << USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT0_Pos)   /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT0 Mask */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT1_Pos 1                                                     /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT1 Position */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT1_Msk (0x01UL << USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT1_Pos)   /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT1 Mask */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT2_Pos 2                                                     /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT2 Position */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT2_Msk (0x01UL << USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT2_Pos)   /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT2 Mask */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT3_Pos 3                                                     /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT3 Position */
#define USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT3_Msk (0x01UL << USB1_ENDPTSETUPSTAT_ENDPTSETUPSTAT3_Pos)   /*!< USB1 ENDPTSETUPSTAT: ENDPTSETUPSTAT3 Mask */

/* -------------------------------  USB1_ENDPTPRIME  ------------------------------ */
#define USB1_ENDPTPRIME_PERB0_Pos             0                                                       /*!< USB1 ENDPTPRIME: PERB0 Position         */
#define USB1_ENDPTPRIME_PERB0_Msk             (0x01UL << USB1_ENDPTPRIME_PERB0_Pos)                   /*!< USB1 ENDPTPRIME: PERB0 Mask             */
#define USB1_ENDPTPRIME_PERB1_Pos             1                                                       /*!< USB1 ENDPTPRIME: PERB1 Position         */
#define USB1_ENDPTPRIME_PERB1_Msk             (0x01UL << USB1_ENDPTPRIME_PERB1_Pos)                   /*!< USB1 ENDPTPRIME: PERB1 Mask             */
#define USB1_ENDPTPRIME_PERB2_Pos             2                                                       /*!< USB1 ENDPTPRIME: PERB2 Position         */
#define USB1_ENDPTPRIME_PERB2_Msk             (0x01UL << USB1_ENDPTPRIME_PERB2_Pos)                   /*!< USB1 ENDPTPRIME: PERB2 Mask             */
#define USB1_ENDPTPRIME_PERB3_Pos             3                                                       /*!< USB1 ENDPTPRIME: PERB3 Position         */
#define USB1_ENDPTPRIME_PERB3_Msk             (0x01UL << USB1_ENDPTPRIME_PERB3_Pos)                   /*!< USB1 ENDPTPRIME: PERB3 Mask             */
#define USB1_ENDPTPRIME_PETB0_Pos             16                                                      /*!< USB1 ENDPTPRIME: PETB0 Position         */
#define USB1_ENDPTPRIME_PETB0_Msk             (0x01UL << USB1_ENDPTPRIME_PETB0_Pos)                   /*!< USB1 ENDPTPRIME: PETB0 Mask             */
#define USB1_ENDPTPRIME_PETB1_Pos             17                                                      /*!< USB1 ENDPTPRIME: PETB1 Position         */
#define USB1_ENDPTPRIME_PETB1_Msk             (0x01UL << USB1_ENDPTPRIME_PETB1_Pos)                   /*!< USB1 ENDPTPRIME: PETB1 Mask             */
#define USB1_ENDPTPRIME_PETB2_Pos             18                                                      /*!< USB1 ENDPTPRIME: PETB2 Position         */
#define USB1_ENDPTPRIME_PETB2_Msk             (0x01UL << USB1_ENDPTPRIME_PETB2_Pos)                   /*!< USB1 ENDPTPRIME: PETB2 Mask             */
#define USB1_ENDPTPRIME_PETB3_Pos             19                                                      /*!< USB1 ENDPTPRIME: PETB3 Position         */
#define USB1_ENDPTPRIME_PETB3_Msk             (0x01UL << USB1_ENDPTPRIME_PETB3_Pos)                   /*!< USB1 ENDPTPRIME: PETB3 Mask             */

/* -------------------------------  USB1_ENDPTFLUSH  ------------------------------ */
#define USB1_ENDPTFLUSH_FERB0_Pos             0                                                       /*!< USB1 ENDPTFLUSH: FERB0 Position         */
#define USB1_ENDPTFLUSH_FERB0_Msk             (0x01UL << USB1_ENDPTFLUSH_FERB0_Pos)                   /*!< USB1 ENDPTFLUSH: FERB0 Mask             */
#define USB1_ENDPTFLUSH_FERB1_Pos             1                                                       /*!< USB1 ENDPTFLUSH: FERB1 Position         */
#define USB1_ENDPTFLUSH_FERB1_Msk             (0x01UL << USB1_ENDPTFLUSH_FERB1_Pos)                   /*!< USB1 ENDPTFLUSH: FERB1 Mask             */
#define USB1_ENDPTFLUSH_FERB2_Pos             2                                                       /*!< USB1 ENDPTFLUSH: FERB2 Position         */
#define USB1_ENDPTFLUSH_FERB2_Msk             (0x01UL << USB1_ENDPTFLUSH_FERB2_Pos)                   /*!< USB1 ENDPTFLUSH: FERB2 Mask             */
#define USB1_ENDPTFLUSH_FERB3_Pos             3                                                       /*!< USB1 ENDPTFLUSH: FERB3 Position         */
#define USB1_ENDPTFLUSH_FERB3_Msk             (0x01UL << USB1_ENDPTFLUSH_FERB3_Pos)                   /*!< USB1 ENDPTFLUSH: FERB3 Mask             */
#define USB1_ENDPTFLUSH_FETB0_Pos             16                                                      /*!< USB1 ENDPTFLUSH: FETB0 Position         */
#define USB1_ENDPTFLUSH_FETB0_Msk             (0x01UL << USB1_ENDPTFLUSH_FETB0_Pos)                   /*!< USB1 ENDPTFLUSH: FETB0 Mask             */
#define USB1_ENDPTFLUSH_FETB1_Pos             17                                                      /*!< USB1 ENDPTFLUSH: FETB1 Position         */
#define USB1_ENDPTFLUSH_FETB1_Msk             (0x01UL << USB1_ENDPTFLUSH_FETB1_Pos)                   /*!< USB1 ENDPTFLUSH: FETB1 Mask             */
#define USB1_ENDPTFLUSH_FETB2_Pos             18                                                      /*!< USB1 ENDPTFLUSH: FETB2 Position         */
#define USB1_ENDPTFLUSH_FETB2_Msk             (0x01UL << USB1_ENDPTFLUSH_FETB2_Pos)                   /*!< USB1 ENDPTFLUSH: FETB2 Mask             */
#define USB1_ENDPTFLUSH_FETB3_Pos             19                                                      /*!< USB1 ENDPTFLUSH: FETB3 Position         */
#define USB1_ENDPTFLUSH_FETB3_Msk             (0x01UL << USB1_ENDPTFLUSH_FETB3_Pos)                   /*!< USB1 ENDPTFLUSH: FETB3 Mask             */

/* -------------------------------  USB1_ENDPTSTAT  ------------------------------- */
#define USB1_ENDPTSTAT_ERBR0_Pos              0                                                       /*!< USB1 ENDPTSTAT: ERBR0 Position          */
#define USB1_ENDPTSTAT_ERBR0_Msk              (0x01UL << USB1_ENDPTSTAT_ERBR0_Pos)                    /*!< USB1 ENDPTSTAT: ERBR0 Mask              */
#define USB1_ENDPTSTAT_ERBR1_Pos              1                                                       /*!< USB1 ENDPTSTAT: ERBR1 Position          */
#define USB1_ENDPTSTAT_ERBR1_Msk              (0x01UL << USB1_ENDPTSTAT_ERBR1_Pos)                    /*!< USB1 ENDPTSTAT: ERBR1 Mask              */
#define USB1_ENDPTSTAT_ERBR2_Pos              2                                                       /*!< USB1 ENDPTSTAT: ERBR2 Position          */
#define USB1_ENDPTSTAT_ERBR2_Msk              (0x01UL << USB1_ENDPTSTAT_ERBR2_Pos)                    /*!< USB1 ENDPTSTAT: ERBR2 Mask              */
#define USB1_ENDPTSTAT_ERBR3_Pos              3                                                       /*!< USB1 ENDPTSTAT: ERBR3 Position          */
#define USB1_ENDPTSTAT_ERBR3_Msk              (0x01UL << USB1_ENDPTSTAT_ERBR3_Pos)                    /*!< USB1 ENDPTSTAT: ERBR3 Mask              */
#define USB1_ENDPTSTAT_ETBR0_Pos              16                                                      /*!< USB1 ENDPTSTAT: ETBR0 Position          */
#define USB1_ENDPTSTAT_ETBR0_Msk              (0x01UL << USB1_ENDPTSTAT_ETBR0_Pos)                    /*!< USB1 ENDPTSTAT: ETBR0 Mask              */
#define USB1_ENDPTSTAT_ETBR1_Pos              17                                                      /*!< USB1 ENDPTSTAT: ETBR1 Position          */
#define USB1_ENDPTSTAT_ETBR1_Msk              (0x01UL << USB1_ENDPTSTAT_ETBR1_Pos)                    /*!< USB1 ENDPTSTAT: ETBR1 Mask              */
#define USB1_ENDPTSTAT_ETBR2_Pos              18                                                      /*!< USB1 ENDPTSTAT: ETBR2 Position          */
#define USB1_ENDPTSTAT_ETBR2_Msk              (0x01UL << USB1_ENDPTSTAT_ETBR2_Pos)                    /*!< USB1 ENDPTSTAT: ETBR2 Mask              */
#define USB1_ENDPTSTAT_ETBR3_Pos              19                                                      /*!< USB1 ENDPTSTAT: ETBR3 Position          */
#define USB1_ENDPTSTAT_ETBR3_Msk              (0x01UL << USB1_ENDPTSTAT_ETBR3_Pos)                    /*!< USB1 ENDPTSTAT: ETBR3 Mask              */

