roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  LCD_CRSR_INTMSK  ------------------------------ */
#define LCD_CRSR_INTMSK_CRSRIM_Pos            0                                                       /*!< LCD CRSR_INTMSK: CRSRIM Position        */
#define LCD_CRSR_INTMSK_CRSRIM_Msk            (0x01UL << LCD_CRSR_INTMSK_CRSRIM_Pos)                  /*!< LCD CRSR_INTMSK: CRSRIM Mask            */

/* -------------------------------  LCD_CRSR_INTCLR  ------------------------------ */
#define LCD_CRSR_INTCLR_CRSRIC_Pos            0                                                       /*!< LCD CRSR_INTCLR: CRSRIC Position        */
#define LCD_CRSR_INTCLR_CRSRIC_Msk            (0x01UL << LCD_CRSR_INTCLR_CRSRIC_Pos)                  /*!< LCD CRSR_INTCLR: CRSRIC Mask            */

/* -------------------------------  LCD_CRSR_INTRAW  ------------------------------ */
#define LCD_CRSR_INTRAW_CRSRRIS_Pos           0                                                       /*!< LCD CRSR_INTRAW: CRSRRIS Position       */
#define LCD_CRSR_INTRAW_CRSRRIS_Msk           (0x01UL << LCD_CRSR_INTRAW_CRSRRIS_Pos)                 /*!< LCD CRSR_INTRAW: CRSRRIS Mask           */

/* ------------------------------  LCD_CRSR_INTSTAT  ------------------------------ */
#define LCD_CRSR_INTSTAT_CRSRMIS_Pos          0                                                       /*!< LCD CRSR_INTSTAT: CRSRMIS Position      */
#define LCD_CRSR_INTSTAT_CRSRMIS_Msk          (0x01UL << LCD_CRSR_INTSTAT_CRSRMIS_Pos)                /*!< LCD CRSR_INTSTAT: CRSRMIS Mask          */


/* ================================================================================ */
/* ================         struct 'EEPROM' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  EEPROM_CMD  --------------------------------- */
#define EEPROM_CMD_CMD_Pos                    0                                                       /*!< EEPROM CMD: CMD Position                */
#define EEPROM_CMD_CMD_Msk                    (0x07UL << EEPROM_CMD_CMD_Pos)                          /*!< EEPROM CMD: CMD Mask                    */

/* -------------------------------  EEPROM_RWSTATE  ------------------------------- */
#define EEPROM_RWSTATE_RPHASE2_Pos            0                                                       /*!< EEPROM RWSTATE: RPHASE2 Position        */
#define EEPROM_RWSTATE_RPHASE2_Msk            (0x000000ffUL << EEPROM_RWSTATE_RPHASE2_Pos)            /*!< EEPROM RWSTATE: RPHASE2 Mask            */
#define EEPROM_RWSTATE_RPHASE1_Pos            8                                                       /*!< EEPROM RWSTATE: RPHASE1 Position        */
#define EEPROM_RWSTATE_RPHASE1_Msk            (0x000000ffUL << EEPROM_RWSTATE_RPHASE1_Pos)            /*!< EEPROM RWSTATE: RPHASE1 Mask            */

/* -------------------------------  EEPROM_AUTOPROG  ------------------------------ */
#define EEPROM_AUTOPROG_AUTOPROG_Pos          0                                                       /*!< EEPROM AUTOPROG: AUTOPROG Position      */
#define EEPROM_AUTOPROG_AUTOPROG_Msk          (0x03UL << EEPROM_AUTOPROG_AUTOPROG_Pos)                /*!< EEPROM AUTOPROG: AUTOPROG Mask          */

/* --------------------------------  EEPROM_WSTATE  ------------------------------- */
#define EEPROM_WSTATE_PHASE3_Pos              0                                                       /*!< EEPROM WSTATE: PHASE3 Position          */
#define EEPROM_WSTATE_PHASE3_Msk              (0x000000ffUL << EEPROM_WSTATE_PHASE3_Pos)              /*!< EEPROM WSTATE: PHASE3 Mask              */
#define EEPROM_WSTATE_PHASE2_Pos              8                                                       /*!< EEPROM WSTATE: PHASE2 Position          */
#define EEPROM_WSTATE_PHASE2_Msk              (0x000000ffUL << EEPROM_WSTATE_PHASE2_Pos)              /*!< EEPROM WSTATE: PHASE2 Mask              */
#define EEPROM_WSTATE_PHASE1_Pos              16                                                      /*!< EEPROM WSTATE: PHASE1 Position          */
#define EEPROM_WSTATE_PHASE1_Msk              (0x000000ffUL << EEPROM_WSTATE_PHASE1_Pos)              /*!< EEPROM WSTATE: PHASE1 Mask              */
#define EEPROM_WSTATE_LCK_PARWEP_Pos          31                                                      /*!< EEPROM WSTATE: LCK_PARWEP Position      */
#define EEPROM_WSTATE_LCK_PARWEP_Msk          (0x01UL << EEPROM_WSTATE_LCK_PARWEP_Pos)                /*!< EEPROM WSTATE: LCK_PARWEP Mask          */

/* --------------------------------  EEPROM_CLKDIV  ------------------------------- */
#define EEPROM_CLKDIV_CLKDIV_Pos              0                                                       /*!< EEPROM CLKDIV: CLKDIV Position          */
#define EEPROM_CLKDIV_CLKDIV_Msk              (0x0000ffffUL << EEPROM_CLKDIV_CLKDIV_Pos)              /*!< EEPROM CLKDIV: CLKDIV Mask              */

/* --------------------------------  EEPROM_PWRDWN  ------------------------------- */
#define EEPROM_PWRDWN_PWRDWN_Pos              0                                                       /*!< EEPROM PWRDWN: PWRDWN Position          */
#define EEPROM_PWRDWN_PWRDWN_Msk              (0x01UL << EEPROM_PWRDWN_PWRDWN_Pos)                    /*!< EEPROM PWRDWN: PWRDWN Mask              */

/* -------------------------------  EEPROM_INTENCLR  ------------------------------ */
#define EEPROM_INTENCLR_PROG_CLR_EN_Pos       2                                                       /*!< EEPROM INTENCLR: PROG_CLR_EN Position   */
#define EEPROM_INTENCLR_PROG_CLR_EN_Msk       (0x01UL << EEPROM_INTENCLR_PROG_CLR_EN_Pos)             /*!< EEPROM INTENCLR: PROG_CLR_EN Mask       */

/* -------------------------------  EEPROM_INTENSET  ------------------------------ */
#define EEPROM_INTENSET_PROG_SET_EN_Pos       2                                                       /*!< EEPROM INTENSET: PROG_SET_EN Position   */
#define EEPROM_INTENSET_PROG_SET_EN_Msk       (0x01UL << EEPROM_INTENSET_PROG_SET_EN_Pos)             /*!< EEPROM INTENSET: PROG_SET_EN Mask       */

/* -------------------------------  EEPROM_INTSTAT  ------------------------------- */
#define EEPROM_INTSTAT_END_OF_PROG_Pos        2                                                       /*!< EEPROM INTSTAT: END_OF_PROG Position    */
#define EEPROM_INTSTAT_END_OF_PROG_Msk        (0x01UL << EEPROM_INTSTAT_END_OF_PROG_Pos)              /*!< EEPROM INTSTAT: END_OF_PROG Mask        */

