roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  EEPROM_INTEN  -------------------------------- */
#define EEPROM_INTEN_EE_PROG_DONE_Pos         2                                                       /*!< EEPROM INTEN: EE_PROG_DONE Position     */
#define EEPROM_INTEN_EE_PROG_DONE_Msk         (0x01UL << EEPROM_INTEN_EE_PROG_DONE_Pos)               /*!< EEPROM INTEN: EE_PROG_DONE Mask         */

/* ------------------------------  EEPROM_INTSTATCLR  ----------------------------- */
#define EEPROM_INTSTATCLR_PROG_CLR_ST_Pos     2                                                       /*!< EEPROM INTSTATCLR: PROG_CLR_ST Position */
#define EEPROM_INTSTATCLR_PROG_CLR_ST_Msk     (0x01UL << EEPROM_INTSTATCLR_PROG_CLR_ST_Pos)           /*!< EEPROM INTSTATCLR: PROG_CLR_ST Mask     */


/* ================================================================================ */
/* ================        struct 'ETHERNET' Position & Mask       ================ */
/* ================================================================================ */


/* -----------------------------  ETHERNET_MAC_CONFIG  ---------------------------- */
#define ETHERNET_MAC_CONFIG_RE_Pos            2                                                       /*!< ETHERNET MAC_CONFIG: RE Position        */
#define ETHERNET_MAC_CONFIG_RE_Msk            (0x01UL << ETHERNET_MAC_CONFIG_RE_Pos)                  /*!< ETHERNET MAC_CONFIG: RE Mask            */
#define ETHERNET_MAC_CONFIG_TE_Pos            3                                                       /*!< ETHERNET MAC_CONFIG: TE Position        */
#define ETHERNET_MAC_CONFIG_TE_Msk            (0x01UL << ETHERNET_MAC_CONFIG_TE_Pos)                  /*!< ETHERNET MAC_CONFIG: TE Mask            */
#define ETHERNET_MAC_CONFIG_DF_Pos            4                                                       /*!< ETHERNET MAC_CONFIG: DF Position        */
#define ETHERNET_MAC_CONFIG_DF_Msk            (0x01UL << ETHERNET_MAC_CONFIG_DF_Pos)                  /*!< ETHERNET MAC_CONFIG: DF Mask            */
#define ETHERNET_MAC_CONFIG_BL_Pos            5                                                       /*!< ETHERNET MAC_CONFIG: BL Position        */
#define ETHERNET_MAC_CONFIG_BL_Msk            (0x03UL << ETHERNET_MAC_CONFIG_BL_Pos)                  /*!< ETHERNET MAC_CONFIG: BL Mask            */
#define ETHERNET_MAC_CONFIG_ACS_Pos           7                                                       /*!< ETHERNET MAC_CONFIG: ACS Position       */
#define ETHERNET_MAC_CONFIG_ACS_Msk           (0x01UL << ETHERNET_MAC_CONFIG_ACS_Pos)                 /*!< ETHERNET MAC_CONFIG: ACS Mask           */
#define ETHERNET_MAC_CONFIG_DR_Pos            9                                                       /*!< ETHERNET MAC_CONFIG: DR Position        */
#define ETHERNET_MAC_CONFIG_DR_Msk            (0x01UL << ETHERNET_MAC_CONFIG_DR_Pos)                  /*!< ETHERNET MAC_CONFIG: DR Mask            */
#define ETHERNET_MAC_CONFIG_DM_Pos            11                                                      /*!< ETHERNET MAC_CONFIG: DM Position        */
#define ETHERNET_MAC_CONFIG_DM_Msk            (0x01UL << ETHERNET_MAC_CONFIG_DM_Pos)                  /*!< ETHERNET MAC_CONFIG: DM Mask            */
#define ETHERNET_MAC_CONFIG_LM_Pos            12                                                      /*!< ETHERNET MAC_CONFIG: LM Position        */
#define ETHERNET_MAC_CONFIG_LM_Msk            (0x01UL << ETHERNET_MAC_CONFIG_LM_Pos)                  /*!< ETHERNET MAC_CONFIG: LM Mask            */
#define ETHERNET_MAC_CONFIG_DO_Pos            13                                                      /*!< ETHERNET MAC_CONFIG: DO Position        */
#define ETHERNET_MAC_CONFIG_DO_Msk            (0x01UL << ETHERNET_MAC_CONFIG_DO_Pos)                  /*!< ETHERNET MAC_CONFIG: DO Mask            */
#define ETHERNET_MAC_CONFIG_FES_Pos           14                                                      /*!< ETHERNET MAC_CONFIG: FES Position       */
#define ETHERNET_MAC_CONFIG_FES_Msk           (0x01UL << ETHERNET_MAC_CONFIG_FES_Pos)                 /*!< ETHERNET MAC_CONFIG: FES Mask           */
#define ETHERNET_MAC_CONFIG_PS_Pos            15                                                      /*!< ETHERNET MAC_CONFIG: PS Position        */
#define ETHERNET_MAC_CONFIG_PS_Msk            (0x01UL << ETHERNET_MAC_CONFIG_PS_Pos)                  /*!< ETHERNET MAC_CONFIG: PS Mask            */
#define ETHERNET_MAC_CONFIG_DCRS_Pos          16                                                      /*!< ETHERNET MAC_CONFIG: DCRS Position      */
#define ETHERNET_MAC_CONFIG_DCRS_Msk          (0x01UL << ETHERNET_MAC_CONFIG_DCRS_Pos)                /*!< ETHERNET MAC_CONFIG: DCRS Mask          */
#define ETHERNET_MAC_CONFIG_IFG_Pos           17                                                      /*!< ETHERNET MAC_CONFIG: IFG Position       */
#define ETHERNET_MAC_CONFIG_IFG_Msk           (0x07UL << ETHERNET_MAC_CONFIG_IFG_Pos)                 /*!< ETHERNET MAC_CONFIG: IFG Mask           */
#define ETHERNET_MAC_CONFIG_JE_Pos            20                                                      /*!< ETHERNET MAC_CONFIG: JE Position        */
#define ETHERNET_MAC_CONFIG_JE_Msk            (0x01UL << ETHERNET_MAC_CONFIG_JE_Pos)                  /*!< ETHERNET MAC_CONFIG: JE Mask            */
#define ETHERNET_MAC_CONFIG_JD_Pos            22                                                      /*!< ETHERNET MAC_CONFIG: JD Position        */
#define ETHERNET_MAC_CONFIG_JD_Msk            (0x01UL << ETHERNET_MAC_CONFIG_JD_Pos)                  /*!< ETHERNET MAC_CONFIG: JD Mask            */
#define ETHERNET_MAC_CONFIG_WD_Pos            23                                                      /*!< ETHERNET MAC_CONFIG: WD Position        */
#define ETHERNET_MAC_CONFIG_WD_Msk            (0x01UL << ETHERNET_MAC_CONFIG_WD_Pos)                  /*!< ETHERNET MAC_CONFIG: WD Mask            */

/* --------------------------  ETHERNET_MAC_FRAME_FILTER  ------------------------- */
#define ETHERNET_MAC_FRAME_FILTER_PR_Pos      0                                                       /*!< ETHERNET MAC_FRAME_FILTER: PR Position  */
#define ETHERNET_MAC_FRAME_FILTER_PR_Msk      (0x01UL << ETHERNET_MAC_FRAME_FILTER_PR_Pos)            /*!< ETHERNET MAC_FRAME_FILTER: PR Mask      */
#define ETHERNET_MAC_FRAME_FILTER_HUC_Pos     1                                                       /*!< ETHERNET MAC_FRAME_FILTER: HUC Position */
#define ETHERNET_MAC_FRAME_FILTER_HUC_Msk     (0x01UL << ETHERNET_MAC_FRAME_FILTER_HUC_Pos)           /*!< ETHERNET MAC_FRAME_FILTER: HUC Mask     */
#define ETHERNET_MAC_FRAME_FILTER_HMC_Pos     2                                                       /*!< ETHERNET MAC_FRAME_FILTER: HMC Position */
#define ETHERNET_MAC_FRAME_FILTER_HMC_Msk     (0x01UL << ETHERNET_MAC_FRAME_FILTER_HMC_Pos)           /*!< ETHERNET MAC_FRAME_FILTER: HMC Mask     */
#define ETHERNET_MAC_FRAME_FILTER_DAIF_Pos    3                                                       /*!< ETHERNET MAC_FRAME_FILTER: DAIF Position */
#define ETHERNET_MAC_FRAME_FILTER_DAIF_Msk    (0x01UL << ETHERNET_MAC_FRAME_FILTER_DAIF_Pos)          /*!< ETHERNET MAC_FRAME_FILTER: DAIF Mask    */
#define ETHERNET_MAC_FRAME_FILTER_PM_Pos      4                                                       /*!< ETHERNET MAC_FRAME_FILTER: PM Position  */
#define ETHERNET_MAC_FRAME_FILTER_PM_Msk      (0x01UL << ETHERNET_MAC_FRAME_FILTER_PM_Pos)            /*!< ETHERNET MAC_FRAME_FILTER: PM Mask      */
#define ETHERNET_MAC_FRAME_FILTER_DBF_Pos     5                                                       /*!< ETHERNET MAC_FRAME_FILTER: DBF Position */
#define ETHERNET_MAC_FRAME_FILTER_DBF_Msk     (0x01UL << ETHERNET_MAC_FRAME_FILTER_DBF_Pos)           /*!< ETHERNET MAC_FRAME_FILTER: DBF Mask     */
#define ETHERNET_MAC_FRAME_FILTER_PCF_Pos     6                                                       /*!< ETHERNET MAC_FRAME_FILTER: PCF Position */
#define ETHERNET_MAC_FRAME_FILTER_PCF_Msk     (0x03UL << ETHERNET_MAC_FRAME_FILTER_PCF_Pos)           /*!< ETHERNET MAC_FRAME_FILTER: PCF Mask     */
#define ETHERNET_MAC_FRAME_FILTER_HPF_Pos     10                                                      /*!< ETHERNET MAC_FRAME_FILTER: HPF Position */
#define ETHERNET_MAC_FRAME_FILTER_HPF_Msk     (0x01UL << ETHERNET_MAC_FRAME_FILTER_HPF_Pos)           /*!< ETHERNET MAC_FRAME_FILTER: HPF Mask     */
#define ETHERNET_MAC_FRAME_FILTER_RA_Pos      31                                                      /*!< ETHERNET MAC_FRAME_FILTER: RA Position  */
#define ETHERNET_MAC_FRAME_FILTER_RA_Msk      (0x01UL << ETHERNET_MAC_FRAME_FILTER_RA_Pos)            /*!< ETHERNET MAC_FRAME_FILTER: RA Mask      */

/* -------------------------  ETHERNET_MAC_HASHTABLE_HIGH  ------------------------ */
#define ETHERNET_MAC_HASHTABLE_HIGH_HTH_Pos   0                                                       /*!< ETHERNET MAC_HASHTABLE_HIGH: HTH Position */
#define ETHERNET_MAC_HASHTABLE_HIGH_HTH_Msk   (0xffffffffUL << ETHERNET_MAC_HASHTABLE_HIGH_HTH_Pos)   /*!< ETHERNET MAC_HASHTABLE_HIGH: HTH Mask   */

/* -------------------------  ETHERNET_MAC_HASHTABLE_LOW  ------------------------- */
#define ETHERNET_MAC_HASHTABLE_LOW_HTL_Pos    0                                                       /*!< ETHERNET MAC_HASHTABLE_LOW: HTL Position */
#define ETHERNET_MAC_HASHTABLE_LOW_HTL_Msk    (0xffffffffUL << ETHERNET_MAC_HASHTABLE_LOW_HTL_Pos)    /*!< ETHERNET MAC_HASHTABLE_LOW: HTL Mask    */

