roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------  ETHERNET_MAC_INTR_MASK  --------------------------- */
#define ETHERNET_MAC_INTR_MASK_PMTIM_Pos      3                                                       /*!< ETHERNET MAC_INTR_MASK: PMTIM Position  */
#define ETHERNET_MAC_INTR_MASK_PMTIM_Msk      (0x01UL << ETHERNET_MAC_INTR_MASK_PMTIM_Pos)            /*!< ETHERNET MAC_INTR_MASK: PMTIM Mask      */
#define ETHERNET_MAC_INTR_MASK_TSIM_Pos       9                                                       /*!< ETHERNET MAC_INTR_MASK: TSIM Position   */
#define ETHERNET_MAC_INTR_MASK_TSIM_Msk       (0x01UL << ETHERNET_MAC_INTR_MASK_TSIM_Pos)             /*!< ETHERNET MAC_INTR_MASK: TSIM Mask       */

/* ---------------------------  ETHERNET_MAC_ADDR0_HIGH  -------------------------- */
#define ETHERNET_MAC_ADDR0_HIGH_A47_32_Pos    0                                                       /*!< ETHERNET MAC_ADDR0_HIGH: A47_32 Position */
#define ETHERNET_MAC_ADDR0_HIGH_A47_32_Msk    (0x0000ffffUL << ETHERNET_MAC_ADDR0_HIGH_A47_32_Pos)    /*!< ETHERNET MAC_ADDR0_HIGH: A47_32 Mask    */
#define ETHERNET_MAC_ADDR0_HIGH_MO_Pos        31                                                      /*!< ETHERNET MAC_ADDR0_HIGH: MO Position    */
#define ETHERNET_MAC_ADDR0_HIGH_MO_Msk        (0x01UL << ETHERNET_MAC_ADDR0_HIGH_MO_Pos)              /*!< ETHERNET MAC_ADDR0_HIGH: MO Mask        */

/* ---------------------------  ETHERNET_MAC_ADDR0_LOW  --------------------------- */
#define ETHERNET_MAC_ADDR0_LOW_A31_0_Pos      0                                                       /*!< ETHERNET MAC_ADDR0_LOW: A31_0 Position  */
#define ETHERNET_MAC_ADDR0_LOW_A31_0_Msk      (0xffffffffUL << ETHERNET_MAC_ADDR0_LOW_A31_0_Pos)      /*!< ETHERNET MAC_ADDR0_LOW: A31_0 Mask      */

/* --------------------------  ETHERNET_MAC_TIMESTP_CTRL  ------------------------- */
#define ETHERNET_MAC_TIMESTP_CTRL_TSENA_Pos   0                                                       /*!< ETHERNET MAC_TIMESTP_CTRL: TSENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSENA_Msk   (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSENA_Pos)         /*!< ETHERNET MAC_TIMESTP_CTRL: TSENA Mask   */
#define ETHERNET_MAC_TIMESTP_CTRL_TSCFUPDT_Pos 1                                                      /*!< ETHERNET MAC_TIMESTP_CTRL: TSCFUPDT Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSCFUPDT_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSCFUPDT_Pos)     /*!< ETHERNET MAC_TIMESTP_CTRL: TSCFUPDT Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSINIT_Pos  2                                                       /*!< ETHERNET MAC_TIMESTP_CTRL: TSINIT Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSINIT_Msk  (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSINIT_Pos)        /*!< ETHERNET MAC_TIMESTP_CTRL: TSINIT Mask  */
#define ETHERNET_MAC_TIMESTP_CTRL_TSUPDT_Pos  3                                                       /*!< ETHERNET MAC_TIMESTP_CTRL: TSUPDT Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSUPDT_Msk  (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSUPDT_Pos)        /*!< ETHERNET MAC_TIMESTP_CTRL: TSUPDT Mask  */
#define ETHERNET_MAC_TIMESTP_CTRL_TSTRIG_Pos  4                                                       /*!< ETHERNET MAC_TIMESTP_CTRL: TSTRIG Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSTRIG_Msk  (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSTRIG_Pos)        /*!< ETHERNET MAC_TIMESTP_CTRL: TSTRIG Mask  */
#define ETHERNET_MAC_TIMESTP_CTRL_TSADDREG_Pos 5                                                      /*!< ETHERNET MAC_TIMESTP_CTRL: TSADDREG Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSADDREG_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSADDREG_Pos)     /*!< ETHERNET MAC_TIMESTP_CTRL: TSADDREG Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSENALL_Pos 8                                                       /*!< ETHERNET MAC_TIMESTP_CTRL: TSENALL Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSENALL_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSENALL_Pos)       /*!< ETHERNET MAC_TIMESTP_CTRL: TSENALL Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSCTRLSSR_Pos 9                                                     /*!< ETHERNET MAC_TIMESTP_CTRL: TSCTRLSSR Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSCTRLSSR_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSCTRLSSR_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSCTRLSSR Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSVER2ENA_Pos 10                                                    /*!< ETHERNET MAC_TIMESTP_CTRL: TSVER2ENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSVER2ENA_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSVER2ENA_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSVER2ENA Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSIPENA_Pos 11                                                      /*!< ETHERNET MAC_TIMESTP_CTRL: TSIPENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSIPENA_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSIPENA_Pos)       /*!< ETHERNET MAC_TIMESTP_CTRL: TSIPENA Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSIPV6ENA_Pos 12                                                    /*!< ETHERNET MAC_TIMESTP_CTRL: TSIPV6ENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSIPV6ENA_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSIPV6ENA_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSIPV6ENA Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSIPV4ENA_Pos 13                                                    /*!< ETHERNET MAC_TIMESTP_CTRL: TSIPV4ENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSIPV4ENA_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSIPV4ENA_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSIPV4ENA Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSEVNTENA_Pos 14                                                    /*!< ETHERNET MAC_TIMESTP_CTRL: TSEVNTENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSEVNTENA_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSEVNTENA_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSEVNTENA Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSMSTRENA_Pos 15                                                    /*!< ETHERNET MAC_TIMESTP_CTRL: TSMSTRENA Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSMSTRENA_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSMSTRENA_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSMSTRENA Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSCLKTYPE_Pos 16                                                    /*!< ETHERNET MAC_TIMESTP_CTRL: TSCLKTYPE Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSCLKTYPE_Msk (0x03UL << ETHERNET_MAC_TIMESTP_CTRL_TSCLKTYPE_Pos)   /*!< ETHERNET MAC_TIMESTP_CTRL: TSCLKTYPE Mask */
#define ETHERNET_MAC_TIMESTP_CTRL_TSENMACADDR_Pos 18                                                  /*!< ETHERNET MAC_TIMESTP_CTRL: TSENMACADDR Position */
#define ETHERNET_MAC_TIMESTP_CTRL_TSENMACADDR_Msk (0x01UL << ETHERNET_MAC_TIMESTP_CTRL_TSENMACADDR_Pos)/*!< ETHERNET MAC_TIMESTP_CTRL: TSENMACADDR Mask */

/* ---------------------------  ETHERNET_SUBSECOND_INCR  -------------------------- */
#define ETHERNET_SUBSECOND_INCR_SSINC_Pos     0                                                       /*!< ETHERNET SUBSECOND_INCR: SSINC Position */
#define ETHERNET_SUBSECOND_INCR_SSINC_Msk     (0x000000ffUL << ETHERNET_SUBSECOND_INCR_SSINC_Pos)     /*!< ETHERNET SUBSECOND_INCR: SSINC Mask     */

/* ------------------------------  ETHERNET_SECONDS  ------------------------------ */
#define ETHERNET_SECONDS_TSS_Pos              0                                                       /*!< ETHERNET SECONDS: TSS Position          */
#define ETHERNET_SECONDS_TSS_Msk              (0xffffffffUL << ETHERNET_SECONDS_TSS_Pos)              /*!< ETHERNET SECONDS: TSS Mask              */

/* ----------------------------  ETHERNET_NANOSECONDS  ---------------------------- */
#define ETHERNET_NANOSECONDS_TSSS_Pos         0                                                       /*!< ETHERNET NANOSECONDS: TSSS Position     */
#define ETHERNET_NANOSECONDS_TSSS_Msk         (0x7fffffffUL << ETHERNET_NANOSECONDS_TSSS_Pos)         /*!< ETHERNET NANOSECONDS: TSSS Mask         */
#define ETHERNET_NANOSECONDS_PSNT_Pos         31                                                      /*!< ETHERNET NANOSECONDS: PSNT Position     */
#define ETHERNET_NANOSECONDS_PSNT_Msk         (0x01UL << ETHERNET_NANOSECONDS_PSNT_Pos)               /*!< ETHERNET NANOSECONDS: PSNT Mask         */

