roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------  ETHERNET_SECONDSUPDATE  --------------------------- */
#define ETHERNET_SECONDSUPDATE_TSS_Pos        0                                                       /*!< ETHERNET SECONDSUPDATE: TSS Position    */
#define ETHERNET_SECONDSUPDATE_TSS_Msk        (0xffffffffUL << ETHERNET_SECONDSUPDATE_TSS_Pos)        /*!< ETHERNET SECONDSUPDATE: TSS Mask        */

/* -------------------------  ETHERNET_NANOSECONDSUPDATE  ------------------------- */
#define ETHERNET_NANOSECONDSUPDATE_TSSS_Pos   0                                                       /*!< ETHERNET NANOSECONDSUPDATE: TSSS Position */
#define ETHERNET_NANOSECONDSUPDATE_TSSS_Msk   (0x7fffffffUL << ETHERNET_NANOSECONDSUPDATE_TSSS_Pos)   /*!< ETHERNET NANOSECONDSUPDATE: TSSS Mask   */
#define ETHERNET_NANOSECONDSUPDATE_ADDSUB_Pos 31                                                      /*!< ETHERNET NANOSECONDSUPDATE: ADDSUB Position */
#define ETHERNET_NANOSECONDSUPDATE_ADDSUB_Msk (0x01UL << ETHERNET_NANOSECONDSUPDATE_ADDSUB_Pos)       /*!< ETHERNET NANOSECONDSUPDATE: ADDSUB Mask */

/* -------------------------------  ETHERNET_ADDEND  ------------------------------ */
#define ETHERNET_ADDEND_TSAR_Pos              0                                                       /*!< ETHERNET ADDEND: TSAR Position          */
#define ETHERNET_ADDEND_TSAR_Msk              (0xffffffffUL << ETHERNET_ADDEND_TSAR_Pos)              /*!< ETHERNET ADDEND: TSAR Mask              */

/* ---------------------------  ETHERNET_TARGETSECONDS  --------------------------- */
#define ETHERNET_TARGETSECONDS_TSTR_Pos       0                                                       /*!< ETHERNET TARGETSECONDS: TSTR Position   */
#define ETHERNET_TARGETSECONDS_TSTR_Msk       (0xffffffffUL << ETHERNET_TARGETSECONDS_TSTR_Pos)       /*!< ETHERNET TARGETSECONDS: TSTR Mask       */

/* -------------------------  ETHERNET_TARGETNANOSECONDS  ------------------------- */
#define ETHERNET_TARGETNANOSECONDS_TSTR_Pos   0                                                       /*!< ETHERNET TARGETNANOSECONDS: TSTR Position */
#define ETHERNET_TARGETNANOSECONDS_TSTR_Msk   (0x7fffffffUL << ETHERNET_TARGETNANOSECONDS_TSTR_Pos)   /*!< ETHERNET TARGETNANOSECONDS: TSTR Mask   */

/* ------------------------------  ETHERNET_HIGHWORD  ----------------------------- */
#define ETHERNET_HIGHWORD_TSHWR_Pos           0                                                       /*!< ETHERNET HIGHWORD: TSHWR Position       */
#define ETHERNET_HIGHWORD_TSHWR_Msk           (0x0000ffffUL << ETHERNET_HIGHWORD_TSHWR_Pos)           /*!< ETHERNET HIGHWORD: TSHWR Mask           */

/* ---------------------------  ETHERNET_TIMESTAMPSTAT  --------------------------- */
#define ETHERNET_TIMESTAMPSTAT_TSSOVF_Pos     0                                                       /*!< ETHERNET TIMESTAMPSTAT: TSSOVF Position */
#define ETHERNET_TIMESTAMPSTAT_TSSOVF_Msk     (0x01UL << ETHERNET_TIMESTAMPSTAT_TSSOVF_Pos)           /*!< ETHERNET TIMESTAMPSTAT: TSSOVF Mask     */
#define ETHERNET_TIMESTAMPSTAT_TSTARGT_Pos    1                                                       /*!< ETHERNET TIMESTAMPSTAT: TSTARGT Position */
#define ETHERNET_TIMESTAMPSTAT_TSTARGT_Msk    (0x01UL << ETHERNET_TIMESTAMPSTAT_TSTARGT_Pos)          /*!< ETHERNET TIMESTAMPSTAT: TSTARGT Mask    */

/* ----------------------------  ETHERNET_DMA_BUS_MODE  --------------------------- */
#define ETHERNET_DMA_BUS_MODE_SWR_Pos         0                                                       /*!< ETHERNET DMA_BUS_MODE: SWR Position     */
#define ETHERNET_DMA_BUS_MODE_SWR_Msk         (0x01UL << ETHERNET_DMA_BUS_MODE_SWR_Pos)               /*!< ETHERNET DMA_BUS_MODE: SWR Mask         */
#define ETHERNET_DMA_BUS_MODE_DA_Pos          1                                                       /*!< ETHERNET DMA_BUS_MODE: DA Position      */
#define ETHERNET_DMA_BUS_MODE_DA_Msk          (0x01UL << ETHERNET_DMA_BUS_MODE_DA_Pos)                /*!< ETHERNET DMA_BUS_MODE: DA Mask          */
#define ETHERNET_DMA_BUS_MODE_DSL_Pos         2                                                       /*!< ETHERNET DMA_BUS_MODE: DSL Position     */
#define ETHERNET_DMA_BUS_MODE_DSL_Msk         (0x1fUL << ETHERNET_DMA_BUS_MODE_DSL_Pos)               /*!< ETHERNET DMA_BUS_MODE: DSL Mask         */
#define ETHERNET_DMA_BUS_MODE_ATDS_Pos        7                                                       /*!< ETHERNET DMA_BUS_MODE: ATDS Position    */
#define ETHERNET_DMA_BUS_MODE_ATDS_Msk        (0x01UL << ETHERNET_DMA_BUS_MODE_ATDS_Pos)              /*!< ETHERNET DMA_BUS_MODE: ATDS Mask        */
#define ETHERNET_DMA_BUS_MODE_PBL_Pos         8                                                       /*!< ETHERNET DMA_BUS_MODE: PBL Position     */
#define ETHERNET_DMA_BUS_MODE_PBL_Msk         (0x3fUL << ETHERNET_DMA_BUS_MODE_PBL_Pos)               /*!< ETHERNET DMA_BUS_MODE: PBL Mask         */
#define ETHERNET_DMA_BUS_MODE_PR_Pos          14                                                      /*!< ETHERNET DMA_BUS_MODE: PR Position      */
#define ETHERNET_DMA_BUS_MODE_PR_Msk          (0x03UL << ETHERNET_DMA_BUS_MODE_PR_Pos)                /*!< ETHERNET DMA_BUS_MODE: PR Mask          */
#define ETHERNET_DMA_BUS_MODE_FB_Pos          16                                                      /*!< ETHERNET DMA_BUS_MODE: FB Position      */
#define ETHERNET_DMA_BUS_MODE_FB_Msk          (0x01UL << ETHERNET_DMA_BUS_MODE_FB_Pos)                /*!< ETHERNET DMA_BUS_MODE: FB Mask          */
#define ETHERNET_DMA_BUS_MODE_RPBL_Pos        17                                                      /*!< ETHERNET DMA_BUS_MODE: RPBL Position    */
#define ETHERNET_DMA_BUS_MODE_RPBL_Msk        (0x3fUL << ETHERNET_DMA_BUS_MODE_RPBL_Pos)              /*!< ETHERNET DMA_BUS_MODE: RPBL Mask        */
#define ETHERNET_DMA_BUS_MODE_USP_Pos         23                                                      /*!< ETHERNET DMA_BUS_MODE: USP Position     */
#define ETHERNET_DMA_BUS_MODE_USP_Msk         (0x01UL << ETHERNET_DMA_BUS_MODE_USP_Pos)               /*!< ETHERNET DMA_BUS_MODE: USP Mask         */
#define ETHERNET_DMA_BUS_MODE_PBL8X_Pos       24                                                      /*!< ETHERNET DMA_BUS_MODE: PBL8X Position   */
#define ETHERNET_DMA_BUS_MODE_PBL8X_Msk       (0x01UL << ETHERNET_DMA_BUS_MODE_PBL8X_Pos)             /*!< ETHERNET DMA_BUS_MODE: PBL8X Mask       */
#define ETHERNET_DMA_BUS_MODE_AAL_Pos         25                                                      /*!< ETHERNET DMA_BUS_MODE: AAL Position     */
#define ETHERNET_DMA_BUS_MODE_AAL_Msk         (0x01UL << ETHERNET_DMA_BUS_MODE_AAL_Pos)               /*!< ETHERNET DMA_BUS_MODE: AAL Mask         */
#define ETHERNET_DMA_BUS_MODE_MB_Pos          26                                                      /*!< ETHERNET DMA_BUS_MODE: MB Position      */
#define ETHERNET_DMA_BUS_MODE_MB_Msk          (0x01UL << ETHERNET_DMA_BUS_MODE_MB_Pos)                /*!< ETHERNET DMA_BUS_MODE: MB Mask          */
#define ETHERNET_DMA_BUS_MODE_TXPR_Pos        27                                                      /*!< ETHERNET DMA_BUS_MODE: TXPR Position    */
#define ETHERNET_DMA_BUS_MODE_TXPR_Msk        (0x01UL << ETHERNET_DMA_BUS_MODE_TXPR_Pos)              /*!< ETHERNET DMA_BUS_MODE: TXPR Mask        */

/* -----------------------  ETHERNET_DMA_TRANS_POLL_DEMAND  ----------------------- */
#define ETHERNET_DMA_TRANS_POLL_DEMAND_TPD_Pos 0                                                      /*!< ETHERNET DMA_TRANS_POLL_DEMAND: TPD Position */
#define ETHERNET_DMA_TRANS_POLL_DEMAND_TPD_Msk (0xffffffffUL << ETHERNET_DMA_TRANS_POLL_DEMAND_TPD_Pos)/*!< ETHERNET DMA_TRANS_POLL_DEMAND: TPD Mask */

/* ------------------------  ETHERNET_DMA_REC_POLL_DEMAND  ------------------------ */
#define ETHERNET_DMA_REC_POLL_DEMAND_RPD_Pos  0                                                       /*!< ETHERNET DMA_REC_POLL_DEMAND: RPD Position */
#define ETHERNET_DMA_REC_POLL_DEMAND_RPD_Msk  (0xffffffffUL << ETHERNET_DMA_REC_POLL_DEMAND_RPD_Pos)  /*!< ETHERNET DMA_REC_POLL_DEMAND: RPD Mask  */

