roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------  ETHERNET_DMA_REC_DES_ADDR  ------------------------- */
#define ETHERNET_DMA_REC_DES_ADDR_SRL_Pos     0                                                       /*!< ETHERNET DMA_REC_DES_ADDR: SRL Position */
#define ETHERNET_DMA_REC_DES_ADDR_SRL_Msk     (0xffffffffUL << ETHERNET_DMA_REC_DES_ADDR_SRL_Pos)     /*!< ETHERNET DMA_REC_DES_ADDR: SRL Mask     */

/* -------------------------  ETHERNET_DMA_TRANS_DES_ADDR  ------------------------ */
#define ETHERNET_DMA_TRANS_DES_ADDR_SRL_Pos   0                                                       /*!< ETHERNET DMA_TRANS_DES_ADDR: SRL Position */
#define ETHERNET_DMA_TRANS_DES_ADDR_SRL_Msk   (0xffffffffUL << ETHERNET_DMA_TRANS_DES_ADDR_SRL_Pos)   /*!< ETHERNET DMA_TRANS_DES_ADDR: SRL Mask   */

/* ------------------------------  ETHERNET_DMA_STAT  ----------------------------- */
#define ETHERNET_DMA_STAT_TI_Pos              0                                                       /*!< ETHERNET DMA_STAT: TI Position          */
#define ETHERNET_DMA_STAT_TI_Msk              (0x01UL << ETHERNET_DMA_STAT_TI_Pos)                    /*!< ETHERNET DMA_STAT: TI Mask              */
#define ETHERNET_DMA_STAT_TPS_Pos             1                                                       /*!< ETHERNET DMA_STAT: TPS Position         */
#define ETHERNET_DMA_STAT_TPS_Msk             (0x01UL << ETHERNET_DMA_STAT_TPS_Pos)                   /*!< ETHERNET DMA_STAT: TPS Mask             */
#define ETHERNET_DMA_STAT_TU_Pos              2                                                       /*!< ETHERNET DMA_STAT: TU Position          */
#define ETHERNET_DMA_STAT_TU_Msk              (0x01UL << ETHERNET_DMA_STAT_TU_Pos)                    /*!< ETHERNET DMA_STAT: TU Mask              */
#define ETHERNET_DMA_STAT_TJT_Pos             3                                                       /*!< ETHERNET DMA_STAT: TJT Position         */
#define ETHERNET_DMA_STAT_TJT_Msk             (0x01UL << ETHERNET_DMA_STAT_TJT_Pos)                   /*!< ETHERNET DMA_STAT: TJT Mask             */
#define ETHERNET_DMA_STAT_OVF_Pos             4                                                       /*!< ETHERNET DMA_STAT: OVF Position         */
#define ETHERNET_DMA_STAT_OVF_Msk             (0x01UL << ETHERNET_DMA_STAT_OVF_Pos)                   /*!< ETHERNET DMA_STAT: OVF Mask             */
#define ETHERNET_DMA_STAT_UNF_Pos             5                                                       /*!< ETHERNET DMA_STAT: UNF Position         */
#define ETHERNET_DMA_STAT_UNF_Msk             (0x01UL << ETHERNET_DMA_STAT_UNF_Pos)                   /*!< ETHERNET DMA_STAT: UNF Mask             */
#define ETHERNET_DMA_STAT_RI_Pos              6                                                       /*!< ETHERNET DMA_STAT: RI Position          */
#define ETHERNET_DMA_STAT_RI_Msk              (0x01UL << ETHERNET_DMA_STAT_RI_Pos)                    /*!< ETHERNET DMA_STAT: RI Mask              */
#define ETHERNET_DMA_STAT_RU_Pos              7                                                       /*!< ETHERNET DMA_STAT: RU Position          */
#define ETHERNET_DMA_STAT_RU_Msk              (0x01UL << ETHERNET_DMA_STAT_RU_Pos)                    /*!< ETHERNET DMA_STAT: RU Mask              */
#define ETHERNET_DMA_STAT_RPS_Pos             8                                                       /*!< ETHERNET DMA_STAT: RPS Position         */
#define ETHERNET_DMA_STAT_RPS_Msk             (0x01UL << ETHERNET_DMA_STAT_RPS_Pos)                   /*!< ETHERNET DMA_STAT: RPS Mask             */
#define ETHERNET_DMA_STAT_RWT_Pos             9                                                       /*!< ETHERNET DMA_STAT: RWT Position         */
#define ETHERNET_DMA_STAT_RWT_Msk             (0x01UL << ETHERNET_DMA_STAT_RWT_Pos)                   /*!< ETHERNET DMA_STAT: RWT Mask             */
#define ETHERNET_DMA_STAT_ETI_Pos             10                                                      /*!< ETHERNET DMA_STAT: ETI Position         */
#define ETHERNET_DMA_STAT_ETI_Msk             (0x01UL << ETHERNET_DMA_STAT_ETI_Pos)                   /*!< ETHERNET DMA_STAT: ETI Mask             */
#define ETHERNET_DMA_STAT_FBI_Pos             13                                                      /*!< ETHERNET DMA_STAT: FBI Position         */
#define ETHERNET_DMA_STAT_FBI_Msk             (0x01UL << ETHERNET_DMA_STAT_FBI_Pos)                   /*!< ETHERNET DMA_STAT: FBI Mask             */
#define ETHERNET_DMA_STAT_ERI_Pos             14                                                      /*!< ETHERNET DMA_STAT: ERI Position         */
#define ETHERNET_DMA_STAT_ERI_Msk             (0x01UL << ETHERNET_DMA_STAT_ERI_Pos)                   /*!< ETHERNET DMA_STAT: ERI Mask             */
#define ETHERNET_DMA_STAT_AIE_Pos             15                                                      /*!< ETHERNET DMA_STAT: AIE Position         */
#define ETHERNET_DMA_STAT_AIE_Msk             (0x01UL << ETHERNET_DMA_STAT_AIE_Pos)                   /*!< ETHERNET DMA_STAT: AIE Mask             */
#define ETHERNET_DMA_STAT_NIS_Pos             16                                                      /*!< ETHERNET DMA_STAT: NIS Position         */
#define ETHERNET_DMA_STAT_NIS_Msk             (0x01UL << ETHERNET_DMA_STAT_NIS_Pos)                   /*!< ETHERNET DMA_STAT: NIS Mask             */
#define ETHERNET_DMA_STAT_RS_Pos              17                                                      /*!< ETHERNET DMA_STAT: RS Position          */
#define ETHERNET_DMA_STAT_RS_Msk              (0x07UL << ETHERNET_DMA_STAT_RS_Pos)                    /*!< ETHERNET DMA_STAT: RS Mask              */
#define ETHERNET_DMA_STAT_TS_Pos              20                                                      /*!< ETHERNET DMA_STAT: TS Position          */
#define ETHERNET_DMA_STAT_TS_Msk              (0x07UL << ETHERNET_DMA_STAT_TS_Pos)                    /*!< ETHERNET DMA_STAT: TS Mask              */
#define ETHERNET_DMA_STAT_EB1_Pos             23                                                      /*!< ETHERNET DMA_STAT: EB1 Position         */
#define ETHERNET_DMA_STAT_EB1_Msk             (0x01UL << ETHERNET_DMA_STAT_EB1_Pos)                   /*!< ETHERNET DMA_STAT: EB1 Mask             */
#define ETHERNET_DMA_STAT_EB2_Pos             24                                                      /*!< ETHERNET DMA_STAT: EB2 Position         */
#define ETHERNET_DMA_STAT_EB2_Msk             (0x01UL << ETHERNET_DMA_STAT_EB2_Pos)                   /*!< ETHERNET DMA_STAT: EB2 Mask             */
#define ETHERNET_DMA_STAT_EB3_Pos             25                                                      /*!< ETHERNET DMA_STAT: EB3 Position         */
#define ETHERNET_DMA_STAT_EB3_Msk             (0x01UL << ETHERNET_DMA_STAT_EB3_Pos)                   /*!< ETHERNET DMA_STAT: EB3 Mask             */

