roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  CREG_FLASHCFGA  ------------------------------- */
#define CREG_FLASHCFGA_FLASHTIM_Pos           12                                                      /*!< CREG FLASHCFGA: FLASHTIM Position       */
#define CREG_FLASHCFGA_FLASHTIM_Msk           (0x0fUL << CREG_FLASHCFGA_FLASHTIM_Pos)                 /*!< CREG FLASHCFGA: FLASHTIM Mask           */
#define CREG_FLASHCFGA_POW_Pos                31                                                      /*!< CREG FLASHCFGA: POW Position            */
#define CREG_FLASHCFGA_POW_Msk                (0x01UL << CREG_FLASHCFGA_POW_Pos)                      /*!< CREG FLASHCFGA: POW Mask                */

/* -------------------------------  CREG_FLASHCFGB  ------------------------------- */
#define CREG_FLASHCFGB_FLASHTIM_Pos           12                                                      /*!< CREG FLASHCFGB: FLASHTIM Position       */
#define CREG_FLASHCFGB_FLASHTIM_Msk           (0x0fUL << CREG_FLASHCFGB_FLASHTIM_Pos)                 /*!< CREG FLASHCFGB: FLASHTIM Mask           */
#define CREG_FLASHCFGB_POW_Pos                31                                                      /*!< CREG FLASHCFGB: POW Position            */
#define CREG_FLASHCFGB_POW_Msk                (0x01UL << CREG_FLASHCFGB_POW_Pos)                      /*!< CREG FLASHCFGB: POW Mask                */

/* ---------------------------------  CREG_ETBCFG  -------------------------------- */
#define CREG_ETBCFG_ETB_Pos                   0                                                       /*!< CREG ETBCFG: ETB Position               */
#define CREG_ETBCFG_ETB_Msk                   (0x01UL << CREG_ETBCFG_ETB_Pos)                         /*!< CREG ETBCFG: ETB Mask                   */

/* ---------------------------------  CREG_CREG6  --------------------------------- */
#define CREG_CREG6_ETHMODE_Pos                0                                                       /*!< CREG CREG6: ETHMODE Position            */
#define CREG_CREG6_ETHMODE_Msk                (0x07UL << CREG_CREG6_ETHMODE_Pos)                      /*!< CREG CREG6: ETHMODE Mask                */
#define CREG_CREG6_CTOUTCTRL_Pos              4                                                       /*!< CREG CREG6: CTOUTCTRL Position          */
#define CREG_CREG6_CTOUTCTRL_Msk              (0x01UL << CREG_CREG6_CTOUTCTRL_Pos)                    /*!< CREG CREG6: CTOUTCTRL Mask              */
#define CREG_CREG6_I2S0_TX_SCK_IN_SEL_Pos     12                                                      /*!< CREG CREG6: I2S0_TX_SCK_IN_SEL Position */
#define CREG_CREG6_I2S0_TX_SCK_IN_SEL_Msk     (0x01UL << CREG_CREG6_I2S0_TX_SCK_IN_SEL_Pos)           /*!< CREG CREG6: I2S0_TX_SCK_IN_SEL Mask     */
#define CREG_CREG6_I2S0_RX_SCK_IN_SEL_Pos     13                                                      /*!< CREG CREG6: I2S0_RX_SCK_IN_SEL Position */
#define CREG_CREG6_I2S0_RX_SCK_IN_SEL_Msk     (0x01UL << CREG_CREG6_I2S0_RX_SCK_IN_SEL_Pos)           /*!< CREG CREG6: I2S0_RX_SCK_IN_SEL Mask     */
#define CREG_CREG6_I2S1_TX_SCK_IN_SEL_Pos     14                                                      /*!< CREG CREG6: I2S1_TX_SCK_IN_SEL Position */
#define CREG_CREG6_I2S1_TX_SCK_IN_SEL_Msk     (0x01UL << CREG_CREG6_I2S1_TX_SCK_IN_SEL_Pos)           /*!< CREG CREG6: I2S1_TX_SCK_IN_SEL Mask     */
#define CREG_CREG6_I2S1_RX_SCK_IN_SEL_Pos     15                                                      /*!< CREG CREG6: I2S1_RX_SCK_IN_SEL Position */
#define CREG_CREG6_I2S1_RX_SCK_IN_SEL_Msk     (0x01UL << CREG_CREG6_I2S1_RX_SCK_IN_SEL_Pos)           /*!< CREG CREG6: I2S1_RX_SCK_IN_SEL Mask     */
#define CREG_CREG6_EMC_CLK_SEL_Pos            16                                                      /*!< CREG CREG6: EMC_CLK_SEL Position        */
#define CREG_CREG6_EMC_CLK_SEL_Msk            (0x01UL << CREG_CREG6_EMC_CLK_SEL_Pos)                  /*!< CREG CREG6: EMC_CLK_SEL Mask            */

/* -------------------------------  CREG_M4TXEVENT  ------------------------------- */
#define CREG_M4TXEVENT_TXEVCLR_Pos            0                                                       /*!< CREG M4TXEVENT: TXEVCLR Position        */
#define CREG_M4TXEVENT_TXEVCLR_Msk            (0x01UL << CREG_M4TXEVENT_TXEVCLR_Pos)                  /*!< CREG M4TXEVENT: TXEVCLR Mask            */

/* ---------------------------------  CREG_CHIPID  -------------------------------- */
#define CREG_CHIPID_ID_Pos                    0                                                       /*!< CREG CHIPID: ID Position                */
#define CREG_CHIPID_ID_Msk                    (0xffffffffUL << CREG_CHIPID_ID_Pos)                    /*!< CREG CHIPID: ID Mask                    */

/* ------------------------------  CREG_M0SUBMEMMAP  ------------------------------ */
#define CREG_M0SUBMEMMAP_M0SUBMAP_Pos         12                                                      /*!< CREG M0SUBMEMMAP: M0SUBMAP Position     */
#define CREG_M0SUBMEMMAP_M0SUBMAP_Msk         (0x000fffffUL << CREG_M0SUBMEMMAP_M0SUBMAP_Pos)         /*!< CREG M0SUBMEMMAP: M0SUBMAP Mask         */

/* ------------------------------  CREG_M0SUBTXEVENT  ----------------------------- */
#define CREG_M0SUBTXEVENT_TXEVCLR_Pos         0                                                       /*!< CREG M0SUBTXEVENT: TXEVCLR Position     */
#define CREG_M0SUBTXEVENT_TXEVCLR_Msk         (0x01UL << CREG_M0SUBTXEVENT_TXEVCLR_Pos)               /*!< CREG M0SUBTXEVENT: TXEVCLR Mask         */

/* ------------------------------  CREG_M0APPTXEVENT  ----------------------------- */
#define CREG_M0APPTXEVENT_TXEVCLR_Pos         0                                                       /*!< CREG M0APPTXEVENT: TXEVCLR Position     */
#define CREG_M0APPTXEVENT_TXEVCLR_Msk         (0x01UL << CREG_M0APPTXEVENT_TXEVCLR_Pos)               /*!< CREG M0APPTXEVENT: TXEVCLR Mask         */

/* ------------------------------  CREG_M0APPMEMMAP  ------------------------------ */
#define CREG_M0APPMEMMAP_M0APPMAP_Pos         12                                                      /*!< CREG M0APPMEMMAP: M0APPMAP Position     */
#define CREG_M0APPMEMMAP_M0APPMAP_Msk         (0x000fffffUL << CREG_M0APPMEMMAP_M0APPMAP_Pos)         /*!< CREG M0APPMEMMAP: M0APPMAP Mask         */

/* -------------------------------  CREG_USB0FLADJ  ------------------------------- */
#define CREG_USB0FLADJ_FLTV_Pos               0                                                       /*!< CREG USB0FLADJ: FLTV Position           */
#define CREG_USB0FLADJ_FLTV_Msk               (0x3fUL << CREG_USB0FLADJ_FLTV_Pos)                     /*!< CREG USB0FLADJ: FLTV Mask               */

/* -------------------------------  CREG_USB1FLADJ  ------------------------------- */
#define CREG_USB1FLADJ_FLTV_Pos               0                                                       /*!< CREG USB1FLADJ: FLTV Position           */
#define CREG_USB1FLADJ_FLTV_Msk               (0x3fUL << CREG_USB1FLADJ_FLTV_Pos)                     /*!< CREG USB1FLADJ: FLTV Mask               */


/* ================================================================================ */
/* ================      struct 'EVENTROUTER' Position & Mask      ================ */
/* ================================================================================ */


