roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  EVENTROUTER_CLR_EN  ----------------------------- */
#define EVENTROUTER_CLR_EN_WAKEUP0_CLREN_Pos  0                                                       /*!< EVENTROUTER CLR_EN: WAKEUP0_CLREN Position */
#define EVENTROUTER_CLR_EN_WAKEUP0_CLREN_Msk  (0x01UL << EVENTROUTER_CLR_EN_WAKEUP0_CLREN_Pos)        /*!< EVENTROUTER CLR_EN: WAKEUP0_CLREN Mask  */
#define EVENTROUTER_CLR_EN_WAKEUP1_CLREN_Pos  1                                                       /*!< EVENTROUTER CLR_EN: WAKEUP1_CLREN Position */
#define EVENTROUTER_CLR_EN_WAKEUP1_CLREN_Msk  (0x01UL << EVENTROUTER_CLR_EN_WAKEUP1_CLREN_Pos)        /*!< EVENTROUTER CLR_EN: WAKEUP1_CLREN Mask  */
#define EVENTROUTER_CLR_EN_WAKEUP2_CLREN_Pos  2                                                       /*!< EVENTROUTER CLR_EN: WAKEUP2_CLREN Position */
#define EVENTROUTER_CLR_EN_WAKEUP2_CLREN_Msk  (0x01UL << EVENTROUTER_CLR_EN_WAKEUP2_CLREN_Pos)        /*!< EVENTROUTER CLR_EN: WAKEUP2_CLREN Mask  */
#define EVENTROUTER_CLR_EN_WAKEUP3_CLREN_Pos  3                                                       /*!< EVENTROUTER CLR_EN: WAKEUP3_CLREN Position */
#define EVENTROUTER_CLR_EN_WAKEUP3_CLREN_Msk  (0x01UL << EVENTROUTER_CLR_EN_WAKEUP3_CLREN_Pos)        /*!< EVENTROUTER CLR_EN: WAKEUP3_CLREN Mask  */
#define EVENTROUTER_CLR_EN_ATIMER_CLREN_Pos   4                                                       /*!< EVENTROUTER CLR_EN: ATIMER_CLREN Position */
#define EVENTROUTER_CLR_EN_ATIMER_CLREN_Msk   (0x01UL << EVENTROUTER_CLR_EN_ATIMER_CLREN_Pos)         /*!< EVENTROUTER CLR_EN: ATIMER_CLREN Mask   */
#define EVENTROUTER_CLR_EN_RTC_CLREN_Pos      5                                                       /*!< EVENTROUTER CLR_EN: RTC_CLREN Position  */
#define EVENTROUTER_CLR_EN_RTC_CLREN_Msk      (0x01UL << EVENTROUTER_CLR_EN_RTC_CLREN_Pos)            /*!< EVENTROUTER CLR_EN: RTC_CLREN Mask      */
#define EVENTROUTER_CLR_EN_BOD_CLREN_Pos      6                                                       /*!< EVENTROUTER CLR_EN: BOD_CLREN Position  */
#define EVENTROUTER_CLR_EN_BOD_CLREN_Msk      (0x01UL << EVENTROUTER_CLR_EN_BOD_CLREN_Pos)            /*!< EVENTROUTER CLR_EN: BOD_CLREN Mask      */
#define EVENTROUTER_CLR_EN_WWDT_CLREN_Pos     7                                                       /*!< EVENTROUTER CLR_EN: WWDT_CLREN Position */
#define EVENTROUTER_CLR_EN_WWDT_CLREN_Msk     (0x01UL << EVENTROUTER_CLR_EN_WWDT_CLREN_Pos)           /*!< EVENTROUTER CLR_EN: WWDT_CLREN Mask     */
#define EVENTROUTER_CLR_EN_ETH_CLREN_Pos      8                                                       /*!< EVENTROUTER CLR_EN: ETH_CLREN Position  */
#define EVENTROUTER_CLR_EN_ETH_CLREN_Msk      (0x01UL << EVENTROUTER_CLR_EN_ETH_CLREN_Pos)            /*!< EVENTROUTER CLR_EN: ETH_CLREN Mask      */
#define EVENTROUTER_CLR_EN_USB0_CLREN_Pos     9                                                       /*!< EVENTROUTER CLR_EN: USB0_CLREN Position */
#define EVENTROUTER_CLR_EN_USB0_CLREN_Msk     (0x01UL << EVENTROUTER_CLR_EN_USB0_CLREN_Pos)           /*!< EVENTROUTER CLR_EN: USB0_CLREN Mask     */
#define EVENTROUTER_CLR_EN_USB1_CLREN_Pos     10                                                      /*!< EVENTROUTER CLR_EN: USB1_CLREN Position */
#define EVENTROUTER_CLR_EN_USB1_CLREN_Msk     (0x01UL << EVENTROUTER_CLR_EN_USB1_CLREN_Pos)           /*!< EVENTROUTER CLR_EN: USB1_CLREN Mask     */
#define EVENTROUTER_CLR_EN_SDMMC_CLREN_Pos    11                                                      /*!< EVENTROUTER CLR_EN: SDMMC_CLREN Position */
#define EVENTROUTER_CLR_EN_SDMMC_CLREN_Msk    (0x01UL << EVENTROUTER_CLR_EN_SDMMC_CLREN_Pos)          /*!< EVENTROUTER CLR_EN: SDMMC_CLREN Mask    */
#define EVENTROUTER_CLR_EN_CAN_CLREN_Pos      12                                                      /*!< EVENTROUTER CLR_EN: CAN_CLREN Position  */
#define EVENTROUTER_CLR_EN_CAN_CLREN_Msk      (0x01UL << EVENTROUTER_CLR_EN_CAN_CLREN_Pos)            /*!< EVENTROUTER CLR_EN: CAN_CLREN Mask      */
#define EVENTROUTER_CLR_EN_TIM2_CLREN_Pos     13                                                      /*!< EVENTROUTER CLR_EN: TIM2_CLREN Position */
#define EVENTROUTER_CLR_EN_TIM2_CLREN_Msk     (0x01UL << EVENTROUTER_CLR_EN_TIM2_CLREN_Pos)           /*!< EVENTROUTER CLR_EN: TIM2_CLREN Mask     */
#define EVENTROUTER_CLR_EN_TIM6_CLREN_Pos     14                                                      /*!< EVENTROUTER CLR_EN: TIM6_CLREN Position */
#define EVENTROUTER_CLR_EN_TIM6_CLREN_Msk     (0x01UL << EVENTROUTER_CLR_EN_TIM6_CLREN_Pos)           /*!< EVENTROUTER CLR_EN: TIM6_CLREN Mask     */
#define EVENTROUTER_CLR_EN_QEI_CLREN_Pos      15                                                      /*!< EVENTROUTER CLR_EN: QEI_CLREN Position  */
#define EVENTROUTER_CLR_EN_QEI_CLREN_Msk      (0x01UL << EVENTROUTER_CLR_EN_QEI_CLREN_Pos)            /*!< EVENTROUTER CLR_EN: QEI_CLREN Mask      */
#define EVENTROUTER_CLR_EN_TIM14_CLREN_Pos    16                                                      /*!< EVENTROUTER CLR_EN: TIM14_CLREN Position */
#define EVENTROUTER_CLR_EN_TIM14_CLREN_Msk    (0x01UL << EVENTROUTER_CLR_EN_TIM14_CLREN_Pos)          /*!< EVENTROUTER CLR_EN: TIM14_CLREN Mask    */
#define EVENTROUTER_CLR_EN_RESET_CLREN_Pos    19                                                      /*!< EVENTROUTER CLR_EN: RESET_CLREN Position */
#define EVENTROUTER_CLR_EN_RESET_CLREN_Msk    (0x01UL << EVENTROUTER_CLR_EN_RESET_CLREN_Pos)          /*!< EVENTROUTER CLR_EN: RESET_CLREN Mask    */
#define EVENTROUTER_CLR_EN_BODRESET_CLREN_Pos 20                                                      /*!< EVENTROUTER CLR_EN: BODRESET_CLREN Position */
#define EVENTROUTER_CLR_EN_BODRESET_CLREN_Msk (0x01UL << EVENTROUTER_CLR_EN_BODRESET_CLREN_Pos)       /*!< EVENTROUTER CLR_EN: BODRESET_CLREN Mask */
#define EVENTROUTER_CLR_EN_DPDRESET_CLREN_Pos 21                                                      /*!< EVENTROUTER CLR_EN: DPDRESET_CLREN Position */
#define EVENTROUTER_CLR_EN_DPDRESET_CLREN_Msk (0x01UL << EVENTROUTER_CLR_EN_DPDRESET_CLREN_Pos)       /*!< EVENTROUTER CLR_EN: DPDRESET_CLREN Mask */

/* -----------------------------  EVENTROUTER_SET_EN  ----------------------------- */
#define EVENTROUTER_SET_EN_WAKEUP0_SETEN_Pos  0                                                       /*!< EVENTROUTER SET_EN: WAKEUP0_SETEN Position */
#define EVENTROUTER_SET_EN_WAKEUP0_SETEN_Msk  (0x01UL << EVENTROUTER_SET_EN_WAKEUP0_SETEN_Pos)        /*!< EVENTROUTER SET_EN: WAKEUP0_SETEN Mask  */
#define EVENTROUTER_SET_EN_WAKEUP1_SETEN_Pos  1                                                       /*!< EVENTROUTER SET_EN: WAKEUP1_SETEN Position */
#define EVENTROUTER_SET_EN_WAKEUP1_SETEN_Msk  (0x01UL << EVENTROUTER_SET_EN_WAKEUP1_SETEN_Pos)        /*!< EVENTROUTER SET_EN: WAKEUP1_SETEN Mask  */
#define EVENTROUTER_SET_EN_WAKEUP2_SETEN_Pos  2                                                       /*!< EVENTROUTER SET_EN: WAKEUP2_SETEN Position */
#define EVENTROUTER_SET_EN_WAKEUP2_SETEN_Msk  (0x01UL << EVENTROUTER_SET_EN_WAKEUP2_SETEN_Pos)        /*!< EVENTROUTER SET_EN: WAKEUP2_SETEN Mask  */
#define EVENTROUTER_SET_EN_WAKEUP3_SETEN_Pos  3                                                       /*!< EVENTROUTER SET_EN: WAKEUP3_SETEN Position */
#define EVENTROUTER_SET_EN_WAKEUP3_SETEN_Msk  (0x01UL << EVENTROUTER_SET_EN_WAKEUP3_SETEN_Pos)        /*!< EVENTROUTER SET_EN: WAKEUP3_SETEN Mask  */
#define EVENTROUTER_SET_EN_ATIMER_SETEN_Pos   4                                                       /*!< EVENTROUTER SET_EN: ATIMER_SETEN Position */
#define EVENTROUTER_SET_EN_ATIMER_SETEN_Msk   (0x01UL << EVENTROUTER_SET_EN_ATIMER_SETEN_Pos)         /*!< EVENTROUTER SET_EN: ATIMER_SETEN Mask   */
#define EVENTROUTER_SET_EN_RTC_SETEN_Pos      5                                                       /*!< EVENTROUTER SET_EN: RTC_SETEN Position  */
#define EVENTROUTER_SET_EN_RTC_SETEN_Msk      (0x01UL << EVENTROUTER_SET_EN_RTC_SETEN_Pos)            /*!< EVENTROUTER SET_EN: RTC_SETEN Mask      */
#define EVENTROUTER_SET_EN_BOD_SETEN_Pos      6                                                       /*!< EVENTROUTER SET_EN: BOD_SETEN Position  */
#define EVENTROUTER_SET_EN_BOD_SETEN_Msk      (0x01UL << EVENTROUTER_SET_EN_BOD_SETEN_Pos)            /*!< EVENTROUTER SET_EN: BOD_SETEN Mask      */
#define EVENTROUTER_SET_EN_WWDT_SETEN_Pos     7                                                       /*!< EVENTROUTER SET_EN: WWDT_SETEN Position */
#define EVENTROUTER_SET_EN_WWDT_SETEN_Msk     (0x01UL << EVENTROUTER_SET_EN_WWDT_SETEN_Pos)           /*!< EVENTROUTER SET_EN: WWDT_SETEN Mask     */
#define EVENTROUTER_SET_EN_ETH_SETEN_Pos      8                                                       /*!< EVENTROUTER SET_EN: ETH_SETEN Position  */
#define EVENTROUTER_SET_EN_ETH_SETEN_Msk      (0x01UL << EVENTROUTER_SET_EN_ETH_SETEN_Pos)            /*!< EVENTROUTER SET_EN: ETH_SETEN Mask      */
#define EVENTROUTER_SET_EN_USB0_SETEN_Pos     9                                                       /*!< EVENTROUTER SET_EN: USB0_SETEN Position */
#define EVENTROUTER_SET_EN_USB0_SETEN_Msk     (0x01UL << EVENTROUTER_SET_EN_USB0_SETEN_Pos)           /*!< EVENTROUTER SET_EN: USB0_SETEN Mask     */
#define EVENTROUTER_SET_EN_USB1_SETEN_Pos     10                                                      /*!< EVENTROUTER SET_EN: USB1_SETEN Position */
#define EVENTROUTER_SET_EN_USB1_SETEN_Msk     (0x01UL << EVENTROUTER_SET_EN_USB1_SETEN_Pos)           /*!< EVENTROUTER SET_EN: USB1_SETEN Mask     */
#define EVENTROUTER_SET_EN_SDMMC_SETEN_Pos    11                                                      /*!< EVENTROUTER SET_EN: SDMMC_SETEN Position */
#define EVENTROUTER_SET_EN_SDMMC_SETEN_Msk    (0x01UL << EVENTROUTER_SET_EN_SDMMC_SETEN_Pos)          /*!< EVENTROUTER SET_EN: SDMMC_SETEN Mask    */
#define EVENTROUTER_SET_EN_CAN_SETEN_Pos      12                                                      /*!< EVENTROUTER SET_EN: CAN_SETEN Position  */
#define EVENTROUTER_SET_EN_CAN_SETEN_Msk      (0x01UL << EVENTROUTER_SET_EN_CAN_SETEN_Pos)            /*!< EVENTROUTER SET_EN: CAN_SETEN Mask      */
#define EVENTROUTER_SET_EN_TIM2_SETEN_Pos     13                                                      /*!< EVENTROUTER SET_EN: TIM2_SETEN Position */
#define EVENTROUTER_SET_EN_TIM2_SETEN_Msk     (0x01UL << EVENTROUTER_SET_EN_TIM2_SETEN_Pos)           /*!< EVENTROUTER SET_EN: TIM2_SETEN Mask     */
#define EVENTROUTER_SET_EN_TIM6_SETEN_Pos     14                                                      /*!< EVENTROUTER SET_EN: TIM6_SETEN Position */
#define EVENTROUTER_SET_EN_TIM6_SETEN_Msk     (0x01UL << EVENTROUTER_SET_EN_TIM6_SETEN_Pos)           /*!< EVENTROUTER SET_EN: TIM6_SETEN Mask     */
#define EVENTROUTER_SET_EN_QEI_SETEN_Pos      15                                                      /*!< EVENTROUTER SET_EN: QEI_SETEN Position  */
#define EVENTROUTER_SET_EN_QEI_SETEN_Msk      (0x01UL << EVENTROUTER_SET_EN_QEI_SETEN_Pos)            /*!< EVENTROUTER SET_EN: QEI_SETEN Mask      */
#define EVENTROUTER_SET_EN_TIM14_SETEN_Pos    16                                                      /*!< EVENTROUTER SET_EN: TIM14_SETEN Position */
#define EVENTROUTER_SET_EN_TIM14_SETEN_Msk    (0x01UL << EVENTROUTER_SET_EN_TIM14_SETEN_Pos)          /*!< EVENTROUTER SET_EN: TIM14_SETEN Mask    */
#define EVENTROUTER_SET_EN_RESET_SETEN_Pos    19                                                      /*!< EVENTROUTER SET_EN: RESET_SETEN Position */
#define EVENTROUTER_SET_EN_RESET_SETEN_Msk    (0x01UL << EVENTROUTER_SET_EN_RESET_SETEN_Pos)          /*!< EVENTROUTER SET_EN: RESET_SETEN Mask    */
#define EVENTROUTER_SET_EN_BODRESET_SETEN_Pos 20                                                      /*!< EVENTROUTER SET_EN: BODRESET_SETEN Position */
#define EVENTROUTER_SET_EN_BODRESET_SETEN_Msk (0x01UL << EVENTROUTER_SET_EN_BODRESET_SETEN_Pos)       /*!< EVENTROUTER SET_EN: BODRESET_SETEN Mask */
#define EVENTROUTER_SET_EN_DPDRESET_SETEN_Pos 21                                                      /*!< EVENTROUTER SET_EN: DPDRESET_SETEN Position */
#define EVENTROUTER_SET_EN_DPDRESET_SETEN_Msk (0x01UL << EVENTROUTER_SET_EN_DPDRESET_SETEN_Pos)       /*!< EVENTROUTER SET_EN: DPDRESET_SETEN Mask */

/* -----------------------------  EVENTROUTER_STATUS  ----------------------------- */
#define EVENTROUTER_STATUS_WAKEUP0_ST_Pos     0                                                       /*!< EVENTROUTER STATUS: WAKEUP0_ST Position */
#define EVENTROUTER_STATUS_WAKEUP0_ST_Msk     (0x01UL << EVENTROUTER_STATUS_WAKEUP0_ST_Pos)           /*!< EVENTROUTER STATUS: WAKEUP0_ST Mask     */
#define EVENTROUTER_STATUS_WAKEUP1_ST_Pos     1                                                       /*!< EVENTROUTER STATUS: WAKEUP1_ST Position */
#define EVENTROUTER_STATUS_WAKEUP1_ST_Msk     (0x01UL << EVENTROUTER_STATUS_WAKEUP1_ST_Pos)           /*!< EVENTROUTER STATUS: WAKEUP1_ST Mask     */
#define EVENTROUTER_STATUS_WAKEUP2_ST_Pos     2                                                       /*!< EVENTROUTER STATUS: WAKEUP2_ST Position */
#define EVENTROUTER_STATUS_WAKEUP2_ST_Msk     (0x01UL << EVENTROUTER_STATUS_WAKEUP2_ST_Pos)           /*!< EVENTROUTER STATUS: WAKEUP2_ST Mask     */
#define EVENTROUTER_STATUS_WAKEUP3_ST_Pos     3                                                       /*!< EVENTROUTER STATUS: WAKEUP3_ST Position */
#define EVENTROUTER_STATUS_WAKEUP3_ST_Msk     (0x01UL << EVENTROUTER_STATUS_WAKEUP3_ST_Pos)           /*!< EVENTROUTER STATUS: WAKEUP3_ST Mask     */
#define EVENTROUTER_STATUS_ATIMER_ST_Pos      4                                                       /*!< EVENTROUTER STATUS: ATIMER_ST Position  */
#define EVENTROUTER_STATUS_ATIMER_ST_Msk      (0x01UL << EVENTROUTER_STATUS_ATIMER_ST_Pos)            /*!< EVENTROUTER STATUS: ATIMER_ST Mask      */
#define EVENTROUTER_STATUS_RTC_ST_Pos         5                                                       /*!< EVENTROUTER STATUS: RTC_ST Position     */
#define EVENTROUTER_STATUS_RTC_ST_Msk         (0x01UL << EVENTROUTER_STATUS_RTC_ST_Pos)               /*!< EVENTROUTER STATUS: RTC_ST Mask         */
#define EVENTROUTER_STATUS_BOD_ST_Pos         6                                                       /*!< EVENTROUTER STATUS: BOD_ST Position     */
#define EVENTROUTER_STATUS_BOD_ST_Msk         (0x01UL << EVENTROUTER_STATUS_BOD_ST_Pos)               /*!< EVENTROUTER STATUS: BOD_ST Mask         */
#define EVENTROUTER_STATUS_WWDT_ST_Pos        7                                                       /*!< EVENTROUTER STATUS: WWDT_ST Position    */
#define EVENTROUTER_STATUS_WWDT_ST_Msk        (0x01UL << EVENTROUTER_STATUS_WWDT_ST_Pos)              /*!< EVENTROUTER STATUS: WWDT_ST Mask        */
#define EVENTROUTER_STATUS_ETH_ST_Pos         8                                                       /*!< EVENTROUTER STATUS: ETH_ST Position     */
#define EVENTROUTER_STATUS_ETH_ST_Msk         (0x01UL << EVENTROUTER_STATUS_ETH_ST_Pos)               /*!< EVENTROUTER STATUS: ETH_ST Mask         */
#define EVENTROUTER_STATUS_USB0_ST_Pos        9                                                       /*!< EVENTROUTER STATUS: USB0_ST Position    */
#define EVENTROUTER_STATUS_USB0_ST_Msk        (0x01UL << EVENTROUTER_STATUS_USB0_ST_Pos)              /*!< EVENTROUTER STATUS: USB0_ST Mask        */
#define EVENTROUTER_STATUS_USB1_ST_Pos        10                                                      /*!< EVENTROUTER STATUS: USB1_ST Position    */
#define EVENTROUTER_STATUS_USB1_ST_Msk        (0x01UL << EVENTROUTER_STATUS_USB1_ST_Pos)              /*!< EVENTROUTER STATUS: USB1_ST Mask        */
#define EVENTROUTER_STATUS_SDMMC_ST_Pos       11                                                      /*!< EVENTROUTER STATUS: SDMMC_ST Position   */
#define EVENTROUTER_STATUS_SDMMC_ST_Msk       (0x01UL << EVENTROUTER_STATUS_SDMMC_ST_Pos)             /*!< EVENTROUTER STATUS: SDMMC_ST Mask       */
#define EVENTROUTER_STATUS_CAN_ST_Pos         12                                                      /*!< EVENTROUTER STATUS: CAN_ST Position     */
#define EVENTROUTER_STATUS_CAN_ST_Msk         (0x01UL << EVENTROUTER_STATUS_CAN_ST_Pos)               /*!< EVENTROUTER STATUS: CAN_ST Mask         */
#define EVENTROUTER_STATUS_TIM2_ST_Pos        13                                                      /*!< EVENTROUTER STATUS: TIM2_ST Position    */
#define EVENTROUTER_STATUS_TIM2_ST_Msk        (0x01UL << EVENTROUTER_STATUS_TIM2_ST_Pos)              /*!< EVENTROUTER STATUS: TIM2_ST Mask        */
#define EVENTROUTER_STATUS_TIM6_ST_Pos        14                                                      /*!< EVENTROUTER STATUS: TIM6_ST Position    */
#define EVENTROUTER_STATUS_TIM6_ST_Msk        (0x01UL << EVENTROUTER_STATUS_TIM6_ST_Pos)              /*!< EVENTROUTER STATUS: TIM6_ST Mask        */
#define EVENTROUTER_STATUS_QEI_ST_Pos         15                                                      /*!< EVENTROUTER STATUS: QEI_ST Position     */
#define EVENTROUTER_STATUS_QEI_ST_Msk         (0x01UL << EVENTROUTER_STATUS_QEI_ST_Pos)               /*!< EVENTROUTER STATUS: QEI_ST Mask         */
#define EVENTROUTER_STATUS_TIM14_ST_Pos       16                                                      /*!< EVENTROUTER STATUS: TIM14_ST Position   */
#define EVENTROUTER_STATUS_TIM14_ST_Msk       (0x01UL << EVENTROUTER_STATUS_TIM14_ST_Pos)             /*!< EVENTROUTER STATUS: TIM14_ST Mask       */
#define EVENTROUTER_STATUS_RESET_ST_Pos       19                                                      /*!< EVENTROUTER STATUS: RESET_ST Position   */
#define EVENTROUTER_STATUS_RESET_ST_Msk       (0x01UL << EVENTROUTER_STATUS_RESET_ST_Pos)             /*!< EVENTROUTER STATUS: RESET_ST Mask       */
#define EVENTROUTER_STATUS_BODRESET_ST_Pos    20                                                      /*!< EVENTROUTER STATUS: BODRESET_ST Position */
#define EVENTROUTER_STATUS_BODRESET_ST_Msk    (0x01UL << EVENTROUTER_STATUS_BODRESET_ST_Pos)          /*!< EVENTROUTER STATUS: BODRESET_ST Mask    */
#define EVENTROUTER_STATUS_DPDRESET_ST_Pos    21                                                      /*!< EVENTROUTER STATUS: DPDRESET_ST Position */
#define EVENTROUTER_STATUS_DPDRESET_ST_Msk    (0x01UL << EVENTROUTER_STATUS_DPDRESET_ST_Pos)          /*!< EVENTROUTER STATUS: DPDRESET_ST Mask    */

