roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------------  RTC_ILR  ---------------------------------- */
#define RTC_ILR_RTCCIF_Pos                    0                                                       /*!< RTC ILR: RTCCIF Position                */
#define RTC_ILR_RTCCIF_Msk                    (0x01UL << RTC_ILR_RTCCIF_Pos)                          /*!< RTC ILR: RTCCIF Mask                    */
#define RTC_ILR_RTCALF_Pos                    1                                                       /*!< RTC ILR: RTCALF Position                */
#define RTC_ILR_RTCALF_Msk                    (0x01UL << RTC_ILR_RTCALF_Pos)                          /*!< RTC ILR: RTCALF Mask                    */

/* -----------------------------------  RTC_CCR  ---------------------------------- */
#define RTC_CCR_CLKEN_Pos                     0                                                       /*!< RTC CCR: CLKEN Position                 */
#define RTC_CCR_CLKEN_Msk                     (0x01UL << RTC_CCR_CLKEN_Pos)                           /*!< RTC CCR: CLKEN Mask                     */
#define RTC_CCR_CTCRST_Pos                    1                                                       /*!< RTC CCR: CTCRST Position                */
#define RTC_CCR_CTCRST_Msk                    (0x01UL << RTC_CCR_CTCRST_Pos)                          /*!< RTC CCR: CTCRST Mask                    */
#define RTC_CCR_CCALEN_Pos                    4                                                       /*!< RTC CCR: CCALEN Position                */
#define RTC_CCR_CCALEN_Msk                    (0x01UL << RTC_CCR_CCALEN_Pos)                          /*!< RTC CCR: CCALEN Mask                    */

/* ----------------------------------  RTC_CIIR  ---------------------------------- */
#define RTC_CIIR_IMSEC_Pos                    0                                                       /*!< RTC CIIR: IMSEC Position                */
#define RTC_CIIR_IMSEC_Msk                    (0x01UL << RTC_CIIR_IMSEC_Pos)                          /*!< RTC CIIR: IMSEC Mask                    */
#define RTC_CIIR_IMMIN_Pos                    1                                                       /*!< RTC CIIR: IMMIN Position                */
#define RTC_CIIR_IMMIN_Msk                    (0x01UL << RTC_CIIR_IMMIN_Pos)                          /*!< RTC CIIR: IMMIN Mask                    */
#define RTC_CIIR_IMHOUR_Pos                   2                                                       /*!< RTC CIIR: IMHOUR Position               */
#define RTC_CIIR_IMHOUR_Msk                   (0x01UL << RTC_CIIR_IMHOUR_Pos)                         /*!< RTC CIIR: IMHOUR Mask                   */
#define RTC_CIIR_IMDOM_Pos                    3                                                       /*!< RTC CIIR: IMDOM Position                */
#define RTC_CIIR_IMDOM_Msk                    (0x01UL << RTC_CIIR_IMDOM_Pos)                          /*!< RTC CIIR: IMDOM Mask                    */
#define RTC_CIIR_IMDOW_Pos                    4                                                       /*!< RTC CIIR: IMDOW Position                */
#define RTC_CIIR_IMDOW_Msk                    (0x01UL << RTC_CIIR_IMDOW_Pos)                          /*!< RTC CIIR: IMDOW Mask                    */
#define RTC_CIIR_IMDOY_Pos                    5                                                       /*!< RTC CIIR: IMDOY Position                */
#define RTC_CIIR_IMDOY_Msk                    (0x01UL << RTC_CIIR_IMDOY_Pos)                          /*!< RTC CIIR: IMDOY Mask                    */
#define RTC_CIIR_IMMON_Pos                    6                                                       /*!< RTC CIIR: IMMON Position                */
#define RTC_CIIR_IMMON_Msk                    (0x01UL << RTC_CIIR_IMMON_Pos)                          /*!< RTC CIIR: IMMON Mask                    */
#define RTC_CIIR_IMYEAR_Pos                   7                                                       /*!< RTC CIIR: IMYEAR Position               */
#define RTC_CIIR_IMYEAR_Msk                   (0x01UL << RTC_CIIR_IMYEAR_Pos)                         /*!< RTC CIIR: IMYEAR Mask                   */

/* -----------------------------------  RTC_AMR  ---------------------------------- */
#define RTC_AMR_AMRSEC_Pos                    0                                                       /*!< RTC AMR: AMRSEC Position                */
#define RTC_AMR_AMRSEC_Msk                    (0x01UL << RTC_AMR_AMRSEC_Pos)                          /*!< RTC AMR: AMRSEC Mask                    */
#define RTC_AMR_AMRMIN_Pos                    1                                                       /*!< RTC AMR: AMRMIN Position                */
#define RTC_AMR_AMRMIN_Msk                    (0x01UL << RTC_AMR_AMRMIN_Pos)                          /*!< RTC AMR: AMRMIN Mask                    */
#define RTC_AMR_AMRHOUR_Pos                   2                                                       /*!< RTC AMR: AMRHOUR Position               */
#define RTC_AMR_AMRHOUR_Msk                   (0x01UL << RTC_AMR_AMRHOUR_Pos)                         /*!< RTC AMR: AMRHOUR Mask                   */
#define RTC_AMR_AMRDOM_Pos                    3                                                       /*!< RTC AMR: AMRDOM Position                */
#define RTC_AMR_AMRDOM_Msk                    (0x01UL << RTC_AMR_AMRDOM_Pos)                          /*!< RTC AMR: AMRDOM Mask                    */
#define RTC_AMR_AMRDOW_Pos                    4                                                       /*!< RTC AMR: AMRDOW Position                */
#define RTC_AMR_AMRDOW_Msk                    (0x01UL << RTC_AMR_AMRDOW_Pos)                          /*!< RTC AMR: AMRDOW Mask                    */
#define RTC_AMR_AMRDOY_Pos                    5                                                       /*!< RTC AMR: AMRDOY Position                */
#define RTC_AMR_AMRDOY_Msk                    (0x01UL << RTC_AMR_AMRDOY_Pos)                          /*!< RTC AMR: AMRDOY Mask                    */
#define RTC_AMR_AMRMON_Pos                    6                                                       /*!< RTC AMR: AMRMON Position                */
#define RTC_AMR_AMRMON_Msk                    (0x01UL << RTC_AMR_AMRMON_Pos)                          /*!< RTC AMR: AMRMON Mask                    */
#define RTC_AMR_AMRYEAR_Pos                   7                                                       /*!< RTC AMR: AMRYEAR Position               */
#define RTC_AMR_AMRYEAR_Msk                   (0x01UL << RTC_AMR_AMRYEAR_Pos)                         /*!< RTC AMR: AMRYEAR Mask                   */

