roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  RTC_CTIME0  --------------------------------- */
#define RTC_CTIME0_SECONDS_Pos                0                                                       /*!< RTC CTIME0: SECONDS Position            */
#define RTC_CTIME0_SECONDS_Msk                (0x3fUL << RTC_CTIME0_SECONDS_Pos)                      /*!< RTC CTIME0: SECONDS Mask                */
#define RTC_CTIME0_MINUTES_Pos                8                                                       /*!< RTC CTIME0: MINUTES Position            */
#define RTC_CTIME0_MINUTES_Msk                (0x3fUL << RTC_CTIME0_MINUTES_Pos)                      /*!< RTC CTIME0: MINUTES Mask                */
#define RTC_CTIME0_HOURS_Pos                  16                                                      /*!< RTC CTIME0: HOURS Position              */
#define RTC_CTIME0_HOURS_Msk                  (0x1fUL << RTC_CTIME0_HOURS_Pos)                        /*!< RTC CTIME0: HOURS Mask                  */
#define RTC_CTIME0_DOW_Pos                    24                                                      /*!< RTC CTIME0: DOW Position                */
#define RTC_CTIME0_DOW_Msk                    (0x07UL << RTC_CTIME0_DOW_Pos)                          /*!< RTC CTIME0: DOW Mask                    */

/* ---------------------------------  RTC_CTIME1  --------------------------------- */
#define RTC_CTIME1_DOM_Pos                    0                                                       /*!< RTC CTIME1: DOM Position                */
#define RTC_CTIME1_DOM_Msk                    (0x1fUL << RTC_CTIME1_DOM_Pos)                          /*!< RTC CTIME1: DOM Mask                    */
#define RTC_CTIME1_MONTH_Pos                  8                                                       /*!< RTC CTIME1: MONTH Position              */
#define RTC_CTIME1_MONTH_Msk                  (0x0fUL << RTC_CTIME1_MONTH_Pos)                        /*!< RTC CTIME1: MONTH Mask                  */
#define RTC_CTIME1_YEAR_Pos                   16                                                      /*!< RTC CTIME1: YEAR Position               */
#define RTC_CTIME1_YEAR_Msk                   (0x00000fffUL << RTC_CTIME1_YEAR_Pos)                   /*!< RTC CTIME1: YEAR Mask                   */

/* ---------------------------------  RTC_CTIME2  --------------------------------- */
#define RTC_CTIME2_DOY_Pos                    0                                                       /*!< RTC CTIME2: DOY Position                */
#define RTC_CTIME2_DOY_Msk                    (0x00000fffUL << RTC_CTIME2_DOY_Pos)                    /*!< RTC CTIME2: DOY Mask                    */

/* -----------------------------------  RTC_SEC  ---------------------------------- */
#define RTC_SEC_SECONDS_Pos                   0                                                       /*!< RTC SEC: SECONDS Position               */
#define RTC_SEC_SECONDS_Msk                   (0x3fUL << RTC_SEC_SECONDS_Pos)                         /*!< RTC SEC: SECONDS Mask                   */

/* -----------------------------------  RTC_MIN  ---------------------------------- */
#define RTC_MIN_MINUTES_Pos                   0                                                       /*!< RTC MIN: MINUTES Position               */
#define RTC_MIN_MINUTES_Msk                   (0x3fUL << RTC_MIN_MINUTES_Pos)                         /*!< RTC MIN: MINUTES Mask                   */

/* -----------------------------------  RTC_HRS  ---------------------------------- */
#define RTC_HRS_HOURS_Pos                     0                                                       /*!< RTC HRS: HOURS Position                 */
#define RTC_HRS_HOURS_Msk                     (0x1fUL << RTC_HRS_HOURS_Pos)                           /*!< RTC HRS: HOURS Mask                     */

/* -----------------------------------  RTC_DOM  ---------------------------------- */
#define RTC_DOM_DOM_Pos                       0                                                       /*!< RTC DOM: DOM Position                   */
#define RTC_DOM_DOM_Msk                       (0x1fUL << RTC_DOM_DOM_Pos)                             /*!< RTC DOM: DOM Mask                       */

/* -----------------------------------  RTC_DOW  ---------------------------------- */
#define RTC_DOW_DOW_Pos                       0                                                       /*!< RTC DOW: DOW Position                   */
#define RTC_DOW_DOW_Msk                       (0x07UL << RTC_DOW_DOW_Pos)                             /*!< RTC DOW: DOW Mask                       */

/* -----------------------------------  RTC_DOY  ---------------------------------- */
#define RTC_DOY_DOY_Pos                       0                                                       /*!< RTC DOY: DOY Position                   */
#define RTC_DOY_DOY_Msk                       (0x000001ffUL << RTC_DOY_DOY_Pos)                       /*!< RTC DOY: DOY Mask                       */

/* ----------------------------------  RTC_MONTH  --------------------------------- */
#define RTC_MONTH_MONTH_Pos                   0                                                       /*!< RTC MONTH: MONTH Position               */
#define RTC_MONTH_MONTH_Msk                   (0x0fUL << RTC_MONTH_MONTH_Pos)                         /*!< RTC MONTH: MONTH Mask                   */

/* ----------------------------------  RTC_YEAR  ---------------------------------- */
#define RTC_YEAR_YEAR_Pos                     0                                                       /*!< RTC YEAR: YEAR Position                 */
#define RTC_YEAR_YEAR_Msk                     (0x00000fffUL << RTC_YEAR_YEAR_Pos)                     /*!< RTC YEAR: YEAR Mask                     */

/* -------------------------------  RTC_CALIBRATION  ------------------------------ */
#define RTC_CALIBRATION_CALVAL_Pos            0                                                       /*!< RTC CALIBRATION: CALVAL Position        */
#define RTC_CALIBRATION_CALVAL_Msk            (0x0001ffffUL << RTC_CALIBRATION_CALVAL_Pos)            /*!< RTC CALIBRATION: CALVAL Mask            */
#define RTC_CALIBRATION_CALDIR_Pos            17                                                      /*!< RTC CALIBRATION: CALDIR Position        */
#define RTC_CALIBRATION_CALDIR_Msk            (0x01UL << RTC_CALIBRATION_CALDIR_Pos)                  /*!< RTC CALIBRATION: CALDIR Mask            */

