roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  CGU_IDIVB_CTRL  ------------------------------- */
#define CGU_IDIVB_CTRL_PD_Pos                 0                                                       /*!< CGU IDIVB_CTRL: PD Position             */
#define CGU_IDIVB_CTRL_PD_Msk                 (0x01UL << CGU_IDIVB_CTRL_PD_Pos)                       /*!< CGU IDIVB_CTRL: PD Mask                 */
#define CGU_IDIVB_CTRL_IDIV_Pos               2                                                       /*!< CGU IDIVB_CTRL: IDIV Position           */
#define CGU_IDIVB_CTRL_IDIV_Msk               (0x0fUL << CGU_IDIVB_CTRL_IDIV_Pos)                     /*!< CGU IDIVB_CTRL: IDIV Mask               */
#define CGU_IDIVB_CTRL_AUTOBLOCK_Pos          11                                                      /*!< CGU IDIVB_CTRL: AUTOBLOCK Position      */
#define CGU_IDIVB_CTRL_AUTOBLOCK_Msk          (0x01UL << CGU_IDIVB_CTRL_AUTOBLOCK_Pos)                /*!< CGU IDIVB_CTRL: AUTOBLOCK Mask          */
#define CGU_IDIVB_CTRL_CLK_SEL_Pos            24                                                      /*!< CGU IDIVB_CTRL: CLK_SEL Position        */
#define CGU_IDIVB_CTRL_CLK_SEL_Msk            (0x1fUL << CGU_IDIVB_CTRL_CLK_SEL_Pos)                  /*!< CGU IDIVB_CTRL: CLK_SEL Mask            */

/* -------------------------------  CGU_IDIVC_CTRL  ------------------------------- */
#define CGU_IDIVC_CTRL_PD_Pos                 0                                                       /*!< CGU IDIVC_CTRL: PD Position             */
#define CGU_IDIVC_CTRL_PD_Msk                 (0x01UL << CGU_IDIVC_CTRL_PD_Pos)                       /*!< CGU IDIVC_CTRL: PD Mask                 */
#define CGU_IDIVC_CTRL_IDIV_Pos               2                                                       /*!< CGU IDIVC_CTRL: IDIV Position           */
#define CGU_IDIVC_CTRL_IDIV_Msk               (0x0fUL << CGU_IDIVC_CTRL_IDIV_Pos)                     /*!< CGU IDIVC_CTRL: IDIV Mask               */
#define CGU_IDIVC_CTRL_AUTOBLOCK_Pos          11                                                      /*!< CGU IDIVC_CTRL: AUTOBLOCK Position      */
#define CGU_IDIVC_CTRL_AUTOBLOCK_Msk          (0x01UL << CGU_IDIVC_CTRL_AUTOBLOCK_Pos)                /*!< CGU IDIVC_CTRL: AUTOBLOCK Mask          */
#define CGU_IDIVC_CTRL_CLK_SEL_Pos            24                                                      /*!< CGU IDIVC_CTRL: CLK_SEL Position        */
#define CGU_IDIVC_CTRL_CLK_SEL_Msk            (0x1fUL << CGU_IDIVC_CTRL_CLK_SEL_Pos)                  /*!< CGU IDIVC_CTRL: CLK_SEL Mask            */

/* -------------------------------  CGU_IDIVD_CTRL  ------------------------------- */
#define CGU_IDIVD_CTRL_PD_Pos                 0                                                       /*!< CGU IDIVD_CTRL: PD Position             */
#define CGU_IDIVD_CTRL_PD_Msk                 (0x01UL << CGU_IDIVD_CTRL_PD_Pos)                       /*!< CGU IDIVD_CTRL: PD Mask                 */
#define CGU_IDIVD_CTRL_IDIV_Pos               2                                                       /*!< CGU IDIVD_CTRL: IDIV Position           */
#define CGU_IDIVD_CTRL_IDIV_Msk               (0x0fUL << CGU_IDIVD_CTRL_IDIV_Pos)                     /*!< CGU IDIVD_CTRL: IDIV Mask               */
#define CGU_IDIVD_CTRL_AUTOBLOCK_Pos          11                                                      /*!< CGU IDIVD_CTRL: AUTOBLOCK Position      */
#define CGU_IDIVD_CTRL_AUTOBLOCK_Msk          (0x01UL << CGU_IDIVD_CTRL_AUTOBLOCK_Pos)                /*!< CGU IDIVD_CTRL: AUTOBLOCK Mask          */
#define CGU_IDIVD_CTRL_CLK_SEL_Pos            24                                                      /*!< CGU IDIVD_CTRL: CLK_SEL Position        */
#define CGU_IDIVD_CTRL_CLK_SEL_Msk            (0x1fUL << CGU_IDIVD_CTRL_CLK_SEL_Pos)                  /*!< CGU IDIVD_CTRL: CLK_SEL Mask            */

/* -------------------------------  CGU_IDIVE_CTRL  ------------------------------- */
#define CGU_IDIVE_CTRL_PD_Pos                 0                                                       /*!< CGU IDIVE_CTRL: PD Position             */
#define CGU_IDIVE_CTRL_PD_Msk                 (0x01UL << CGU_IDIVE_CTRL_PD_Pos)                       /*!< CGU IDIVE_CTRL: PD Mask                 */
#define CGU_IDIVE_CTRL_IDIV_Pos               2                                                       /*!< CGU IDIVE_CTRL: IDIV Position           */
#define CGU_IDIVE_CTRL_IDIV_Msk               (0x000000ffUL << CGU_IDIVE_CTRL_IDIV_Pos)               /*!< CGU IDIVE_CTRL: IDIV Mask               */
#define CGU_IDIVE_CTRL_AUTOBLOCK_Pos          11                                                      /*!< CGU IDIVE_CTRL: AUTOBLOCK Position      */
#define CGU_IDIVE_CTRL_AUTOBLOCK_Msk          (0x01UL << CGU_IDIVE_CTRL_AUTOBLOCK_Pos)                /*!< CGU IDIVE_CTRL: AUTOBLOCK Mask          */
#define CGU_IDIVE_CTRL_CLK_SEL_Pos            24                                                      /*!< CGU IDIVE_CTRL: CLK_SEL Position        */
#define CGU_IDIVE_CTRL_CLK_SEL_Msk            (0x1fUL << CGU_IDIVE_CTRL_CLK_SEL_Pos)                  /*!< CGU IDIVE_CTRL: CLK_SEL Mask            */

/* ------------------------------  CGU_BASE_SAFE_CLK  ----------------------------- */
#define CGU_BASE_SAFE_CLK_PD_Pos              0                                                       /*!< CGU BASE_SAFE_CLK: PD Position          */
#define CGU_BASE_SAFE_CLK_PD_Msk              (0x01UL << CGU_BASE_SAFE_CLK_PD_Pos)                    /*!< CGU BASE_SAFE_CLK: PD Mask              */
#define CGU_BASE_SAFE_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_SAFE_CLK: AUTOBLOCK Position   */
#define CGU_BASE_SAFE_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_SAFE_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_SAFE_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_SAFE_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_SAFE_CLK: CLK_SEL Position     */
#define CGU_BASE_SAFE_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_SAFE_CLK_CLK_SEL_Pos)               /*!< CGU BASE_SAFE_CLK: CLK_SEL Mask         */

