roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ------------------------------  CGU_BASE_APB3_CLK  ----------------------------- */
#define CGU_BASE_APB3_CLK_PD_Pos              0                                                       /*!< CGU BASE_APB3_CLK: PD Position          */
#define CGU_BASE_APB3_CLK_PD_Msk              (0x01UL << CGU_BASE_APB3_CLK_PD_Pos)                    /*!< CGU BASE_APB3_CLK: PD Mask              */
#define CGU_BASE_APB3_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_APB3_CLK: AUTOBLOCK Position   */
#define CGU_BASE_APB3_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_APB3_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_APB3_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_APB3_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_APB3_CLK: CLK_SEL Position     */
#define CGU_BASE_APB3_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_APB3_CLK_CLK_SEL_Pos)               /*!< CGU BASE_APB3_CLK: CLK_SEL Mask         */

/* ------------------------------  CGU_BASE_LCD_CLK  ------------------------------ */
#define CGU_BASE_LCD_CLK_PD_Pos               0                                                       /*!< CGU BASE_LCD_CLK: PD Position           */
#define CGU_BASE_LCD_CLK_PD_Msk               (0x01UL << CGU_BASE_LCD_CLK_PD_Pos)                     /*!< CGU BASE_LCD_CLK: PD Mask               */
#define CGU_BASE_LCD_CLK_AUTOBLOCK_Pos        11                                                      /*!< CGU BASE_LCD_CLK: AUTOBLOCK Position    */
#define CGU_BASE_LCD_CLK_AUTOBLOCK_Msk        (0x01UL << CGU_BASE_LCD_CLK_AUTOBLOCK_Pos)              /*!< CGU BASE_LCD_CLK: AUTOBLOCK Mask        */
#define CGU_BASE_LCD_CLK_CLK_SEL_Pos          24                                                      /*!< CGU BASE_LCD_CLK: CLK_SEL Position      */
#define CGU_BASE_LCD_CLK_CLK_SEL_Msk          (0x1fUL << CGU_BASE_LCD_CLK_CLK_SEL_Pos)                /*!< CGU BASE_LCD_CLK: CLK_SEL Mask          */

/* ------------------------------  CGU_BASE_SDIO_CLK  ----------------------------- */
#define CGU_BASE_SDIO_CLK_PD_Pos              0                                                       /*!< CGU BASE_SDIO_CLK: PD Position          */
#define CGU_BASE_SDIO_CLK_PD_Msk              (0x01UL << CGU_BASE_SDIO_CLK_PD_Pos)                    /*!< CGU BASE_SDIO_CLK: PD Mask              */
#define CGU_BASE_SDIO_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_SDIO_CLK: AUTOBLOCK Position   */
#define CGU_BASE_SDIO_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_SDIO_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_SDIO_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_SDIO_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_SDIO_CLK: CLK_SEL Position     */
#define CGU_BASE_SDIO_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_SDIO_CLK_CLK_SEL_Pos)               /*!< CGU BASE_SDIO_CLK: CLK_SEL Mask         */

/* ------------------------------  CGU_BASE_SSP0_CLK  ----------------------------- */
#define CGU_BASE_SSP0_CLK_PD_Pos              0                                                       /*!< CGU BASE_SSP0_CLK: PD Position          */
#define CGU_BASE_SSP0_CLK_PD_Msk              (0x01UL << CGU_BASE_SSP0_CLK_PD_Pos)                    /*!< CGU BASE_SSP0_CLK: PD Mask              */
#define CGU_BASE_SSP0_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_SSP0_CLK: AUTOBLOCK Position   */
#define CGU_BASE_SSP0_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_SSP0_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_SSP0_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_SSP0_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_SSP0_CLK: CLK_SEL Position     */
#define CGU_BASE_SSP0_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_SSP0_CLK_CLK_SEL_Pos)               /*!< CGU BASE_SSP0_CLK: CLK_SEL Mask         */

/* ------------------------------  CGU_BASE_SSP1_CLK  ----------------------------- */
#define CGU_BASE_SSP1_CLK_PD_Pos              0                                                       /*!< CGU BASE_SSP1_CLK: PD Position          */
#define CGU_BASE_SSP1_CLK_PD_Msk              (0x01UL << CGU_BASE_SSP1_CLK_PD_Pos)                    /*!< CGU BASE_SSP1_CLK: PD Mask              */
#define CGU_BASE_SSP1_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_SSP1_CLK: AUTOBLOCK Position   */
#define CGU_BASE_SSP1_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_SSP1_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_SSP1_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_SSP1_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_SSP1_CLK: CLK_SEL Position     */
#define CGU_BASE_SSP1_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_SSP1_CLK_CLK_SEL_Pos)               /*!< CGU BASE_SSP1_CLK: CLK_SEL Mask         */

/* -----------------------------  CGU_BASE_UART0_CLK  ----------------------------- */
#define CGU_BASE_UART0_CLK_PD_Pos             0                                                       /*!< CGU BASE_UART0_CLK: PD Position         */
#define CGU_BASE_UART0_CLK_PD_Msk             (0x01UL << CGU_BASE_UART0_CLK_PD_Pos)                   /*!< CGU BASE_UART0_CLK: PD Mask             */
#define CGU_BASE_UART0_CLK_AUTOBLOCK_Pos      11                                                      /*!< CGU BASE_UART0_CLK: AUTOBLOCK Position  */
#define CGU_BASE_UART0_CLK_AUTOBLOCK_Msk      (0x01UL << CGU_BASE_UART0_CLK_AUTOBLOCK_Pos)            /*!< CGU BASE_UART0_CLK: AUTOBLOCK Mask      */
#define CGU_BASE_UART0_CLK_CLK_SEL_Pos        24                                                      /*!< CGU BASE_UART0_CLK: CLK_SEL Position    */
#define CGU_BASE_UART0_CLK_CLK_SEL_Msk        (0x1fUL << CGU_BASE_UART0_CLK_CLK_SEL_Pos)              /*!< CGU BASE_UART0_CLK: CLK_SEL Mask        */

/* -----------------------------  CGU_BASE_UART1_CLK  ----------------------------- */
#define CGU_BASE_UART1_CLK_PD_Pos             0                                                       /*!< CGU BASE_UART1_CLK: PD Position         */
#define CGU_BASE_UART1_CLK_PD_Msk             (0x01UL << CGU_BASE_UART1_CLK_PD_Pos)                   /*!< CGU BASE_UART1_CLK: PD Mask             */
#define CGU_BASE_UART1_CLK_AUTOBLOCK_Pos      11                                                      /*!< CGU BASE_UART1_CLK: AUTOBLOCK Position  */
#define CGU_BASE_UART1_CLK_AUTOBLOCK_Msk      (0x01UL << CGU_BASE_UART1_CLK_AUTOBLOCK_Pos)            /*!< CGU BASE_UART1_CLK: AUTOBLOCK Mask      */
#define CGU_BASE_UART1_CLK_CLK_SEL_Pos        24                                                      /*!< CGU BASE_UART1_CLK: CLK_SEL Position    */
#define CGU_BASE_UART1_CLK_CLK_SEL_Msk        (0x1fUL << CGU_BASE_UART1_CLK_CLK_SEL_Pos)              /*!< CGU BASE_UART1_CLK: CLK_SEL Mask        */

/* -----------------------------  CGU_BASE_UART2_CLK  ----------------------------- */
#define CGU_BASE_UART2_CLK_PD_Pos             0                                                       /*!< CGU BASE_UART2_CLK: PD Position         */
#define CGU_BASE_UART2_CLK_PD_Msk             (0x01UL << CGU_BASE_UART2_CLK_PD_Pos)                   /*!< CGU BASE_UART2_CLK: PD Mask             */
#define CGU_BASE_UART2_CLK_AUTOBLOCK_Pos      11                                                      /*!< CGU BASE_UART2_CLK: AUTOBLOCK Position  */
#define CGU_BASE_UART2_CLK_AUTOBLOCK_Msk      (0x01UL << CGU_BASE_UART2_CLK_AUTOBLOCK_Pos)            /*!< CGU BASE_UART2_CLK: AUTOBLOCK Mask      */
#define CGU_BASE_UART2_CLK_CLK_SEL_Pos        24                                                      /*!< CGU BASE_UART2_CLK: CLK_SEL Position    */
#define CGU_BASE_UART2_CLK_CLK_SEL_Msk        (0x1fUL << CGU_BASE_UART2_CLK_CLK_SEL_Pos)              /*!< CGU BASE_UART2_CLK: CLK_SEL Mask        */

/* -----------------------------  CGU_BASE_UART3_CLK  ----------------------------- */
#define CGU_BASE_UART3_CLK_PD_Pos             0                                                       /*!< CGU BASE_UART3_CLK: PD Position         */
#define CGU_BASE_UART3_CLK_PD_Msk             (0x01UL << CGU_BASE_UART3_CLK_PD_Pos)                   /*!< CGU BASE_UART3_CLK: PD Mask             */
#define CGU_BASE_UART3_CLK_AUTOBLOCK_Pos      11                                                      /*!< CGU BASE_UART3_CLK: AUTOBLOCK Position  */
#define CGU_BASE_UART3_CLK_AUTOBLOCK_Msk      (0x01UL << CGU_BASE_UART3_CLK_AUTOBLOCK_Pos)            /*!< CGU BASE_UART3_CLK: AUTOBLOCK Mask      */
#define CGU_BASE_UART3_CLK_CLK_SEL_Pos        24                                                      /*!< CGU BASE_UART3_CLK: CLK_SEL Position    */
#define CGU_BASE_UART3_CLK_CLK_SEL_Msk        (0x1fUL << CGU_BASE_UART3_CLK_CLK_SEL_Pos)              /*!< CGU BASE_UART3_CLK: CLK_SEL Mask        */

/* ------------------------------  CGU_BASE_OUT_CLK  ------------------------------ */
#define CGU_BASE_OUT_CLK_PD_Pos               0                                                       /*!< CGU BASE_OUT_CLK: PD Position           */
#define CGU_BASE_OUT_CLK_PD_Msk               (0x01UL << CGU_BASE_OUT_CLK_PD_Pos)                     /*!< CGU BASE_OUT_CLK: PD Mask               */
#define CGU_BASE_OUT_CLK_AUTOBLOCK_Pos        11                                                      /*!< CGU BASE_OUT_CLK: AUTOBLOCK Position    */
#define CGU_BASE_OUT_CLK_AUTOBLOCK_Msk        (0x01UL << CGU_BASE_OUT_CLK_AUTOBLOCK_Pos)              /*!< CGU BASE_OUT_CLK: AUTOBLOCK Mask        */
#define CGU_BASE_OUT_CLK_CLK_SEL_Pos          24                                                      /*!< CGU BASE_OUT_CLK: CLK_SEL Position      */
#define CGU_BASE_OUT_CLK_CLK_SEL_Msk          (0x1fUL << CGU_BASE_OUT_CLK_CLK_SEL_Pos)                /*!< CGU BASE_OUT_CLK: CLK_SEL Mask          */

