roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ------------------------------  CGU_BASE_APLL_CLK  ----------------------------- */
#define CGU_BASE_APLL_CLK_PD_Pos              0                                                       /*!< CGU BASE_APLL_CLK: PD Position          */
#define CGU_BASE_APLL_CLK_PD_Msk              (0x01UL << CGU_BASE_APLL_CLK_PD_Pos)                    /*!< CGU BASE_APLL_CLK: PD Mask              */
#define CGU_BASE_APLL_CLK_AUTOBLOCK_Pos       11                                                      /*!< CGU BASE_APLL_CLK: AUTOBLOCK Position   */
#define CGU_BASE_APLL_CLK_AUTOBLOCK_Msk       (0x01UL << CGU_BASE_APLL_CLK_AUTOBLOCK_Pos)             /*!< CGU BASE_APLL_CLK: AUTOBLOCK Mask       */
#define CGU_BASE_APLL_CLK_CLK_SEL_Pos         24                                                      /*!< CGU BASE_APLL_CLK: CLK_SEL Position     */
#define CGU_BASE_APLL_CLK_CLK_SEL_Msk         (0x1fUL << CGU_BASE_APLL_CLK_CLK_SEL_Pos)               /*!< CGU BASE_APLL_CLK: CLK_SEL Mask         */

/* ----------------------------  CGU_BASE_CGU_OUT0_CLK  --------------------------- */
#define CGU_BASE_CGU_OUT0_CLK_PD_Pos          0                                                       /*!< CGU BASE_CGU_OUT0_CLK: PD Position      */
#define CGU_BASE_CGU_OUT0_CLK_PD_Msk          (0x01UL << CGU_BASE_CGU_OUT0_CLK_PD_Pos)                /*!< CGU BASE_CGU_OUT0_CLK: PD Mask          */
#define CGU_BASE_CGU_OUT0_CLK_AUTOBLOCK_Pos   11                                                      /*!< CGU BASE_CGU_OUT0_CLK: AUTOBLOCK Position */
#define CGU_BASE_CGU_OUT0_CLK_AUTOBLOCK_Msk   (0x01UL << CGU_BASE_CGU_OUT0_CLK_AUTOBLOCK_Pos)         /*!< CGU BASE_CGU_OUT0_CLK: AUTOBLOCK Mask   */
#define CGU_BASE_CGU_OUT0_CLK_CLK_SEL_Pos     24                                                      /*!< CGU BASE_CGU_OUT0_CLK: CLK_SEL Position */
#define CGU_BASE_CGU_OUT0_CLK_CLK_SEL_Msk     (0x1fUL << CGU_BASE_CGU_OUT0_CLK_CLK_SEL_Pos)           /*!< CGU BASE_CGU_OUT0_CLK: CLK_SEL Mask     */

/* ----------------------------  CGU_BASE_CGU_OUT1_CLK  --------------------------- */
#define CGU_BASE_CGU_OUT1_CLK_PD_Pos          0                                                       /*!< CGU BASE_CGU_OUT1_CLK: PD Position      */
#define CGU_BASE_CGU_OUT1_CLK_PD_Msk          (0x01UL << CGU_BASE_CGU_OUT1_CLK_PD_Pos)                /*!< CGU BASE_CGU_OUT1_CLK: PD Mask          */
#define CGU_BASE_CGU_OUT1_CLK_AUTOBLOCK_Pos   11                                                      /*!< CGU BASE_CGU_OUT1_CLK: AUTOBLOCK Position */
#define CGU_BASE_CGU_OUT1_CLK_AUTOBLOCK_Msk   (0x01UL << CGU_BASE_CGU_OUT1_CLK_AUTOBLOCK_Pos)         /*!< CGU BASE_CGU_OUT1_CLK: AUTOBLOCK Mask   */
#define CGU_BASE_CGU_OUT1_CLK_CLK_SEL_Pos     24                                                      /*!< CGU BASE_CGU_OUT1_CLK: CLK_SEL Position */
#define CGU_BASE_CGU_OUT1_CLK_CLK_SEL_Msk     (0x1fUL << CGU_BASE_CGU_OUT1_CLK_CLK_SEL_Pos)           /*!< CGU BASE_CGU_OUT1_CLK: CLK_SEL Mask     */


/* ================================================================================ */
/* ================          struct 'CCU1' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------------  CCU1_PM  ---------------------------------- */
#define CCU1_PM_PD_Pos                        0                                                       /*!< CCU1 PM: PD Position                    */
#define CCU1_PM_PD_Msk                        (0x01UL << CCU1_PM_PD_Pos)                              /*!< CCU1 PM: PD Mask                        */

/* -------------------------------  CCU1_BASE_STAT  ------------------------------- */
#define CCU1_BASE_STAT_BASE_APB3_CLK_IND_Pos  0                                                       /*!< CCU1 BASE_STAT: BASE_APB3_CLK_IND Position */
#define CCU1_BASE_STAT_BASE_APB3_CLK_IND_Msk  (0x01UL << CCU1_BASE_STAT_BASE_APB3_CLK_IND_Pos)        /*!< CCU1 BASE_STAT: BASE_APB3_CLK_IND Mask  */
#define CCU1_BASE_STAT_BASE_APB1_CLK_IND_Pos  1                                                       /*!< CCU1 BASE_STAT: BASE_APB1_CLK_IND Position */
#define CCU1_BASE_STAT_BASE_APB1_CLK_IND_Msk  (0x01UL << CCU1_BASE_STAT_BASE_APB1_CLK_IND_Pos)        /*!< CCU1 BASE_STAT: BASE_APB1_CLK_IND Mask  */
#define CCU1_BASE_STAT_BASE_SPIFI_CLK_IND_Pos 2                                                       /*!< CCU1 BASE_STAT: BASE_SPIFI_CLK_IND Position */
#define CCU1_BASE_STAT_BASE_SPIFI_CLK_IND_Msk (0x01UL << CCU1_BASE_STAT_BASE_SPIFI_CLK_IND_Pos)       /*!< CCU1 BASE_STAT: BASE_SPIFI_CLK_IND Mask */
#define CCU1_BASE_STAT_BASE_M3_CLK_IND_Pos    3                                                       /*!< CCU1 BASE_STAT: BASE_M3_CLK_IND Position */
#define CCU1_BASE_STAT_BASE_M3_CLK_IND_Msk    (0x01UL << CCU1_BASE_STAT_BASE_M3_CLK_IND_Pos)          /*!< CCU1 BASE_STAT: BASE_M3_CLK_IND Mask    */
#define CCU1_BASE_STAT_BASE_USB0_CLK_IND_Pos  7                                                       /*!< CCU1 BASE_STAT: BASE_USB0_CLK_IND Position */
#define CCU1_BASE_STAT_BASE_USB0_CLK_IND_Msk  (0x01UL << CCU1_BASE_STAT_BASE_USB0_CLK_IND_Pos)        /*!< CCU1 BASE_STAT: BASE_USB0_CLK_IND Mask  */
#define CCU1_BASE_STAT_BASE_USB1_CLK_IND_Pos  8                                                       /*!< CCU1 BASE_STAT: BASE_USB1_CLK_IND Position */
#define CCU1_BASE_STAT_BASE_USB1_CLK_IND_Msk  (0x01UL << CCU1_BASE_STAT_BASE_USB1_CLK_IND_Pos)        /*!< CCU1 BASE_STAT: BASE_USB1_CLK_IND Mask  */

/* ----------------------------  CCU1_CLK_APB3_BUS_CFG  --------------------------- */
#define CCU1_CLK_APB3_BUS_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_APB3_BUS_CFG: RUN Position     */
#define CCU1_CLK_APB3_BUS_CFG_RUN_Msk         (0x01UL << CCU1_CLK_APB3_BUS_CFG_RUN_Pos)               /*!< CCU1 CLK_APB3_BUS_CFG: RUN Mask         */
#define CCU1_CLK_APB3_BUS_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_APB3_BUS_CFG: AUTO Position    */
#define CCU1_CLK_APB3_BUS_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_APB3_BUS_CFG_AUTO_Pos)              /*!< CCU1 CLK_APB3_BUS_CFG: AUTO Mask        */
#define CCU1_CLK_APB3_BUS_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_APB3_BUS_CFG: WAKEUP Position  */
#define CCU1_CLK_APB3_BUS_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_APB3_BUS_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_APB3_BUS_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_APB3_BUS_STAT  --------------------------- */
#define CCU1_CLK_APB3_BUS_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_APB3_BUS_STAT: RUN Position    */
#define CCU1_CLK_APB3_BUS_STAT_RUN_Msk        (0x01UL << CCU1_CLK_APB3_BUS_STAT_RUN_Pos)              /*!< CCU1 CLK_APB3_BUS_STAT: RUN Mask        */
#define CCU1_CLK_APB3_BUS_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB3_BUS_STAT: AUTO Position   */
#define CCU1_CLK_APB3_BUS_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_APB3_BUS_STAT_AUTO_Pos)             /*!< CCU1 CLK_APB3_BUS_STAT: AUTO Mask       */
#define CCU1_CLK_APB3_BUS_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB3_BUS_STAT: WAKEUP Position */
#define CCU1_CLK_APB3_BUS_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB3_BUS_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_APB3_BUS_STAT: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB3_I2C1_CFG  --------------------------- */
#define CCU1_CLK_APB3_I2C1_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_APB3_I2C1_CFG: RUN Position    */
#define CCU1_CLK_APB3_I2C1_CFG_RUN_Msk        (0x01UL << CCU1_CLK_APB3_I2C1_CFG_RUN_Pos)              /*!< CCU1 CLK_APB3_I2C1_CFG: RUN Mask        */
#define CCU1_CLK_APB3_I2C1_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB3_I2C1_CFG: AUTO Position   */
#define CCU1_CLK_APB3_I2C1_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_APB3_I2C1_CFG_AUTO_Pos)             /*!< CCU1 CLK_APB3_I2C1_CFG: AUTO Mask       */
#define CCU1_CLK_APB3_I2C1_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB3_I2C1_CFG: WAKEUP Position */
#define CCU1_CLK_APB3_I2C1_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB3_I2C1_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_APB3_I2C1_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB3_I2C1_STAT  -------------------------- */
#define CCU1_CLK_APB3_I2C1_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_APB3_I2C1_STAT: RUN Position   */
#define CCU1_CLK_APB3_I2C1_STAT_RUN_Msk       (0x01UL << CCU1_CLK_APB3_I2C1_STAT_RUN_Pos)             /*!< CCU1 CLK_APB3_I2C1_STAT: RUN Mask       */
#define CCU1_CLK_APB3_I2C1_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_APB3_I2C1_STAT: AUTO Position  */
#define CCU1_CLK_APB3_I2C1_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_APB3_I2C1_STAT_AUTO_Pos)            /*!< CCU1 CLK_APB3_I2C1_STAT: AUTO Mask      */
#define CCU1_CLK_APB3_I2C1_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_APB3_I2C1_STAT: WAKEUP Position */
#define CCU1_CLK_APB3_I2C1_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_APB3_I2C1_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_APB3_I2C1_STAT: WAKEUP Mask    */

