roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------  CCU1_CLK_APB3_DAC_CFG  --------------------------- */
#define CCU1_CLK_APB3_DAC_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_APB3_DAC_CFG: RUN Position     */
#define CCU1_CLK_APB3_DAC_CFG_RUN_Msk         (0x01UL << CCU1_CLK_APB3_DAC_CFG_RUN_Pos)               /*!< CCU1 CLK_APB3_DAC_CFG: RUN Mask         */
#define CCU1_CLK_APB3_DAC_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_APB3_DAC_CFG: AUTO Position    */
#define CCU1_CLK_APB3_DAC_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_APB3_DAC_CFG_AUTO_Pos)              /*!< CCU1 CLK_APB3_DAC_CFG: AUTO Mask        */
#define CCU1_CLK_APB3_DAC_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_APB3_DAC_CFG: WAKEUP Position  */
#define CCU1_CLK_APB3_DAC_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_APB3_DAC_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_APB3_DAC_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_APB3_DAC_STAT  --------------------------- */
#define CCU1_CLK_APB3_DAC_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_APB3_DAC_STAT: RUN Position    */
#define CCU1_CLK_APB3_DAC_STAT_RUN_Msk        (0x01UL << CCU1_CLK_APB3_DAC_STAT_RUN_Pos)              /*!< CCU1 CLK_APB3_DAC_STAT: RUN Mask        */
#define CCU1_CLK_APB3_DAC_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB3_DAC_STAT: AUTO Position   */
#define CCU1_CLK_APB3_DAC_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_APB3_DAC_STAT_AUTO_Pos)             /*!< CCU1 CLK_APB3_DAC_STAT: AUTO Mask       */
#define CCU1_CLK_APB3_DAC_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB3_DAC_STAT: WAKEUP Position */
#define CCU1_CLK_APB3_DAC_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB3_DAC_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_APB3_DAC_STAT: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB3_ADC0_CFG  --------------------------- */
#define CCU1_CLK_APB3_ADC0_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_APB3_ADC0_CFG: RUN Position    */
#define CCU1_CLK_APB3_ADC0_CFG_RUN_Msk        (0x01UL << CCU1_CLK_APB3_ADC0_CFG_RUN_Pos)              /*!< CCU1 CLK_APB3_ADC0_CFG: RUN Mask        */
#define CCU1_CLK_APB3_ADC0_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB3_ADC0_CFG: AUTO Position   */
#define CCU1_CLK_APB3_ADC0_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_APB3_ADC0_CFG_AUTO_Pos)             /*!< CCU1 CLK_APB3_ADC0_CFG: AUTO Mask       */
#define CCU1_CLK_APB3_ADC0_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB3_ADC0_CFG: WAKEUP Position */
#define CCU1_CLK_APB3_ADC0_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB3_ADC0_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_APB3_ADC0_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB3_ADC0_STAT  -------------------------- */
#define CCU1_CLK_APB3_ADC0_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_APB3_ADC0_STAT: RUN Position   */
#define CCU1_CLK_APB3_ADC0_STAT_RUN_Msk       (0x01UL << CCU1_CLK_APB3_ADC0_STAT_RUN_Pos)             /*!< CCU1 CLK_APB3_ADC0_STAT: RUN Mask       */
#define CCU1_CLK_APB3_ADC0_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_APB3_ADC0_STAT: AUTO Position  */
#define CCU1_CLK_APB3_ADC0_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_APB3_ADC0_STAT_AUTO_Pos)            /*!< CCU1 CLK_APB3_ADC0_STAT: AUTO Mask      */
#define CCU1_CLK_APB3_ADC0_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_APB3_ADC0_STAT: WAKEUP Position */
#define CCU1_CLK_APB3_ADC0_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_APB3_ADC0_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_APB3_ADC0_STAT: WAKEUP Mask    */

/* ---------------------------  CCU1_CLK_APB3_ADC1_CFG  --------------------------- */
#define CCU1_CLK_APB3_ADC1_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_APB3_ADC1_CFG: RUN Position    */
#define CCU1_CLK_APB3_ADC1_CFG_RUN_Msk        (0x01UL << CCU1_CLK_APB3_ADC1_CFG_RUN_Pos)              /*!< CCU1 CLK_APB3_ADC1_CFG: RUN Mask        */
#define CCU1_CLK_APB3_ADC1_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB3_ADC1_CFG: AUTO Position   */
#define CCU1_CLK_APB3_ADC1_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_APB3_ADC1_CFG_AUTO_Pos)             /*!< CCU1 CLK_APB3_ADC1_CFG: AUTO Mask       */
#define CCU1_CLK_APB3_ADC1_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB3_ADC1_CFG: WAKEUP Position */
#define CCU1_CLK_APB3_ADC1_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB3_ADC1_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_APB3_ADC1_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB3_ADC1_STAT  -------------------------- */
#define CCU1_CLK_APB3_ADC1_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_APB3_ADC1_STAT: RUN Position   */
#define CCU1_CLK_APB3_ADC1_STAT_RUN_Msk       (0x01UL << CCU1_CLK_APB3_ADC1_STAT_RUN_Pos)             /*!< CCU1 CLK_APB3_ADC1_STAT: RUN Mask       */
#define CCU1_CLK_APB3_ADC1_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_APB3_ADC1_STAT: AUTO Position  */
#define CCU1_CLK_APB3_ADC1_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_APB3_ADC1_STAT_AUTO_Pos)            /*!< CCU1 CLK_APB3_ADC1_STAT: AUTO Mask      */
#define CCU1_CLK_APB3_ADC1_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_APB3_ADC1_STAT: WAKEUP Position */
#define CCU1_CLK_APB3_ADC1_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_APB3_ADC1_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_APB3_ADC1_STAT: WAKEUP Mask    */

/* ---------------------------  CCU1_CLK_APB3_CAN0_CFG  --------------------------- */
#define CCU1_CLK_APB3_CAN0_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_APB3_CAN0_CFG: RUN Position    */
#define CCU1_CLK_APB3_CAN0_CFG_RUN_Msk        (0x01UL << CCU1_CLK_APB3_CAN0_CFG_RUN_Pos)              /*!< CCU1 CLK_APB3_CAN0_CFG: RUN Mask        */
#define CCU1_CLK_APB3_CAN0_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB3_CAN0_CFG: AUTO Position   */
#define CCU1_CLK_APB3_CAN0_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_APB3_CAN0_CFG_AUTO_Pos)             /*!< CCU1 CLK_APB3_CAN0_CFG: AUTO Mask       */
#define CCU1_CLK_APB3_CAN0_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB3_CAN0_CFG: WAKEUP Position */
#define CCU1_CLK_APB3_CAN0_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB3_CAN0_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_APB3_CAN0_CFG: WAKEUP Mask     */

