roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------  CCU1_CLK_APB3_CAN0_STAT  -------------------------- */
#define CCU1_CLK_APB3_CAN0_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_APB3_CAN0_STAT: RUN Position   */
#define CCU1_CLK_APB3_CAN0_STAT_RUN_Msk       (0x01UL << CCU1_CLK_APB3_CAN0_STAT_RUN_Pos)             /*!< CCU1 CLK_APB3_CAN0_STAT: RUN Mask       */
#define CCU1_CLK_APB3_CAN0_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_APB3_CAN0_STAT: AUTO Position  */
#define CCU1_CLK_APB3_CAN0_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_APB3_CAN0_STAT_AUTO_Pos)            /*!< CCU1 CLK_APB3_CAN0_STAT: AUTO Mask      */
#define CCU1_CLK_APB3_CAN0_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_APB3_CAN0_STAT: WAKEUP Position */
#define CCU1_CLK_APB3_CAN0_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_APB3_CAN0_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_APB3_CAN0_STAT: WAKEUP Mask    */

/* ----------------------------  CCU1_CLK_APB1_BUS_CFG  --------------------------- */
#define CCU1_CLK_APB1_BUS_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_APB1_BUS_CFG: RUN Position     */
#define CCU1_CLK_APB1_BUS_CFG_RUN_Msk         (0x01UL << CCU1_CLK_APB1_BUS_CFG_RUN_Pos)               /*!< CCU1 CLK_APB1_BUS_CFG: RUN Mask         */
#define CCU1_CLK_APB1_BUS_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_APB1_BUS_CFG: AUTO Position    */
#define CCU1_CLK_APB1_BUS_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_APB1_BUS_CFG_AUTO_Pos)              /*!< CCU1 CLK_APB1_BUS_CFG: AUTO Mask        */
#define CCU1_CLK_APB1_BUS_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_APB1_BUS_CFG: WAKEUP Position  */
#define CCU1_CLK_APB1_BUS_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_APB1_BUS_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_APB1_BUS_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_APB1_BUS_STAT  --------------------------- */
#define CCU1_CLK_APB1_BUS_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_APB1_BUS_STAT: RUN Position    */
#define CCU1_CLK_APB1_BUS_STAT_RUN_Msk        (0x01UL << CCU1_CLK_APB1_BUS_STAT_RUN_Pos)              /*!< CCU1 CLK_APB1_BUS_STAT: RUN Mask        */
#define CCU1_CLK_APB1_BUS_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB1_BUS_STAT: AUTO Position   */
#define CCU1_CLK_APB1_BUS_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_APB1_BUS_STAT_AUTO_Pos)             /*!< CCU1 CLK_APB1_BUS_STAT: AUTO Mask       */
#define CCU1_CLK_APB1_BUS_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB1_BUS_STAT: WAKEUP Position */
#define CCU1_CLK_APB1_BUS_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB1_BUS_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_APB1_BUS_STAT: WAKEUP Mask     */

/* ------------------------  CCU1_CLK_APB1_MOTOCONPWM_CFG  ------------------------ */
#define CCU1_CLK_APB1_MOTOCONPWM_CFG_RUN_Pos  0                                                       /*!< CCU1 CLK_APB1_MOTOCONPWM_CFG: RUN Position */
#define CCU1_CLK_APB1_MOTOCONPWM_CFG_RUN_Msk  (0x01UL << CCU1_CLK_APB1_MOTOCONPWM_CFG_RUN_Pos)        /*!< CCU1 CLK_APB1_MOTOCONPWM_CFG: RUN Mask  */
#define CCU1_CLK_APB1_MOTOCONPWM_CFG_AUTO_Pos 1                                                       /*!< CCU1 CLK_APB1_MOTOCONPWM_CFG: AUTO Position */
#define CCU1_CLK_APB1_MOTOCONPWM_CFG_AUTO_Msk (0x01UL << CCU1_CLK_APB1_MOTOCONPWM_CFG_AUTO_Pos)       /*!< CCU1 CLK_APB1_MOTOCONPWM_CFG: AUTO Mask */
#define CCU1_CLK_APB1_MOTOCONPWM_CFG_WAKEUP_Pos 2                                                     /*!< CCU1 CLK_APB1_MOTOCONPWM_CFG: WAKEUP Position */
#define CCU1_CLK_APB1_MOTOCONPWM_CFG_WAKEUP_Msk (0x01UL << CCU1_CLK_APB1_MOTOCONPWM_CFG_WAKEUP_Pos)   /*!< CCU1 CLK_APB1_MOTOCONPWM_CFG: WAKEUP Mask */

/* ------------------------  CCU1_CLK_APB1_MOTOCONPWM_STAT  ----------------------- */
#define CCU1_CLK_APB1_MOTOCONPWM_STAT_RUN_Pos 0                                                       /*!< CCU1 CLK_APB1_MOTOCONPWM_STAT: RUN Position */
#define CCU1_CLK_APB1_MOTOCONPWM_STAT_RUN_Msk (0x01UL << CCU1_CLK_APB1_MOTOCONPWM_STAT_RUN_Pos)       /*!< CCU1 CLK_APB1_MOTOCONPWM_STAT: RUN Mask */
#define CCU1_CLK_APB1_MOTOCONPWM_STAT_AUTO_Pos 1                                                      /*!< CCU1 CLK_APB1_MOTOCONPWM_STAT: AUTO Position */
#define CCU1_CLK_APB1_MOTOCONPWM_STAT_AUTO_Msk (0x01UL << CCU1_CLK_APB1_MOTOCONPWM_STAT_AUTO_Pos)     /*!< CCU1 CLK_APB1_MOTOCONPWM_STAT: AUTO Mask */
#define CCU1_CLK_APB1_MOTOCONPWM_STAT_WAKEUP_Pos 2                                                    /*!< CCU1 CLK_APB1_MOTOCONPWM_STAT: WAKEUP Position */
#define CCU1_CLK_APB1_MOTOCONPWM_STAT_WAKEUP_Msk (0x01UL << CCU1_CLK_APB1_MOTOCONPWM_STAT_WAKEUP_Pos) /*!< CCU1 CLK_APB1_MOTOCONPWM_STAT: WAKEUP Mask */

/* ---------------------------  CCU1_CLK_APB1_I2C0_CFG  --------------------------- */
#define CCU1_CLK_APB1_I2C0_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_APB1_I2C0_CFG: RUN Position    */
#define CCU1_CLK_APB1_I2C0_CFG_RUN_Msk        (0x01UL << CCU1_CLK_APB1_I2C0_CFG_RUN_Pos)              /*!< CCU1 CLK_APB1_I2C0_CFG: RUN Mask        */
#define CCU1_CLK_APB1_I2C0_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB1_I2C0_CFG: AUTO Position   */
#define CCU1_CLK_APB1_I2C0_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_APB1_I2C0_CFG_AUTO_Pos)             /*!< CCU1 CLK_APB1_I2C0_CFG: AUTO Mask       */
#define CCU1_CLK_APB1_I2C0_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB1_I2C0_CFG: WAKEUP Position */
#define CCU1_CLK_APB1_I2C0_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB1_I2C0_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_APB1_I2C0_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_APB1_I2C0_STAT  -------------------------- */
#define CCU1_CLK_APB1_I2C0_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_APB1_I2C0_STAT: RUN Position   */
#define CCU1_CLK_APB1_I2C0_STAT_RUN_Msk       (0x01UL << CCU1_CLK_APB1_I2C0_STAT_RUN_Pos)             /*!< CCU1 CLK_APB1_I2C0_STAT: RUN Mask       */
#define CCU1_CLK_APB1_I2C0_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_APB1_I2C0_STAT: AUTO Position  */
#define CCU1_CLK_APB1_I2C0_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_APB1_I2C0_STAT_AUTO_Pos)            /*!< CCU1 CLK_APB1_I2C0_STAT: AUTO Mask      */
#define CCU1_CLK_APB1_I2C0_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_APB1_I2C0_STAT: WAKEUP Position */
#define CCU1_CLK_APB1_I2C0_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_APB1_I2C0_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_APB1_I2C0_STAT: WAKEUP Mask    */

/* ----------------------------  CCU1_CLK_APB1_I2S_CFG  --------------------------- */
#define CCU1_CLK_APB1_I2S_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_APB1_I2S_CFG: RUN Position     */
#define CCU1_CLK_APB1_I2S_CFG_RUN_Msk         (0x01UL << CCU1_CLK_APB1_I2S_CFG_RUN_Pos)               /*!< CCU1 CLK_APB1_I2S_CFG: RUN Mask         */
#define CCU1_CLK_APB1_I2S_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_APB1_I2S_CFG: AUTO Position    */
#define CCU1_CLK_APB1_I2S_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_APB1_I2S_CFG_AUTO_Pos)              /*!< CCU1 CLK_APB1_I2S_CFG: AUTO Mask        */
#define CCU1_CLK_APB1_I2S_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_APB1_I2S_CFG: WAKEUP Position  */
#define CCU1_CLK_APB1_I2S_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_APB1_I2S_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_APB1_I2S_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_APB1_I2S_STAT  --------------------------- */
#define CCU1_CLK_APB1_I2S_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_APB1_I2S_STAT: RUN Position    */
#define CCU1_CLK_APB1_I2S_STAT_RUN_Msk        (0x01UL << CCU1_CLK_APB1_I2S_STAT_RUN_Pos)              /*!< CCU1 CLK_APB1_I2S_STAT: RUN Mask        */
#define CCU1_CLK_APB1_I2S_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_APB1_I2S_STAT: AUTO Position   */
#define CCU1_CLK_APB1_I2S_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_APB1_I2S_STAT_AUTO_Pos)             /*!< CCU1 CLK_APB1_I2S_STAT: AUTO Mask       */
#define CCU1_CLK_APB1_I2S_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_APB1_I2S_STAT: WAKEUP Position */
#define CCU1_CLK_APB1_I2S_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_APB1_I2S_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_APB1_I2S_STAT: WAKEUP Mask     */

