roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------  CCU1_CLK_M4_USB0_CFG  ---------------------------- */
#define CCU1_CLK_M4_USB0_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_USB0_CFG: RUN Position      */
#define CCU1_CLK_M4_USB0_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_USB0_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_USB0_CFG: RUN Mask          */
#define CCU1_CLK_M4_USB0_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_USB0_CFG: AUTO Position     */
#define CCU1_CLK_M4_USB0_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_USB0_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_USB0_CFG: AUTO Mask         */
#define CCU1_CLK_M4_USB0_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_USB0_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_USB0_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_USB0_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_USB0_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_USB0_STAT  --------------------------- */
#define CCU1_CLK_M4_USB0_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_USB0_STAT: RUN Position     */
#define CCU1_CLK_M4_USB0_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_USB0_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_USB0_STAT: RUN Mask         */
#define CCU1_CLK_M4_USB0_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_USB0_STAT: AUTO Position    */
#define CCU1_CLK_M4_USB0_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_USB0_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_USB0_STAT: AUTO Mask        */
#define CCU1_CLK_M4_USB0_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_USB0_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_USB0_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_USB0_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_USB0_STAT: WAKEUP Mask      */

/* -----------------------------  CCU1_CLK_M4_EMC_CFG  ---------------------------- */
#define CCU1_CLK_M4_EMC_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_EMC_CFG: RUN Position       */
#define CCU1_CLK_M4_EMC_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_EMC_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_EMC_CFG: RUN Mask           */
#define CCU1_CLK_M4_EMC_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_EMC_CFG: AUTO Position      */
#define CCU1_CLK_M4_EMC_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_EMC_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_EMC_CFG: AUTO Mask          */
#define CCU1_CLK_M4_EMC_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_EMC_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_EMC_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_EMC_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_EMC_CFG: WAKEUP Mask        */

/* ----------------------------  CCU1_CLK_M4_EMC_STAT  ---------------------------- */
#define CCU1_CLK_M4_EMC_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_EMC_STAT: RUN Position      */
#define CCU1_CLK_M4_EMC_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_EMC_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_EMC_STAT: RUN Mask          */
#define CCU1_CLK_M4_EMC_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_EMC_STAT: AUTO Position     */
#define CCU1_CLK_M4_EMC_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_EMC_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_EMC_STAT: AUTO Mask         */
#define CCU1_CLK_M4_EMC_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_EMC_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_EMC_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_EMC_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_EMC_STAT: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_SDIO_CFG  ---------------------------- */
#define CCU1_CLK_M4_SDIO_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_SDIO_CFG: RUN Position      */
#define CCU1_CLK_M4_SDIO_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_SDIO_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_SDIO_CFG: RUN Mask          */
#define CCU1_CLK_M4_SDIO_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_SDIO_CFG: AUTO Position     */
#define CCU1_CLK_M4_SDIO_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_SDIO_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_SDIO_CFG: AUTO Mask         */
#define CCU1_CLK_M4_SDIO_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_SDIO_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_SDIO_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_SDIO_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_SDIO_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_SDIO_STAT  --------------------------- */
#define CCU1_CLK_M4_SDIO_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_SDIO_STAT: RUN Position     */
#define CCU1_CLK_M4_SDIO_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_SDIO_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_SDIO_STAT: RUN Mask         */
#define CCU1_CLK_M4_SDIO_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_SDIO_STAT: AUTO Position    */
#define CCU1_CLK_M4_SDIO_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_SDIO_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_SDIO_STAT: AUTO Mask        */
#define CCU1_CLK_M4_SDIO_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_SDIO_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_SDIO_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_SDIO_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_SDIO_STAT: WAKEUP Mask      */

/* -----------------------------  CCU1_CLK_M4_DMA_CFG  ---------------------------- */
#define CCU1_CLK_M4_DMA_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_DMA_CFG: RUN Position       */
#define CCU1_CLK_M4_DMA_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_DMA_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_DMA_CFG: RUN Mask           */
#define CCU1_CLK_M4_DMA_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_DMA_CFG: AUTO Position      */
#define CCU1_CLK_M4_DMA_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_DMA_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_DMA_CFG: AUTO Mask          */
#define CCU1_CLK_M4_DMA_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_DMA_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_DMA_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_DMA_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_DMA_CFG: WAKEUP Mask        */

/* ----------------------------  CCU1_CLK_M4_DMA_STAT  ---------------------------- */
#define CCU1_CLK_M4_DMA_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_DMA_STAT: RUN Position      */
#define CCU1_CLK_M4_DMA_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_DMA_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_DMA_STAT: RUN Mask          */
#define CCU1_CLK_M4_DMA_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_DMA_STAT: AUTO Position     */
#define CCU1_CLK_M4_DMA_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_DMA_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_DMA_STAT: AUTO Mask         */
#define CCU1_CLK_M4_DMA_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_DMA_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_DMA_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_DMA_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_DMA_STAT: WAKEUP Mask       */

/* ---------------------------  CCU1_CLK_M4_M4CORE_CFG  --------------------------- */
#define CCU1_CLK_M4_M4CORE_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_M4CORE_CFG: RUN Position    */
#define CCU1_CLK_M4_M4CORE_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_M4CORE_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_M4CORE_CFG: RUN Mask        */
#define CCU1_CLK_M4_M4CORE_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_M4CORE_CFG: AUTO Position   */
#define CCU1_CLK_M4_M4CORE_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_M4CORE_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_M4CORE_CFG: AUTO Mask       */
#define CCU1_CLK_M4_M4CORE_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_M4CORE_CFG: WAKEUP Position */
#define CCU1_CLK_M4_M4CORE_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_M4CORE_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_M4CORE_CFG: WAKEUP Mask     */

