roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------  CCU1_CLK_M4_M4CORE_STAT  -------------------------- */
#define CCU1_CLK_M4_M4CORE_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_M4CORE_STAT: RUN Position   */
#define CCU1_CLK_M4_M4CORE_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_M4CORE_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_M4CORE_STAT: RUN Mask       */
#define CCU1_CLK_M4_M4CORE_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_M4CORE_STAT: AUTO Position  */
#define CCU1_CLK_M4_M4CORE_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_M4CORE_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_M4CORE_STAT: AUTO Mask      */
#define CCU1_CLK_M4_M4CORE_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_M4CORE_STAT: WAKEUP Position */
#define CCU1_CLK_M4_M4CORE_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_M4CORE_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_M4CORE_STAT: WAKEUP Mask    */

/* -----------------------------  CCU1_CLK_M4_SCT_CFG  ---------------------------- */
#define CCU1_CLK_M4_SCT_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_SCT_CFG: RUN Position       */
#define CCU1_CLK_M4_SCT_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_SCT_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_SCT_CFG: RUN Mask           */
#define CCU1_CLK_M4_SCT_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_SCT_CFG: AUTO Position      */
#define CCU1_CLK_M4_SCT_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_SCT_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_SCT_CFG: AUTO Mask          */
#define CCU1_CLK_M4_SCT_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_SCT_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_SCT_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_SCT_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_SCT_CFG: WAKEUP Mask        */

/* ----------------------------  CCU1_CLK_M4_SCT_STAT  ---------------------------- */
#define CCU1_CLK_M4_SCT_STAT_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_SCT_STAT: RUN Position      */
#define CCU1_CLK_M4_SCT_STAT_RUN_Msk          (0x01UL << CCU1_CLK_M4_SCT_STAT_RUN_Pos)                /*!< CCU1 CLK_M4_SCT_STAT: RUN Mask          */
#define CCU1_CLK_M4_SCT_STAT_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_SCT_STAT: AUTO Position     */
#define CCU1_CLK_M4_SCT_STAT_AUTO_Msk         (0x01UL << CCU1_CLK_M4_SCT_STAT_AUTO_Pos)               /*!< CCU1 CLK_M4_SCT_STAT: AUTO Mask         */
#define CCU1_CLK_M4_SCT_STAT_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_SCT_STAT: WAKEUP Position   */
#define CCU1_CLK_M4_SCT_STAT_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_SCT_STAT_WAKEUP_Pos)             /*!< CCU1 CLK_M4_SCT_STAT: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_USB1_CFG  ---------------------------- */
#define CCU1_CLK_M4_USB1_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_USB1_CFG: RUN Position      */
#define CCU1_CLK_M4_USB1_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_USB1_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_USB1_CFG: RUN Mask          */
#define CCU1_CLK_M4_USB1_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_USB1_CFG: AUTO Position     */
#define CCU1_CLK_M4_USB1_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_USB1_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_USB1_CFG: AUTO Mask         */
#define CCU1_CLK_M4_USB1_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_USB1_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_USB1_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_USB1_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_USB1_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_USB1_STAT  --------------------------- */
#define CCU1_CLK_M4_USB1_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_USB1_STAT: RUN Position     */
#define CCU1_CLK_M4_USB1_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_USB1_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_USB1_STAT: RUN Mask         */
#define CCU1_CLK_M4_USB1_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_USB1_STAT: AUTO Position    */
#define CCU1_CLK_M4_USB1_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_USB1_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_USB1_STAT: AUTO Mask        */
#define CCU1_CLK_M4_USB1_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_USB1_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_USB1_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_USB1_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_USB1_STAT: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_EMCDIV_CFG  --------------------------- */
#define CCU1_CLK_M4_EMCDIV_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_EMCDIV_CFG: RUN Position    */
#define CCU1_CLK_M4_EMCDIV_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_EMCDIV_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_EMCDIV_CFG: RUN Mask        */
#define CCU1_CLK_M4_EMCDIV_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_EMCDIV_CFG: AUTO Position   */
#define CCU1_CLK_M4_EMCDIV_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_EMCDIV_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_EMCDIV_CFG: AUTO Mask       */
#define CCU1_CLK_M4_EMCDIV_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_EMCDIV_CFG: WAKEUP Position */
#define CCU1_CLK_M4_EMCDIV_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_EMCDIV_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_EMCDIV_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_EMCDIV_STAT  -------------------------- */
#define CCU1_CLK_M4_EMCDIV_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_EMCDIV_STAT: RUN Position   */
#define CCU1_CLK_M4_EMCDIV_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_EMCDIV_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_EMCDIV_STAT: RUN Mask       */
#define CCU1_CLK_M4_EMCDIV_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_EMCDIV_STAT: AUTO Position  */
#define CCU1_CLK_M4_EMCDIV_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_EMCDIV_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_EMCDIV_STAT: AUTO Mask      */
#define CCU1_CLK_M4_EMCDIV_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_EMCDIV_STAT: WAKEUP Position */
#define CCU1_CLK_M4_EMCDIV_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_EMCDIV_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_EMCDIV_STAT: WAKEUP Mask    */

/* ---------------------------  CCU1_CLK_M4_FLASHA_CFG  --------------------------- */
#define CCU1_CLK_M4_FLASHA_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_FLASHA_CFG: RUN Position    */
#define CCU1_CLK_M4_FLASHA_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_FLASHA_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_FLASHA_CFG: RUN Mask        */
#define CCU1_CLK_M4_FLASHA_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_FLASHA_CFG: AUTO Position   */
#define CCU1_CLK_M4_FLASHA_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_FLASHA_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_FLASHA_CFG: AUTO Mask       */
#define CCU1_CLK_M4_FLASHA_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_FLASHA_CFG: WAKEUP Position */
#define CCU1_CLK_M4_FLASHA_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_FLASHA_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_FLASHA_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_FLASHA_STAT  -------------------------- */
#define CCU1_CLK_M4_FLASHA_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_FLASHA_STAT: RUN Position   */
#define CCU1_CLK_M4_FLASHA_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_FLASHA_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_FLASHA_STAT: RUN Mask       */
#define CCU1_CLK_M4_FLASHA_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_FLASHA_STAT: AUTO Position  */
#define CCU1_CLK_M4_FLASHA_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_FLASHA_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_FLASHA_STAT: AUTO Mask      */
#define CCU1_CLK_M4_FLASHA_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_FLASHA_STAT: WAKEUP Position */
#define CCU1_CLK_M4_FLASHA_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_FLASHA_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_FLASHA_STAT: WAKEUP Mask    */

/* ---------------------------  CCU1_CLK_M4_FLASHB_CFG  --------------------------- */
#define CCU1_CLK_M4_FLASHB_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_FLASHB_CFG: RUN Position    */
#define CCU1_CLK_M4_FLASHB_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_FLASHB_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_FLASHB_CFG: RUN Mask        */
#define CCU1_CLK_M4_FLASHB_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_FLASHB_CFG: AUTO Position   */
#define CCU1_CLK_M4_FLASHB_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_FLASHB_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_FLASHB_CFG: AUTO Mask       */
#define CCU1_CLK_M4_FLASHB_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_FLASHB_CFG: WAKEUP Position */
#define CCU1_CLK_M4_FLASHB_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_FLASHB_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_FLASHB_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_FLASHB_STAT  -------------------------- */
#define CCU1_CLK_M4_FLASHB_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_FLASHB_STAT: RUN Position   */
#define CCU1_CLK_M4_FLASHB_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_FLASHB_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_FLASHB_STAT: RUN Mask       */
#define CCU1_CLK_M4_FLASHB_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_FLASHB_STAT: AUTO Position  */
#define CCU1_CLK_M4_FLASHB_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_FLASHB_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_FLASHB_STAT: AUTO Mask      */
#define CCU1_CLK_M4_FLASHB_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_FLASHB_STAT: WAKEUP Position */
#define CCU1_CLK_M4_FLASHB_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_FLASHB_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_FLASHB_STAT: WAKEUP Mask    */

/* ----------------------------  CCU1_CLK_M4_M0APP_CFG  --------------------------- */
#define CCU1_CLK_M4_M0APP_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_M0APP_CFG: RUN Position     */
#define CCU1_CLK_M4_M0APP_CFG_RUN_Msk         (0x01UL << CCU1_CLK_M4_M0APP_CFG_RUN_Pos)               /*!< CCU1 CLK_M4_M0APP_CFG: RUN Mask         */
#define CCU1_CLK_M4_M0APP_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_M0APP_CFG: AUTO Position    */
#define CCU1_CLK_M4_M0APP_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_M4_M0APP_CFG_AUTO_Pos)              /*!< CCU1 CLK_M4_M0APP_CFG: AUTO Mask        */
#define CCU1_CLK_M4_M0APP_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_M0APP_CFG: WAKEUP Position  */
#define CCU1_CLK_M4_M0APP_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_M0APP_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_M4_M0APP_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_M0APP_STAT  --------------------------- */
#define CCU1_CLK_M4_M0APP_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_M0APP_STAT: RUN Position    */
#define CCU1_CLK_M4_M0APP_STAT_RUN_Msk        (0x01UL << CCU1_CLK_M4_M0APP_STAT_RUN_Pos)              /*!< CCU1 CLK_M4_M0APP_STAT: RUN Mask        */
#define CCU1_CLK_M4_M0APP_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_M0APP_STAT: AUTO Position   */
#define CCU1_CLK_M4_M0APP_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_M4_M0APP_STAT_AUTO_Pos)             /*!< CCU1 CLK_M4_M0APP_STAT: AUTO Mask       */
#define CCU1_CLK_M4_M0APP_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_M0APP_STAT: WAKEUP Position */
#define CCU1_CLK_M4_M0APP_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_M0APP_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_M4_M0APP_STAT: WAKEUP Mask     */

/* ----------------------------  CCU1_CLK_M4_ADCHS_CFG  --------------------------- */
#define CCU1_CLK_M4_ADCHS_CFG_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_ADCHS_CFG: RUN Position     */
#define CCU1_CLK_M4_ADCHS_CFG_RUN_Msk         (0x01UL << CCU1_CLK_M4_ADCHS_CFG_RUN_Pos)               /*!< CCU1 CLK_M4_ADCHS_CFG: RUN Mask         */
#define CCU1_CLK_M4_ADCHS_CFG_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_ADCHS_CFG: AUTO Position    */
#define CCU1_CLK_M4_ADCHS_CFG_AUTO_Msk        (0x01UL << CCU1_CLK_M4_ADCHS_CFG_AUTO_Pos)              /*!< CCU1 CLK_M4_ADCHS_CFG: AUTO Mask        */
#define CCU1_CLK_M4_ADCHS_CFG_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_ADCHS_CFG: WAKEUP Position  */
#define CCU1_CLK_M4_ADCHS_CFG_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_ADCHS_CFG_WAKEUP_Pos)            /*!< CCU1 CLK_M4_ADCHS_CFG: WAKEUP Mask      */

/* ---------------------------  CCU1_CLK_M4_ADCHS_STAT  --------------------------- */
#define CCU1_CLK_M4_ADCHS_STAT_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_ADCHS_STAT: RUN Position    */
#define CCU1_CLK_M4_ADCHS_STAT_RUN_Msk        (0x01UL << CCU1_CLK_M4_ADCHS_STAT_RUN_Pos)              /*!< CCU1 CLK_M4_ADCHS_STAT: RUN Mask        */
#define CCU1_CLK_M4_ADCHS_STAT_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_ADCHS_STAT: AUTO Position   */
#define CCU1_CLK_M4_ADCHS_STAT_AUTO_Msk       (0x01UL << CCU1_CLK_M4_ADCHS_STAT_AUTO_Pos)             /*!< CCU1 CLK_M4_ADCHS_STAT: AUTO Mask       */
#define CCU1_CLK_M4_ADCHS_STAT_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_ADCHS_STAT: WAKEUP Position */
#define CCU1_CLK_M4_ADCHS_STAT_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_ADCHS_STAT_WAKEUP_Pos)           /*!< CCU1 CLK_M4_ADCHS_STAT: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_EEPROM_CFG  --------------------------- */
#define CCU1_CLK_M4_EEPROM_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_EEPROM_CFG: RUN Position    */
#define CCU1_CLK_M4_EEPROM_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_EEPROM_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_EEPROM_CFG: RUN Mask        */
#define CCU1_CLK_M4_EEPROM_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_EEPROM_CFG: AUTO Position   */
#define CCU1_CLK_M4_EEPROM_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_EEPROM_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_EEPROM_CFG: AUTO Mask       */
#define CCU1_CLK_M4_EEPROM_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_EEPROM_CFG: WAKEUP Position */
#define CCU1_CLK_M4_EEPROM_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_EEPROM_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_EEPROM_CFG: WAKEUP Mask     */

