roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------  CCU1_CLK_M4_USART3_CFG  --------------------------- */
#define CCU1_CLK_M4_USART3_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_USART3_CFG: RUN Position    */
#define CCU1_CLK_M4_USART3_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_USART3_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_USART3_CFG: RUN Mask        */
#define CCU1_CLK_M4_USART3_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_USART3_CFG: AUTO Position   */
#define CCU1_CLK_M4_USART3_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_USART3_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_USART3_CFG: AUTO Mask       */
#define CCU1_CLK_M4_USART3_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_USART3_CFG: WAKEUP Position */
#define CCU1_CLK_M4_USART3_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_USART3_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_USART3_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_USART3_STAT  -------------------------- */
#define CCU1_CLK_M4_USART3_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_USART3_STAT: RUN Position   */
#define CCU1_CLK_M4_USART3_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_USART3_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_USART3_STAT: RUN Mask       */
#define CCU1_CLK_M4_USART3_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_USART3_STAT: AUTO Position  */
#define CCU1_CLK_M4_USART3_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_USART3_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_USART3_STAT: AUTO Mask      */
#define CCU1_CLK_M4_USART3_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_USART3_STAT: WAKEUP Position */
#define CCU1_CLK_M4_USART3_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_USART3_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_USART3_STAT: WAKEUP Mask    */

/* ---------------------------  CCU1_CLK_M4_TIMER2_CFG  --------------------------- */
#define CCU1_CLK_M4_TIMER2_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_TIMER2_CFG: RUN Position    */
#define CCU1_CLK_M4_TIMER2_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_TIMER2_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_TIMER2_CFG: RUN Mask        */
#define CCU1_CLK_M4_TIMER2_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_TIMER2_CFG: AUTO Position   */
#define CCU1_CLK_M4_TIMER2_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_TIMER2_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_TIMER2_CFG: AUTO Mask       */
#define CCU1_CLK_M4_TIMER2_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_TIMER2_CFG: WAKEUP Position */
#define CCU1_CLK_M4_TIMER2_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_TIMER2_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_TIMER2_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_TIMER2_STAT  -------------------------- */
#define CCU1_CLK_M4_TIMER2_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_TIMER2_STAT: RUN Position   */
#define CCU1_CLK_M4_TIMER2_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_TIMER2_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_TIMER2_STAT: RUN Mask       */
#define CCU1_CLK_M4_TIMER2_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_TIMER2_STAT: AUTO Position  */
#define CCU1_CLK_M4_TIMER2_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_TIMER2_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_TIMER2_STAT: AUTO Mask      */
#define CCU1_CLK_M4_TIMER2_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_TIMER2_STAT: WAKEUP Position */
#define CCU1_CLK_M4_TIMER2_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_TIMER2_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_TIMER2_STAT: WAKEUP Mask    */

/* ---------------------------  CCU1_CLK_M4_TIMER3_CFG  --------------------------- */
#define CCU1_CLK_M4_TIMER3_CFG_RUN_Pos        0                                                       /*!< CCU1 CLK_M4_TIMER3_CFG: RUN Position    */
#define CCU1_CLK_M4_TIMER3_CFG_RUN_Msk        (0x01UL << CCU1_CLK_M4_TIMER3_CFG_RUN_Pos)              /*!< CCU1 CLK_M4_TIMER3_CFG: RUN Mask        */
#define CCU1_CLK_M4_TIMER3_CFG_AUTO_Pos       1                                                       /*!< CCU1 CLK_M4_TIMER3_CFG: AUTO Position   */
#define CCU1_CLK_M4_TIMER3_CFG_AUTO_Msk       (0x01UL << CCU1_CLK_M4_TIMER3_CFG_AUTO_Pos)             /*!< CCU1 CLK_M4_TIMER3_CFG: AUTO Mask       */
#define CCU1_CLK_M4_TIMER3_CFG_WAKEUP_Pos     2                                                       /*!< CCU1 CLK_M4_TIMER3_CFG: WAKEUP Position */
#define CCU1_CLK_M4_TIMER3_CFG_WAKEUP_Msk     (0x01UL << CCU1_CLK_M4_TIMER3_CFG_WAKEUP_Pos)           /*!< CCU1 CLK_M4_TIMER3_CFG: WAKEUP Mask     */

/* ---------------------------  CCU1_CLK_M4_TIMER3_STAT  -------------------------- */
#define CCU1_CLK_M4_TIMER3_STAT_RUN_Pos       0                                                       /*!< CCU1 CLK_M4_TIMER3_STAT: RUN Position   */
#define CCU1_CLK_M4_TIMER3_STAT_RUN_Msk       (0x01UL << CCU1_CLK_M4_TIMER3_STAT_RUN_Pos)             /*!< CCU1 CLK_M4_TIMER3_STAT: RUN Mask       */
#define CCU1_CLK_M4_TIMER3_STAT_AUTO_Pos      1                                                       /*!< CCU1 CLK_M4_TIMER3_STAT: AUTO Position  */
#define CCU1_CLK_M4_TIMER3_STAT_AUTO_Msk      (0x01UL << CCU1_CLK_M4_TIMER3_STAT_AUTO_Pos)            /*!< CCU1 CLK_M4_TIMER3_STAT: AUTO Mask      */
#define CCU1_CLK_M4_TIMER3_STAT_WAKEUP_Pos    2                                                       /*!< CCU1 CLK_M4_TIMER3_STAT: WAKEUP Position */
#define CCU1_CLK_M4_TIMER3_STAT_WAKEUP_Msk    (0x01UL << CCU1_CLK_M4_TIMER3_STAT_WAKEUP_Pos)          /*!< CCU1 CLK_M4_TIMER3_STAT: WAKEUP Mask    */

/* ----------------------------  CCU1_CLK_M4_SSP1_CFG  ---------------------------- */
#define CCU1_CLK_M4_SSP1_CFG_RUN_Pos          0                                                       /*!< CCU1 CLK_M4_SSP1_CFG: RUN Position      */
#define CCU1_CLK_M4_SSP1_CFG_RUN_Msk          (0x01UL << CCU1_CLK_M4_SSP1_CFG_RUN_Pos)                /*!< CCU1 CLK_M4_SSP1_CFG: RUN Mask          */
#define CCU1_CLK_M4_SSP1_CFG_AUTO_Pos         1                                                       /*!< CCU1 CLK_M4_SSP1_CFG: AUTO Position     */
#define CCU1_CLK_M4_SSP1_CFG_AUTO_Msk         (0x01UL << CCU1_CLK_M4_SSP1_CFG_AUTO_Pos)               /*!< CCU1 CLK_M4_SSP1_CFG: AUTO Mask         */
#define CCU1_CLK_M4_SSP1_CFG_WAKEUP_Pos       2                                                       /*!< CCU1 CLK_M4_SSP1_CFG: WAKEUP Position   */
#define CCU1_CLK_M4_SSP1_CFG_WAKEUP_Msk       (0x01UL << CCU1_CLK_M4_SSP1_CFG_WAKEUP_Pos)             /*!< CCU1 CLK_M4_SSP1_CFG: WAKEUP Mask       */

/* ----------------------------  CCU1_CLK_M4_SSP1_STAT  --------------------------- */
#define CCU1_CLK_M4_SSP1_STAT_RUN_Pos         0                                                       /*!< CCU1 CLK_M4_SSP1_STAT: RUN Position     */
#define CCU1_CLK_M4_SSP1_STAT_RUN_Msk         (0x01UL << CCU1_CLK_M4_SSP1_STAT_RUN_Pos)               /*!< CCU1 CLK_M4_SSP1_STAT: RUN Mask         */
#define CCU1_CLK_M4_SSP1_STAT_AUTO_Pos        1                                                       /*!< CCU1 CLK_M4_SSP1_STAT: AUTO Position    */
#define CCU1_CLK_M4_SSP1_STAT_AUTO_Msk        (0x01UL << CCU1_CLK_M4_SSP1_STAT_AUTO_Pos)              /*!< CCU1 CLK_M4_SSP1_STAT: AUTO Mask        */
#define CCU1_CLK_M4_SSP1_STAT_WAKEUP_Pos      2                                                       /*!< CCU1 CLK_M4_SSP1_STAT: WAKEUP Position  */
#define CCU1_CLK_M4_SSP1_STAT_WAKEUP_Msk      (0x01UL << CCU1_CLK_M4_SSP1_STAT_WAKEUP_Pos)            /*!< CCU1 CLK_M4_SSP1_STAT: WAKEUP Mask      */

/* -----------------------------  CCU1_CLK_M4_QEI_CFG  ---------------------------- */
#define CCU1_CLK_M4_QEI_CFG_RUN_Pos           0                                                       /*!< CCU1 CLK_M4_QEI_CFG: RUN Position       */
#define CCU1_CLK_M4_QEI_CFG_RUN_Msk           (0x01UL << CCU1_CLK_M4_QEI_CFG_RUN_Pos)                 /*!< CCU1 CLK_M4_QEI_CFG: RUN Mask           */
#define CCU1_CLK_M4_QEI_CFG_AUTO_Pos          1                                                       /*!< CCU1 CLK_M4_QEI_CFG: AUTO Position      */
#define CCU1_CLK_M4_QEI_CFG_AUTO_Msk          (0x01UL << CCU1_CLK_M4_QEI_CFG_AUTO_Pos)                /*!< CCU1 CLK_M4_QEI_CFG: AUTO Mask          */
#define CCU1_CLK_M4_QEI_CFG_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_M4_QEI_CFG: WAKEUP Position    */
#define CCU1_CLK_M4_QEI_CFG_WAKEUP_Msk        (0x01UL << CCU1_CLK_M4_QEI_CFG_WAKEUP_Pos)              /*!< CCU1 CLK_M4_QEI_CFG: WAKEUP Mask        */

