roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  CCU1_CLK_USB1_STAT  ----------------------------- */
#define CCU1_CLK_USB1_STAT_RUN_Pos            0                                                       /*!< CCU1 CLK_USB1_STAT: RUN Position        */
#define CCU1_CLK_USB1_STAT_RUN_Msk            (0x01UL << CCU1_CLK_USB1_STAT_RUN_Pos)                  /*!< CCU1 CLK_USB1_STAT: RUN Mask            */
#define CCU1_CLK_USB1_STAT_AUTO_Pos           1                                                       /*!< CCU1 CLK_USB1_STAT: AUTO Position       */
#define CCU1_CLK_USB1_STAT_AUTO_Msk           (0x01UL << CCU1_CLK_USB1_STAT_AUTO_Pos)                 /*!< CCU1 CLK_USB1_STAT: AUTO Mask           */
#define CCU1_CLK_USB1_STAT_WAKEUP_Pos         2                                                       /*!< CCU1 CLK_USB1_STAT: WAKEUP Position     */
#define CCU1_CLK_USB1_STAT_WAKEUP_Msk         (0x01UL << CCU1_CLK_USB1_STAT_WAKEUP_Pos)               /*!< CCU1 CLK_USB1_STAT: WAKEUP Mask         */

/* ------------------------------  CCU1_CLK_SPI_CFG  ------------------------------ */
#define CCU1_CLK_SPI_CFG_RUN_Pos              0                                                       /*!< CCU1 CLK_SPI_CFG: RUN Position          */
#define CCU1_CLK_SPI_CFG_RUN_Msk              (0x01UL << CCU1_CLK_SPI_CFG_RUN_Pos)                    /*!< CCU1 CLK_SPI_CFG: RUN Mask              */
#define CCU1_CLK_SPI_CFG_AUTO_Pos             1                                                       /*!< CCU1 CLK_SPI_CFG: AUTO Position         */
#define CCU1_CLK_SPI_CFG_AUTO_Msk             (0x01UL << CCU1_CLK_SPI_CFG_AUTO_Pos)                   /*!< CCU1 CLK_SPI_CFG: AUTO Mask             */
#define CCU1_CLK_SPI_CFG_WAKEUP_Pos           2                                                       /*!< CCU1 CLK_SPI_CFG: WAKEUP Position       */
#define CCU1_CLK_SPI_CFG_WAKEUP_Msk           (0x01UL << CCU1_CLK_SPI_CFG_WAKEUP_Pos)                 /*!< CCU1 CLK_SPI_CFG: WAKEUP Mask           */

/* ------------------------------  CCU1_CLK_SPI_STAT  ----------------------------- */
#define CCU1_CLK_SPI_STAT_RUN_Pos             0                                                       /*!< CCU1 CLK_SPI_STAT: RUN Position         */
#define CCU1_CLK_SPI_STAT_RUN_Msk             (0x01UL << CCU1_CLK_SPI_STAT_RUN_Pos)                   /*!< CCU1 CLK_SPI_STAT: RUN Mask             */
#define CCU1_CLK_SPI_STAT_AUTO_Pos            1                                                       /*!< CCU1 CLK_SPI_STAT: AUTO Position        */
#define CCU1_CLK_SPI_STAT_AUTO_Msk            (0x01UL << CCU1_CLK_SPI_STAT_AUTO_Pos)                  /*!< CCU1 CLK_SPI_STAT: AUTO Mask            */
#define CCU1_CLK_SPI_STAT_WAKEUP_Pos          2                                                       /*!< CCU1 CLK_SPI_STAT: WAKEUP Position      */
#define CCU1_CLK_SPI_STAT_WAKEUP_Msk          (0x01UL << CCU1_CLK_SPI_STAT_WAKEUP_Pos)                /*!< CCU1 CLK_SPI_STAT: WAKEUP Mask          */

/* -----------------------------  CCU1_CLK_ADCHS_CFG  ----------------------------- */
#define CCU1_CLK_ADCHS_CFG_RUN_Pos            0                                                       /*!< CCU1 CLK_ADCHS_CFG: RUN Position        */
#define CCU1_CLK_ADCHS_CFG_RUN_Msk            (0x01UL << CCU1_CLK_ADCHS_CFG_RUN_Pos)                  /*!< CCU1 CLK_ADCHS_CFG: RUN Mask            */
#define CCU1_CLK_ADCHS_CFG_AUTO_Pos           1                                                       /*!< CCU1 CLK_ADCHS_CFG: AUTO Position       */
#define CCU1_CLK_ADCHS_CFG_AUTO_Msk           (0x01UL << CCU1_CLK_ADCHS_CFG_AUTO_Pos)                 /*!< CCU1 CLK_ADCHS_CFG: AUTO Mask           */
#define CCU1_CLK_ADCHS_CFG_WAKEUP_Pos         2                                                       /*!< CCU1 CLK_ADCHS_CFG: WAKEUP Position     */
#define CCU1_CLK_ADCHS_CFG_WAKEUP_Msk         (0x01UL << CCU1_CLK_ADCHS_CFG_WAKEUP_Pos)               /*!< CCU1 CLK_ADCHS_CFG: WAKEUP Mask         */

/* -----------------------------  CCU1_CLK_ADCHS_STAT  ---------------------------- */
#define CCU1_CLK_ADCHS_STAT_RUN_Pos           0                                                       /*!< CCU1 CLK_ADCHS_STAT: RUN Position       */
#define CCU1_CLK_ADCHS_STAT_RUN_Msk           (0x01UL << CCU1_CLK_ADCHS_STAT_RUN_Pos)                 /*!< CCU1 CLK_ADCHS_STAT: RUN Mask           */
#define CCU1_CLK_ADCHS_STAT_AUTO_Pos          1                                                       /*!< CCU1 CLK_ADCHS_STAT: AUTO Position      */
#define CCU1_CLK_ADCHS_STAT_AUTO_Msk          (0x01UL << CCU1_CLK_ADCHS_STAT_AUTO_Pos)                /*!< CCU1 CLK_ADCHS_STAT: AUTO Mask          */
#define CCU1_CLK_ADCHS_STAT_WAKEUP_Pos        2                                                       /*!< CCU1 CLK_ADCHS_STAT: WAKEUP Position    */
#define CCU1_CLK_ADCHS_STAT_WAKEUP_Msk        (0x01UL << CCU1_CLK_ADCHS_STAT_WAKEUP_Pos)              /*!< CCU1 CLK_ADCHS_STAT: WAKEUP Mask        */


/* ================================================================================ */
/* ================          struct 'CCU2' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------------  CCU2_PM  ---------------------------------- */
#define CCU2_PM_PD_Pos                        0                                                       /*!< CCU2 PM: PD Position                    */
#define CCU2_PM_PD_Msk                        (0x01UL << CCU2_PM_PD_Pos)                              /*!< CCU2 PM: PD Mask                        */

/* -------------------------------  CCU2_BASE_STAT  ------------------------------- */
#define CCU2_BASE_STAT_BASE_UART3_CLK_Pos     1                                                       /*!< CCU2 BASE_STAT: BASE_UART3_CLK Position */
#define CCU2_BASE_STAT_BASE_UART3_CLK_Msk     (0x01UL << CCU2_BASE_STAT_BASE_UART3_CLK_Pos)           /*!< CCU2 BASE_STAT: BASE_UART3_CLK Mask     */
#define CCU2_BASE_STAT_BASE_UART2_CLK_Pos     2                                                       /*!< CCU2 BASE_STAT: BASE_UART2_CLK Position */
#define CCU2_BASE_STAT_BASE_UART2_CLK_Msk     (0x01UL << CCU2_BASE_STAT_BASE_UART2_CLK_Pos)           /*!< CCU2 BASE_STAT: BASE_UART2_CLK Mask     */
#define CCU2_BASE_STAT_BASE_UART1_CLK_Pos     3                                                       /*!< CCU2 BASE_STAT: BASE_UART1_CLK Position */
#define CCU2_BASE_STAT_BASE_UART1_CLK_Msk     (0x01UL << CCU2_BASE_STAT_BASE_UART1_CLK_Pos)           /*!< CCU2 BASE_STAT: BASE_UART1_CLK Mask     */
#define CCU2_BASE_STAT_BASE_UART0_CLK_Pos     4                                                       /*!< CCU2 BASE_STAT: BASE_UART0_CLK Position */
#define CCU2_BASE_STAT_BASE_UART0_CLK_Msk     (0x01UL << CCU2_BASE_STAT_BASE_UART0_CLK_Pos)           /*!< CCU2 BASE_STAT: BASE_UART0_CLK Mask     */
#define CCU2_BASE_STAT_BASE_SSP1_CLK_Pos      5                                                       /*!< CCU2 BASE_STAT: BASE_SSP1_CLK Position  */
#define CCU2_BASE_STAT_BASE_SSP1_CLK_Msk      (0x01UL << CCU2_BASE_STAT_BASE_SSP1_CLK_Pos)            /*!< CCU2 BASE_STAT: BASE_SSP1_CLK Mask      */
#define CCU2_BASE_STAT_BASE_SSP0_CLK_Pos      6                                                       /*!< CCU2 BASE_STAT: BASE_SSP0_CLK Position  */
#define CCU2_BASE_STAT_BASE_SSP0_CLK_Msk      (0x01UL << CCU2_BASE_STAT_BASE_SSP0_CLK_Pos)            /*!< CCU2 BASE_STAT: BASE_SSP0_CLK Mask      */

