roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  CCU2_CLK_AUDIO_CFG  ----------------------------- */
#define CCU2_CLK_AUDIO_CFG_RUN_Pos            0                                                       /*!< CCU2 CLK_AUDIO_CFG: RUN Position        */
#define CCU2_CLK_AUDIO_CFG_RUN_Msk            (0x01UL << CCU2_CLK_AUDIO_CFG_RUN_Pos)                  /*!< CCU2 CLK_AUDIO_CFG: RUN Mask            */
#define CCU2_CLK_AUDIO_CFG_AUTO_Pos           1                                                       /*!< CCU2 CLK_AUDIO_CFG: AUTO Position       */
#define CCU2_CLK_AUDIO_CFG_AUTO_Msk           (0x01UL << CCU2_CLK_AUDIO_CFG_AUTO_Pos)                 /*!< CCU2 CLK_AUDIO_CFG: AUTO Mask           */
#define CCU2_CLK_AUDIO_CFG_WAKEUP_Pos         2                                                       /*!< CCU2 CLK_AUDIO_CFG: WAKEUP Position     */
#define CCU2_CLK_AUDIO_CFG_WAKEUP_Msk         (0x01UL << CCU2_CLK_AUDIO_CFG_WAKEUP_Pos)               /*!< CCU2 CLK_AUDIO_CFG: WAKEUP Mask         */

/* -----------------------------  CCU2_CLK_AUDIO_STAT  ---------------------------- */
#define CCU2_CLK_AUDIO_STAT_RUN_Pos           0                                                       /*!< CCU2 CLK_AUDIO_STAT: RUN Position       */
#define CCU2_CLK_AUDIO_STAT_RUN_Msk           (0x01UL << CCU2_CLK_AUDIO_STAT_RUN_Pos)                 /*!< CCU2 CLK_AUDIO_STAT: RUN Mask           */
#define CCU2_CLK_AUDIO_STAT_AUTO_Pos          1                                                       /*!< CCU2 CLK_AUDIO_STAT: AUTO Position      */
#define CCU2_CLK_AUDIO_STAT_AUTO_Msk          (0x01UL << CCU2_CLK_AUDIO_STAT_AUTO_Pos)                /*!< CCU2 CLK_AUDIO_STAT: AUTO Mask          */
#define CCU2_CLK_AUDIO_STAT_WAKEUP_Pos        2                                                       /*!< CCU2 CLK_AUDIO_STAT: WAKEUP Position    */
#define CCU2_CLK_AUDIO_STAT_WAKEUP_Msk        (0x01UL << CCU2_CLK_AUDIO_STAT_WAKEUP_Pos)              /*!< CCU2 CLK_AUDIO_STAT: WAKEUP Mask        */

/* --------------------------  CCU2_CLK_APB2_USART3_CFG  -------------------------- */
#define CCU2_CLK_APB2_USART3_CFG_RUN_Pos      0                                                       /*!< CCU2 CLK_APB2_USART3_CFG: RUN Position  */
#define CCU2_CLK_APB2_USART3_CFG_RUN_Msk      (0x01UL << CCU2_CLK_APB2_USART3_CFG_RUN_Pos)            /*!< CCU2 CLK_APB2_USART3_CFG: RUN Mask      */
#define CCU2_CLK_APB2_USART3_CFG_AUTO_Pos     1                                                       /*!< CCU2 CLK_APB2_USART3_CFG: AUTO Position */
#define CCU2_CLK_APB2_USART3_CFG_AUTO_Msk     (0x01UL << CCU2_CLK_APB2_USART3_CFG_AUTO_Pos)           /*!< CCU2 CLK_APB2_USART3_CFG: AUTO Mask     */
#define CCU2_CLK_APB2_USART3_CFG_WAKEUP_Pos   2                                                       /*!< CCU2 CLK_APB2_USART3_CFG: WAKEUP Position */
#define CCU2_CLK_APB2_USART3_CFG_WAKEUP_Msk   (0x01UL << CCU2_CLK_APB2_USART3_CFG_WAKEUP_Pos)         /*!< CCU2 CLK_APB2_USART3_CFG: WAKEUP Mask   */

/* --------------------------  CCU2_CLK_APB2_USART3_STAT  ------------------------- */
#define CCU2_CLK_APB2_USART3_STAT_RUN_Pos     0                                                       /*!< CCU2 CLK_APB2_USART3_STAT: RUN Position */
#define CCU2_CLK_APB2_USART3_STAT_RUN_Msk     (0x01UL << CCU2_CLK_APB2_USART3_STAT_RUN_Pos)           /*!< CCU2 CLK_APB2_USART3_STAT: RUN Mask     */
#define CCU2_CLK_APB2_USART3_STAT_AUTO_Pos    1                                                       /*!< CCU2 CLK_APB2_USART3_STAT: AUTO Position */
#define CCU2_CLK_APB2_USART3_STAT_AUTO_Msk    (0x01UL << CCU2_CLK_APB2_USART3_STAT_AUTO_Pos)          /*!< CCU2 CLK_APB2_USART3_STAT: AUTO Mask    */
#define CCU2_CLK_APB2_USART3_STAT_WAKEUP_Pos  2                                                       /*!< CCU2 CLK_APB2_USART3_STAT: WAKEUP Position */
#define CCU2_CLK_APB2_USART3_STAT_WAKEUP_Msk  (0x01UL << CCU2_CLK_APB2_USART3_STAT_WAKEUP_Pos)        /*!< CCU2 CLK_APB2_USART3_STAT: WAKEUP Mask  */

/* --------------------------  CCU2_CLK_APB2_USART2_CFG  -------------------------- */
#define CCU2_CLK_APB2_USART2_CFG_RUN_Pos      0                                                       /*!< CCU2 CLK_APB2_USART2_CFG: RUN Position  */
#define CCU2_CLK_APB2_USART2_CFG_RUN_Msk      (0x01UL << CCU2_CLK_APB2_USART2_CFG_RUN_Pos)            /*!< CCU2 CLK_APB2_USART2_CFG: RUN Mask      */
#define CCU2_CLK_APB2_USART2_CFG_AUTO_Pos     1                                                       /*!< CCU2 CLK_APB2_USART2_CFG: AUTO Position */
#define CCU2_CLK_APB2_USART2_CFG_AUTO_Msk     (0x01UL << CCU2_CLK_APB2_USART2_CFG_AUTO_Pos)           /*!< CCU2 CLK_APB2_USART2_CFG: AUTO Mask     */
#define CCU2_CLK_APB2_USART2_CFG_WAKEUP_Pos   2                                                       /*!< CCU2 CLK_APB2_USART2_CFG: WAKEUP Position */
#define CCU2_CLK_APB2_USART2_CFG_WAKEUP_Msk   (0x01UL << CCU2_CLK_APB2_USART2_CFG_WAKEUP_Pos)         /*!< CCU2 CLK_APB2_USART2_CFG: WAKEUP Mask   */

/* --------------------------  CCU2_CLK_APB2_USART2_STAT  ------------------------- */
#define CCU2_CLK_APB2_USART2_STAT_RUN_Pos     0                                                       /*!< CCU2 CLK_APB2_USART2_STAT: RUN Position */
#define CCU2_CLK_APB2_USART2_STAT_RUN_Msk     (0x01UL << CCU2_CLK_APB2_USART2_STAT_RUN_Pos)           /*!< CCU2 CLK_APB2_USART2_STAT: RUN Mask     */
#define CCU2_CLK_APB2_USART2_STAT_AUTO_Pos    1                                                       /*!< CCU2 CLK_APB2_USART2_STAT: AUTO Position */
#define CCU2_CLK_APB2_USART2_STAT_AUTO_Msk    (0x01UL << CCU2_CLK_APB2_USART2_STAT_AUTO_Pos)          /*!< CCU2 CLK_APB2_USART2_STAT: AUTO Mask    */
#define CCU2_CLK_APB2_USART2_STAT_WAKEUP_Pos  2                                                       /*!< CCU2 CLK_APB2_USART2_STAT: WAKEUP Position */
#define CCU2_CLK_APB2_USART2_STAT_WAKEUP_Msk  (0x01UL << CCU2_CLK_APB2_USART2_STAT_WAKEUP_Pos)        /*!< CCU2 CLK_APB2_USART2_STAT: WAKEUP Mask  */

/* -------------------------  CCU2_CLK_APB0_UART1_BUS_CFG  ------------------------ */
#define CCU2_CLK_APB0_UART1_BUS_CFG_RUN_Pos   0                                                       /*!< CCU2 CLK_APB0_UART1_BUS_CFG: RUN Position */
#define CCU2_CLK_APB0_UART1_BUS_CFG_RUN_Msk   (0x01UL << CCU2_CLK_APB0_UART1_BUS_CFG_RUN_Pos)         /*!< CCU2 CLK_APB0_UART1_BUS_CFG: RUN Mask   */
#define CCU2_CLK_APB0_UART1_BUS_CFG_AUTO_Pos  1                                                       /*!< CCU2 CLK_APB0_UART1_BUS_CFG: AUTO Position */
#define CCU2_CLK_APB0_UART1_BUS_CFG_AUTO_Msk  (0x01UL << CCU2_CLK_APB0_UART1_BUS_CFG_AUTO_Pos)        /*!< CCU2 CLK_APB0_UART1_BUS_CFG: AUTO Mask  */
#define CCU2_CLK_APB0_UART1_BUS_CFG_WAKEUP_Pos 2                                                      /*!< CCU2 CLK_APB0_UART1_BUS_CFG: WAKEUP Position */
#define CCU2_CLK_APB0_UART1_BUS_CFG_WAKEUP_Msk (0x01UL << CCU2_CLK_APB0_UART1_BUS_CFG_WAKEUP_Pos)     /*!< CCU2 CLK_APB0_UART1_BUS_CFG: WAKEUP Mask */

/* --------------------------  CCU2_CLK_APB0_UART1_STAT  -------------------------- */
#define CCU2_CLK_APB0_UART1_STAT_RUN_Pos      0                                                       /*!< CCU2 CLK_APB0_UART1_STAT: RUN Position  */
#define CCU2_CLK_APB0_UART1_STAT_RUN_Msk      (0x01UL << CCU2_CLK_APB0_UART1_STAT_RUN_Pos)            /*!< CCU2 CLK_APB0_UART1_STAT: RUN Mask      */
#define CCU2_CLK_APB0_UART1_STAT_AUTO_Pos     1                                                       /*!< CCU2 CLK_APB0_UART1_STAT: AUTO Position */
#define CCU2_CLK_APB0_UART1_STAT_AUTO_Msk     (0x01UL << CCU2_CLK_APB0_UART1_STAT_AUTO_Pos)           /*!< CCU2 CLK_APB0_UART1_STAT: AUTO Mask     */
#define CCU2_CLK_APB0_UART1_STAT_WAKEUP_Pos   2                                                       /*!< CCU2 CLK_APB0_UART1_STAT: WAKEUP Position */
#define CCU2_CLK_APB0_UART1_STAT_WAKEUP_Msk   (0x01UL << CCU2_CLK_APB0_UART1_STAT_WAKEUP_Pos)         /*!< CCU2 CLK_APB0_UART1_STAT: WAKEUP Mask   */

/* --------------------------  CCU2_CLK_APB0_USART0_CFG  -------------------------- */
#define CCU2_CLK_APB0_USART0_CFG_RUN_Pos      0                                                       /*!< CCU2 CLK_APB0_USART0_CFG: RUN Position  */
#define CCU2_CLK_APB0_USART0_CFG_RUN_Msk      (0x01UL << CCU2_CLK_APB0_USART0_CFG_RUN_Pos)            /*!< CCU2 CLK_APB0_USART0_CFG: RUN Mask      */
#define CCU2_CLK_APB0_USART0_CFG_AUTO_Pos     1                                                       /*!< CCU2 CLK_APB0_USART0_CFG: AUTO Position */
#define CCU2_CLK_APB0_USART0_CFG_AUTO_Msk     (0x01UL << CCU2_CLK_APB0_USART0_CFG_AUTO_Pos)           /*!< CCU2 CLK_APB0_USART0_CFG: AUTO Mask     */
#define CCU2_CLK_APB0_USART0_CFG_WAKEUP_Pos   2                                                       /*!< CCU2 CLK_APB0_USART0_CFG: WAKEUP Position */
#define CCU2_CLK_APB0_USART0_CFG_WAKEUP_Msk   (0x01UL << CCU2_CLK_APB0_USART0_CFG_WAKEUP_Pos)         /*!< CCU2 CLK_APB0_USART0_CFG: WAKEUP Mask   */

/* --------------------------  CCU2_CLK_APB0_USART0_STAT  ------------------------- */
#define CCU2_CLK_APB0_USART0_STAT_RUN_Pos     0                                                       /*!< CCU2 CLK_APB0_USART0_STAT: RUN Position */
#define CCU2_CLK_APB0_USART0_STAT_RUN_Msk     (0x01UL << CCU2_CLK_APB0_USART0_STAT_RUN_Pos)           /*!< CCU2 CLK_APB0_USART0_STAT: RUN Mask     */
#define CCU2_CLK_APB0_USART0_STAT_AUTO_Pos    1                                                       /*!< CCU2 CLK_APB0_USART0_STAT: AUTO Position */
#define CCU2_CLK_APB0_USART0_STAT_AUTO_Msk    (0x01UL << CCU2_CLK_APB0_USART0_STAT_AUTO_Pos)          /*!< CCU2 CLK_APB0_USART0_STAT: AUTO Mask    */
#define CCU2_CLK_APB0_USART0_STAT_WAKEUP_Pos  2                                                       /*!< CCU2 CLK_APB0_USART0_STAT: WAKEUP Position */
#define CCU2_CLK_APB0_USART0_STAT_WAKEUP_Msk  (0x01UL << CCU2_CLK_APB0_USART0_STAT_WAKEUP_Pos)        /*!< CCU2 CLK_APB0_USART0_STAT: WAKEUP Mask  */

