roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------  CCU2_CLK_APB2_SSP1_CFG  --------------------------- */
#define CCU2_CLK_APB2_SSP1_CFG_RUN_Pos        0                                                       /*!< CCU2 CLK_APB2_SSP1_CFG: RUN Position    */
#define CCU2_CLK_APB2_SSP1_CFG_RUN_Msk        (0x01UL << CCU2_CLK_APB2_SSP1_CFG_RUN_Pos)              /*!< CCU2 CLK_APB2_SSP1_CFG: RUN Mask        */
#define CCU2_CLK_APB2_SSP1_CFG_AUTO_Pos       1                                                       /*!< CCU2 CLK_APB2_SSP1_CFG: AUTO Position   */
#define CCU2_CLK_APB2_SSP1_CFG_AUTO_Msk       (0x01UL << CCU2_CLK_APB2_SSP1_CFG_AUTO_Pos)             /*!< CCU2 CLK_APB2_SSP1_CFG: AUTO Mask       */
#define CCU2_CLK_APB2_SSP1_CFG_WAKEUP_Pos     2                                                       /*!< CCU2 CLK_APB2_SSP1_CFG: WAKEUP Position */
#define CCU2_CLK_APB2_SSP1_CFG_WAKEUP_Msk     (0x01UL << CCU2_CLK_APB2_SSP1_CFG_WAKEUP_Pos)           /*!< CCU2 CLK_APB2_SSP1_CFG: WAKEUP Mask     */

/* ---------------------------  CCU2_CLK_APB2_SSP1_STAT  -------------------------- */
#define CCU2_CLK_APB2_SSP1_STAT_RUN_Pos       0                                                       /*!< CCU2 CLK_APB2_SSP1_STAT: RUN Position   */
#define CCU2_CLK_APB2_SSP1_STAT_RUN_Msk       (0x01UL << CCU2_CLK_APB2_SSP1_STAT_RUN_Pos)             /*!< CCU2 CLK_APB2_SSP1_STAT: RUN Mask       */
#define CCU2_CLK_APB2_SSP1_STAT_AUTO_Pos      1                                                       /*!< CCU2 CLK_APB2_SSP1_STAT: AUTO Position  */
#define CCU2_CLK_APB2_SSP1_STAT_AUTO_Msk      (0x01UL << CCU2_CLK_APB2_SSP1_STAT_AUTO_Pos)            /*!< CCU2 CLK_APB2_SSP1_STAT: AUTO Mask      */
#define CCU2_CLK_APB2_SSP1_STAT_WAKEUP_Pos    2                                                       /*!< CCU2 CLK_APB2_SSP1_STAT: WAKEUP Position */
#define CCU2_CLK_APB2_SSP1_STAT_WAKEUP_Msk    (0x01UL << CCU2_CLK_APB2_SSP1_STAT_WAKEUP_Pos)          /*!< CCU2 CLK_APB2_SSP1_STAT: WAKEUP Mask    */

/* ---------------------------  CCU2_CLK_APB0_SSP0_CFG  --------------------------- */
#define CCU2_CLK_APB0_SSP0_CFG_RUN_Pos        0                                                       /*!< CCU2 CLK_APB0_SSP0_CFG: RUN Position    */
#define CCU2_CLK_APB0_SSP0_CFG_RUN_Msk        (0x01UL << CCU2_CLK_APB0_SSP0_CFG_RUN_Pos)              /*!< CCU2 CLK_APB0_SSP0_CFG: RUN Mask        */
#define CCU2_CLK_APB0_SSP0_CFG_AUTO_Pos       1                                                       /*!< CCU2 CLK_APB0_SSP0_CFG: AUTO Position   */
#define CCU2_CLK_APB0_SSP0_CFG_AUTO_Msk       (0x01UL << CCU2_CLK_APB0_SSP0_CFG_AUTO_Pos)             /*!< CCU2 CLK_APB0_SSP0_CFG: AUTO Mask       */
#define CCU2_CLK_APB0_SSP0_CFG_WAKEUP_Pos     2                                                       /*!< CCU2 CLK_APB0_SSP0_CFG: WAKEUP Position */
#define CCU2_CLK_APB0_SSP0_CFG_WAKEUP_Msk     (0x01UL << CCU2_CLK_APB0_SSP0_CFG_WAKEUP_Pos)           /*!< CCU2 CLK_APB0_SSP0_CFG: WAKEUP Mask     */

/* ---------------------------  CCU2_CLK_APB0_SSP0_STAT  -------------------------- */
#define CCU2_CLK_APB0_SSP0_STAT_RUN_Pos       0                                                       /*!< CCU2 CLK_APB0_SSP0_STAT: RUN Position   */
#define CCU2_CLK_APB0_SSP0_STAT_RUN_Msk       (0x01UL << CCU2_CLK_APB0_SSP0_STAT_RUN_Pos)             /*!< CCU2 CLK_APB0_SSP0_STAT: RUN Mask       */
#define CCU2_CLK_APB0_SSP0_STAT_AUTO_Pos      1                                                       /*!< CCU2 CLK_APB0_SSP0_STAT: AUTO Position  */
#define CCU2_CLK_APB0_SSP0_STAT_AUTO_Msk      (0x01UL << CCU2_CLK_APB0_SSP0_STAT_AUTO_Pos)            /*!< CCU2 CLK_APB0_SSP0_STAT: AUTO Mask      */
#define CCU2_CLK_APB0_SSP0_STAT_WAKEUP_Pos    2                                                       /*!< CCU2 CLK_APB0_SSP0_STAT: WAKEUP Position */
#define CCU2_CLK_APB0_SSP0_STAT_WAKEUP_Msk    (0x01UL << CCU2_CLK_APB0_SSP0_STAT_WAKEUP_Pos)          /*!< CCU2 CLK_APB0_SSP0_STAT: WAKEUP Mask    */

/* ------------------------------  CCU2_CLK_SDIO_CFG  ----------------------------- */
#define CCU2_CLK_SDIO_CFG_RUN_Pos             0                                                       /*!< CCU2 CLK_SDIO_CFG: RUN Position         */
#define CCU2_CLK_SDIO_CFG_RUN_Msk             (0x01UL << CCU2_CLK_SDIO_CFG_RUN_Pos)                   /*!< CCU2 CLK_SDIO_CFG: RUN Mask             */
#define CCU2_CLK_SDIO_CFG_AUTO_Pos            1                                                       /*!< CCU2 CLK_SDIO_CFG: AUTO Position        */
#define CCU2_CLK_SDIO_CFG_AUTO_Msk            (0x01UL << CCU2_CLK_SDIO_CFG_AUTO_Pos)                  /*!< CCU2 CLK_SDIO_CFG: AUTO Mask            */
#define CCU2_CLK_SDIO_CFG_WAKEUP_Pos          2                                                       /*!< CCU2 CLK_SDIO_CFG: WAKEUP Position      */
#define CCU2_CLK_SDIO_CFG_WAKEUP_Msk          (0x01UL << CCU2_CLK_SDIO_CFG_WAKEUP_Pos)                /*!< CCU2 CLK_SDIO_CFG: WAKEUP Mask          */

/* -----------------------------  CCU2_CLK_SDIO_STAT  ----------------------------- */
#define CCU2_CLK_SDIO_STAT_RUN_Pos            0                                                       /*!< CCU2 CLK_SDIO_STAT: RUN Position        */
#define CCU2_CLK_SDIO_STAT_RUN_Msk            (0x01UL << CCU2_CLK_SDIO_STAT_RUN_Pos)                  /*!< CCU2 CLK_SDIO_STAT: RUN Mask            */
#define CCU2_CLK_SDIO_STAT_AUTO_Pos           1                                                       /*!< CCU2 CLK_SDIO_STAT: AUTO Position       */
#define CCU2_CLK_SDIO_STAT_AUTO_Msk           (0x01UL << CCU2_CLK_SDIO_STAT_AUTO_Pos)                 /*!< CCU2 CLK_SDIO_STAT: AUTO Mask           */
#define CCU2_CLK_SDIO_STAT_WAKEUP_Pos         2                                                       /*!< CCU2 CLK_SDIO_STAT: WAKEUP Position     */
#define CCU2_CLK_SDIO_STAT_WAKEUP_Msk         (0x01UL << CCU2_CLK_SDIO_STAT_WAKEUP_Pos)               /*!< CCU2 CLK_SDIO_STAT: WAKEUP Mask         */


/* ================================================================================ */
/* ================          struct 'RGU' Position & Mask          ================ */
/* ================================================================================ */


/* -------------------------------  RGU_RESET_CTRL0  ------------------------------ */
#define RGU_RESET_CTRL0_CORE_RST_Pos          0                                                       /*!< RGU RESET_CTRL0: CORE_RST Position      */
#define RGU_RESET_CTRL0_CORE_RST_Msk          (0x01UL << RGU_RESET_CTRL0_CORE_RST_Pos)                /*!< RGU RESET_CTRL0: CORE_RST Mask          */
#define RGU_RESET_CTRL0_PERIPH_RST_Pos        1                                                       /*!< RGU RESET_CTRL0: PERIPH_RST Position    */
#define RGU_RESET_CTRL0_PERIPH_RST_Msk        (0x01UL << RGU_RESET_CTRL0_PERIPH_RST_Pos)              /*!< RGU RESET_CTRL0: PERIPH_RST Mask        */
#define RGU_RESET_CTRL0_MASTER_RST_Pos        2                                                       /*!< RGU RESET_CTRL0: MASTER_RST Position    */
#define RGU_RESET_CTRL0_MASTER_RST_Msk        (0x01UL << RGU_RESET_CTRL0_MASTER_RST_Pos)              /*!< RGU RESET_CTRL0: MASTER_RST Mask        */
#define RGU_RESET_CTRL0_WWDT_RST_Pos          4                                                       /*!< RGU RESET_CTRL0: WWDT_RST Position      */
#define RGU_RESET_CTRL0_WWDT_RST_Msk          (0x01UL << RGU_RESET_CTRL0_WWDT_RST_Pos)                /*!< RGU RESET_CTRL0: WWDT_RST Mask          */
#define RGU_RESET_CTRL0_CREG_RST_Pos          5                                                       /*!< RGU RESET_CTRL0: CREG_RST Position      */
#define RGU_RESET_CTRL0_CREG_RST_Msk          (0x01UL << RGU_RESET_CTRL0_CREG_RST_Pos)                /*!< RGU RESET_CTRL0: CREG_RST Mask          */
#define RGU_RESET_CTRL0_BUS_RST_Pos           8                                                       /*!< RGU RESET_CTRL0: BUS_RST Position       */
#define RGU_RESET_CTRL0_BUS_RST_Msk           (0x01UL << RGU_RESET_CTRL0_BUS_RST_Pos)                 /*!< RGU RESET_CTRL0: BUS_RST Mask           */
#define RGU_RESET_CTRL0_SCU_RST_Pos           9                                                       /*!< RGU RESET_CTRL0: SCU_RST Position       */
#define RGU_RESET_CTRL0_SCU_RST_Msk           (0x01UL << RGU_RESET_CTRL0_SCU_RST_Pos)                 /*!< RGU RESET_CTRL0: SCU_RST Mask           */
#define RGU_RESET_CTRL0_M0_SUB_RST_Pos        12                                                      /*!< RGU RESET_CTRL0: M0_SUB_RST Position    */
#define RGU_RESET_CTRL0_M0_SUB_RST_Msk        (0x01UL << RGU_RESET_CTRL0_M0_SUB_RST_Pos)              /*!< RGU RESET_CTRL0: M0_SUB_RST Mask        */
#define RGU_RESET_CTRL0_M4_RST_Pos            13                                                      /*!< RGU RESET_CTRL0: M4_RST Position        */
#define RGU_RESET_CTRL0_M4_RST_Msk            (0x01UL << RGU_RESET_CTRL0_M4_RST_Pos)                  /*!< RGU RESET_CTRL0: M4_RST Mask            */
#define RGU_RESET_CTRL0_LCD_RST_Pos           16                                                      /*!< RGU RESET_CTRL0: LCD_RST Position       */
#define RGU_RESET_CTRL0_LCD_RST_Msk           (0x01UL << RGU_RESET_CTRL0_LCD_RST_Pos)                 /*!< RGU RESET_CTRL0: LCD_RST Mask           */
#define RGU_RESET_CTRL0_USB0_RST_Pos          17                                                      /*!< RGU RESET_CTRL0: USB0_RST Position      */
#define RGU_RESET_CTRL0_USB0_RST_Msk          (0x01UL << RGU_RESET_CTRL0_USB0_RST_Pos)                /*!< RGU RESET_CTRL0: USB0_RST Mask          */
#define RGU_RESET_CTRL0_USB1_RST_Pos          18                                                      /*!< RGU RESET_CTRL0: USB1_RST Position      */
#define RGU_RESET_CTRL0_USB1_RST_Msk          (0x01UL << RGU_RESET_CTRL0_USB1_RST_Pos)                /*!< RGU RESET_CTRL0: USB1_RST Mask          */
#define RGU_RESET_CTRL0_DMA_RST_Pos           19                                                      /*!< RGU RESET_CTRL0: DMA_RST Position       */
#define RGU_RESET_CTRL0_DMA_RST_Msk           (0x01UL << RGU_RESET_CTRL0_DMA_RST_Pos)                 /*!< RGU RESET_CTRL0: DMA_RST Mask           */
#define RGU_RESET_CTRL0_SDIO_RST_Pos          20                                                      /*!< RGU RESET_CTRL0: SDIO_RST Position      */
#define RGU_RESET_CTRL0_SDIO_RST_Msk          (0x01UL << RGU_RESET_CTRL0_SDIO_RST_Pos)                /*!< RGU RESET_CTRL0: SDIO_RST Mask          */
#define RGU_RESET_CTRL0_EMC_RST_Pos           21                                                      /*!< RGU RESET_CTRL0: EMC_RST Position       */
#define RGU_RESET_CTRL0_EMC_RST_Msk           (0x01UL << RGU_RESET_CTRL0_EMC_RST_Pos)                 /*!< RGU RESET_CTRL0: EMC_RST Mask           */
#define RGU_RESET_CTRL0_ETHERNET_RST_Pos      22                                                      /*!< RGU RESET_CTRL0: ETHERNET_RST Position  */
#define RGU_RESET_CTRL0_ETHERNET_RST_Msk      (0x01UL << RGU_RESET_CTRL0_ETHERNET_RST_Pos)            /*!< RGU RESET_CTRL0: ETHERNET_RST Mask      */
#define RGU_RESET_CTRL0_FLASHA_RST_Pos        25                                                      /*!< RGU RESET_CTRL0: FLASHA_RST Position    */
#define RGU_RESET_CTRL0_FLASHA_RST_Msk        (0x01UL << RGU_RESET_CTRL0_FLASHA_RST_Pos)              /*!< RGU RESET_CTRL0: FLASHA_RST Mask        */
#define RGU_RESET_CTRL0_EEPROM_RST_Pos        27                                                      /*!< RGU RESET_CTRL0: EEPROM_RST Position    */
#define RGU_RESET_CTRL0_EEPROM_RST_Msk        (0x01UL << RGU_RESET_CTRL0_EEPROM_RST_Pos)              /*!< RGU RESET_CTRL0: EEPROM_RST Mask        */
#define RGU_RESET_CTRL0_GPIO_RST_Pos          28                                                      /*!< RGU RESET_CTRL0: GPIO_RST Position      */
#define RGU_RESET_CTRL0_GPIO_RST_Msk          (0x01UL << RGU_RESET_CTRL0_GPIO_RST_Pos)                /*!< RGU RESET_CTRL0: GPIO_RST Mask          */
#define RGU_RESET_CTRL0_FLASHB_RST_Pos        29                                                      /*!< RGU RESET_CTRL0: FLASHB_RST Position    */
#define RGU_RESET_CTRL0_FLASHB_RST_Msk        (0x01UL << RGU_RESET_CTRL0_FLASHB_RST_Pos)              /*!< RGU RESET_CTRL0: FLASHB_RST Mask        */

