roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------  RGU_RESET_ACTIVE_STATUS0  -------------------------- */
#define RGU_RESET_ACTIVE_STATUS0_CORE_RST_Pos 0                                                       /*!< RGU RESET_ACTIVE_STATUS0: CORE_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_CORE_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_CORE_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: CORE_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_PERIPH_RST_Pos 1                                                     /*!< RGU RESET_ACTIVE_STATUS0: PERIPH_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_PERIPH_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_PERIPH_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS0: PERIPH_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_MASTER_RST_Pos 2                                                     /*!< RGU RESET_ACTIVE_STATUS0: MASTER_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_MASTER_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_MASTER_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS0: MASTER_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_WWDT_RST_Pos 4                                                       /*!< RGU RESET_ACTIVE_STATUS0: WWDT_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_WWDT_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_WWDT_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: WWDT_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_CREG_RST_Pos 5                                                       /*!< RGU RESET_ACTIVE_STATUS0: CREG_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_CREG_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_CREG_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: CREG_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_BUS_RST_Pos  8                                                       /*!< RGU RESET_ACTIVE_STATUS0: BUS_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_BUS_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS0_BUS_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS0: BUS_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS0_SCU_RST_Pos  9                                                       /*!< RGU RESET_ACTIVE_STATUS0: SCU_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_SCU_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS0_SCU_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS0: SCU_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS0_M0SUB_RST_Pos 12                                                     /*!< RGU RESET_ACTIVE_STATUS0: M0SUB_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_M0SUB_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_M0SUB_RST_Pos)     /*!< RGU RESET_ACTIVE_STATUS0: M0SUB_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_M4_RST_Pos   13                                                      /*!< RGU RESET_ACTIVE_STATUS0: M4_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_M4_RST_Msk   (0x01UL << RGU_RESET_ACTIVE_STATUS0_M4_RST_Pos)         /*!< RGU RESET_ACTIVE_STATUS0: M4_RST Mask   */
#define RGU_RESET_ACTIVE_STATUS0_LCD_RST_Pos  16                                                      /*!< RGU RESET_ACTIVE_STATUS0: LCD_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_LCD_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS0_LCD_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS0: LCD_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS0_USB0_RST_Pos 17                                                      /*!< RGU RESET_ACTIVE_STATUS0: USB0_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_USB0_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_USB0_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: USB0_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_USB1_RST_Pos 18                                                      /*!< RGU RESET_ACTIVE_STATUS0: USB1_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_USB1_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_USB1_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: USB1_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_DMA_RST_Pos  19                                                      /*!< RGU RESET_ACTIVE_STATUS0: DMA_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_DMA_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS0_DMA_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS0: DMA_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS0_SDIO_RST_Pos 20                                                      /*!< RGU RESET_ACTIVE_STATUS0: SDIO_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_SDIO_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_SDIO_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: SDIO_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_EMC_RST_Pos  21                                                      /*!< RGU RESET_ACTIVE_STATUS0: EMC_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_EMC_RST_Msk  (0x01UL << RGU_RESET_ACTIVE_STATUS0_EMC_RST_Pos)        /*!< RGU RESET_ACTIVE_STATUS0: EMC_RST Mask  */
#define RGU_RESET_ACTIVE_STATUS0_ETHERNET_RST_Pos 22                                                  /*!< RGU RESET_ACTIVE_STATUS0: ETHERNET_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_ETHERNET_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_ETHERNET_RST_Pos)/*!< RGU RESET_ACTIVE_STATUS0: ETHERNET_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_FLASHA_RST_Pos 25                                                    /*!< RGU RESET_ACTIVE_STATUS0: FLASHA_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_FLASHA_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_FLASHA_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS0: FLASHA_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_EEPROM_RST_Pos 27                                                    /*!< RGU RESET_ACTIVE_STATUS0: EEPROM_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_EEPROM_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_EEPROM_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS0: EEPROM_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_GPIO_RST_Pos 28                                                      /*!< RGU RESET_ACTIVE_STATUS0: GPIO_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_GPIO_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_GPIO_RST_Pos)       /*!< RGU RESET_ACTIVE_STATUS0: GPIO_RST Mask */
#define RGU_RESET_ACTIVE_STATUS0_FLASHB_RST_Pos 29                                                    /*!< RGU RESET_ACTIVE_STATUS0: FLASHB_RST Position */
#define RGU_RESET_ACTIVE_STATUS0_FLASHB_RST_Msk (0x01UL << RGU_RESET_ACTIVE_STATUS0_FLASHB_RST_Pos)   /*!< RGU RESET_ACTIVE_STATUS0: FLASHB_RST Mask */

