roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  RGU_RESET_EXT_STAT2  ---------------------------- */
#define RGU_RESET_EXT_STAT2_PERIPHERAL_RESET_Pos 2                                                    /*!< RGU RESET_EXT_STAT2: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT2_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT2_PERIPHERAL_RESET_Pos) /*!< RGU RESET_EXT_STAT2: PERIPHERAL_RESET Mask */

/* -----------------------------  RGU_RESET_EXT_STAT5  ---------------------------- */
#define RGU_RESET_EXT_STAT5_CORE_RESET_Pos    1                                                       /*!< RGU RESET_EXT_STAT5: CORE_RESET Position */
#define RGU_RESET_EXT_STAT5_CORE_RESET_Msk    (0x01UL << RGU_RESET_EXT_STAT5_CORE_RESET_Pos)          /*!< RGU RESET_EXT_STAT5: CORE_RESET Mask    */

/* -----------------------------  RGU_RESET_EXT_STAT8  ---------------------------- */
#define RGU_RESET_EXT_STAT8_PERIPHERAL_RESET_Pos 2                                                    /*!< RGU RESET_EXT_STAT8: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT8_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT8_PERIPHERAL_RESET_Pos) /*!< RGU RESET_EXT_STAT8: PERIPHERAL_RESET Mask */

/* -----------------------------  RGU_RESET_EXT_STAT9  ---------------------------- */
#define RGU_RESET_EXT_STAT9_PERIPHERAL_RESET_Pos 2                                                    /*!< RGU RESET_EXT_STAT9: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT9_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT9_PERIPHERAL_RESET_Pos) /*!< RGU RESET_EXT_STAT9: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT12  ---------------------------- */
#define RGU_RESET_EXT_STAT12_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT12: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT12_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT12_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT12: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT13  ---------------------------- */
#define RGU_RESET_EXT_STAT13_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT13: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT13_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT13_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT13: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT16  ---------------------------- */
#define RGU_RESET_EXT_STAT16_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT16: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT16_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT16_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT16: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT17  ---------------------------- */
#define RGU_RESET_EXT_STAT17_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT17: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT17_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT17_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT17: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT18  ---------------------------- */
#define RGU_RESET_EXT_STAT18_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT18: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT18_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT18_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT18: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT19  ---------------------------- */
#define RGU_RESET_EXT_STAT19_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT19: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT19_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT19_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT19: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT20  ---------------------------- */
#define RGU_RESET_EXT_STAT20_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT20: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT20_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT20_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT20: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT21  ---------------------------- */
#define RGU_RESET_EXT_STAT21_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT21: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT21_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT21_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT21: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT22  ---------------------------- */
#define RGU_RESET_EXT_STAT22_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT22: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT22_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT22_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT22: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT25  ---------------------------- */
#define RGU_RESET_EXT_STAT25_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT25: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT25_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT25_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT25: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT27  ---------------------------- */
#define RGU_RESET_EXT_STAT27_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT27: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT27_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT27_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT27: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT28  ---------------------------- */
#define RGU_RESET_EXT_STAT28_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT28: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT28_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT28_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT28: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT29  ---------------------------- */
#define RGU_RESET_EXT_STAT29_MASTER_RESET_Pos 3                                                       /*!< RGU RESET_EXT_STAT29: MASTER_RESET Position */
#define RGU_RESET_EXT_STAT29_MASTER_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT29_MASTER_RESET_Pos)       /*!< RGU RESET_EXT_STAT29: MASTER_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT32  ---------------------------- */
#define RGU_RESET_EXT_STAT32_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT32: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT32_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT32_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT32: PERIPHERAL_RESET Mask */

