roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------  RGU_RESET_EXT_STAT58  ---------------------------- */
#define RGU_RESET_EXT_STAT58_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT58: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT58_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT58_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT58: PERIPHERAL_RESET Mask */

/* ----------------------------  RGU_RESET_EXT_STAT60  ---------------------------- */
#define RGU_RESET_EXT_STAT60_PERIPHERAL_RESET_Pos 2                                                   /*!< RGU RESET_EXT_STAT60: PERIPHERAL_RESET Position */
#define RGU_RESET_EXT_STAT60_PERIPHERAL_RESET_Msk (0x01UL << RGU_RESET_EXT_STAT60_PERIPHERAL_RESET_Pos)/*!< RGU RESET_EXT_STAT60: PERIPHERAL_RESET Mask */


/* ================================================================================ */
/* ================          struct 'WWDT' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  WWDT_MOD  ---------------------------------- */
#define WWDT_MOD_WDEN_Pos                     0                                                       /*!< WWDT MOD: WDEN Position                 */
#define WWDT_MOD_WDEN_Msk                     (0x01UL << WWDT_MOD_WDEN_Pos)                           /*!< WWDT MOD: WDEN Mask                     */
#define WWDT_MOD_WDRESET_Pos                  1                                                       /*!< WWDT MOD: WDRESET Position              */
#define WWDT_MOD_WDRESET_Msk                  (0x01UL << WWDT_MOD_WDRESET_Pos)                        /*!< WWDT MOD: WDRESET Mask                  */
#define WWDT_MOD_WDTOF_Pos                    2                                                       /*!< WWDT MOD: WDTOF Position                */
#define WWDT_MOD_WDTOF_Msk                    (0x01UL << WWDT_MOD_WDTOF_Pos)                          /*!< WWDT MOD: WDTOF Mask                    */
#define WWDT_MOD_WDINT_Pos                    3                                                       /*!< WWDT MOD: WDINT Position                */
#define WWDT_MOD_WDINT_Msk                    (0x01UL << WWDT_MOD_WDINT_Pos)                          /*!< WWDT MOD: WDINT Mask                    */
#define WWDT_MOD_WDPROTECT_Pos                4                                                       /*!< WWDT MOD: WDPROTECT Position            */
#define WWDT_MOD_WDPROTECT_Msk                (0x01UL << WWDT_MOD_WDPROTECT_Pos)                      /*!< WWDT MOD: WDPROTECT Mask                */

/* -----------------------------------  WWDT_TC  ---------------------------------- */
#define WWDT_TC_WDTC_Pos                      0                                                       /*!< WWDT TC: WDTC Position                  */
#define WWDT_TC_WDTC_Msk                      (0x00ffffffUL << WWDT_TC_WDTC_Pos)                      /*!< WWDT TC: WDTC Mask                      */

/* ----------------------------------  WWDT_FEED  --------------------------------- */
#define WWDT_FEED_Feed_Pos                    0                                                       /*!< WWDT FEED: Feed Position                */
#define WWDT_FEED_Feed_Msk                    (0x000000ffUL << WWDT_FEED_Feed_Pos)                    /*!< WWDT FEED: Feed Mask                    */

/* -----------------------------------  WWDT_TV  ---------------------------------- */
#define WWDT_TV_Count_Pos                     0                                                       /*!< WWDT TV: Count Position                 */
#define WWDT_TV_Count_Msk                     (0x00ffffffUL << WWDT_TV_Count_Pos)                     /*!< WWDT TV: Count Mask                     */

/* --------------------------------  WWDT_WARNINT  -------------------------------- */
#define WWDT_WARNINT_WDWARNINT_Pos            0                                                       /*!< WWDT WARNINT: WDWARNINT Position        */
#define WWDT_WARNINT_WDWARNINT_Msk            (0x000003ffUL << WWDT_WARNINT_WDWARNINT_Pos)            /*!< WWDT WARNINT: WDWARNINT Mask            */

/* ---------------------------------  WWDT_WINDOW  -------------------------------- */
#define WWDT_WINDOW_WDWINDOW_Pos              0                                                       /*!< WWDT WINDOW: WDWINDOW Position          */
#define WWDT_WINDOW_WDWINDOW_Msk              (0x00ffffffUL << WWDT_WINDOW_WDWINDOW_Pos)              /*!< WWDT WINDOW: WDWINDOW Mask              */


/* ================================================================================ */
/* ================         Group 'USARTn' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  USARTn_RBR  --------------------------------- */
#define USARTn_RBR_RBR_Pos                    0                                                       /*!< USARTn RBR: RBR Position                */
#define USARTn_RBR_RBR_Msk                    (0x000000ffUL << USARTn_RBR_RBR_Pos)                    /*!< USARTn RBR: RBR Mask                    */

/* ---------------------------------  USARTn_THR  --------------------------------- */
#define USARTn_THR_THR_Pos                    0                                                       /*!< USARTn THR: THR Position                */
#define USARTn_THR_THR_Msk                    (0x000000ffUL << USARTn_THR_THR_Pos)                    /*!< USARTn THR: THR Mask                    */

/* ---------------------------------  USARTn_DLL  --------------------------------- */
#define USARTn_DLL_DLLSB_Pos                  0                                                       /*!< USARTn DLL: DLLSB Position              */
#define USARTn_DLL_DLLSB_Msk                  (0x000000ffUL << USARTn_DLL_DLLSB_Pos)                  /*!< USARTn DLL: DLLSB Mask                  */

/* ---------------------------------  USARTn_DLM  --------------------------------- */
#define USARTn_DLM_DLMSB_Pos                  0                                                       /*!< USARTn DLM: DLMSB Position              */
#define USARTn_DLM_DLMSB_Msk                  (0x000000ffUL << USARTn_DLM_DLMSB_Pos)                  /*!< USARTn DLM: DLMSB Mask                  */

/* ---------------------------------  USARTn_IER  --------------------------------- */
#define USARTn_IER_RBRIE_Pos                  0                                                       /*!< USARTn IER: RBRIE Position              */
#define USARTn_IER_RBRIE_Msk                  (0x01UL << USARTn_IER_RBRIE_Pos)                        /*!< USARTn IER: RBRIE Mask                  */
#define USARTn_IER_THREIE_Pos                 1                                                       /*!< USARTn IER: THREIE Position             */
#define USARTn_IER_THREIE_Msk                 (0x01UL << USARTn_IER_THREIE_Pos)                       /*!< USARTn IER: THREIE Mask                 */
#define USARTn_IER_RXIE_Pos                   2                                                       /*!< USARTn IER: RXIE Position               */
#define USARTn_IER_RXIE_Msk                   (0x01UL << USARTn_IER_RXIE_Pos)                         /*!< USARTn IER: RXIE Mask                   */
#define USARTn_IER_ABEOINTEN_Pos              8                                                       /*!< USARTn IER: ABEOINTEN Position          */
#define USARTn_IER_ABEOINTEN_Msk              (0x01UL << USARTn_IER_ABEOINTEN_Pos)                    /*!< USARTn IER: ABEOINTEN Mask              */
#define USARTn_IER_ABTOINTEN_Pos              9                                                       /*!< USARTn IER: ABTOINTEN Position          */
#define USARTn_IER_ABTOINTEN_Msk              (0x01UL << USARTn_IER_ABTOINTEN_Pos)                    /*!< USARTn IER: ABTOINTEN Mask              */

/* ---------------------------------  USARTn_IIR  --------------------------------- */
#define USARTn_IIR_INTSTATUS_Pos              0                                                       /*!< USARTn IIR: INTSTATUS Position          */
#define USARTn_IIR_INTSTATUS_Msk              (0x01UL << USARTn_IIR_INTSTATUS_Pos)                    /*!< USARTn IIR: INTSTATUS Mask              */
#define USARTn_IIR_INTID_Pos                  1                                                       /*!< USARTn IIR: INTID Position              */
#define USARTn_IIR_INTID_Msk                  (0x07UL << USARTn_IIR_INTID_Pos)                        /*!< USARTn IIR: INTID Mask                  */
#define USARTn_IIR_FIFOENABLE_Pos             6                                                       /*!< USARTn IIR: FIFOENABLE Position         */
#define USARTn_IIR_FIFOENABLE_Msk             (0x03UL << USARTn_IIR_FIFOENABLE_Pos)                   /*!< USARTn IIR: FIFOENABLE Mask             */
#define USARTn_IIR_ABEOINT_Pos                8                                                       /*!< USARTn IIR: ABEOINT Position            */
#define USARTn_IIR_ABEOINT_Msk                (0x01UL << USARTn_IIR_ABEOINT_Pos)                      /*!< USARTn IIR: ABEOINT Mask                */
#define USARTn_IIR_ABTOINT_Pos                9                                                       /*!< USARTn IIR: ABTOINT Position            */
#define USARTn_IIR_ABTOINT_Msk                (0x01UL << USARTn_IIR_ABTOINT_Pos)                      /*!< USARTn IIR: ABTOINT Mask                */

/* ---------------------------------  USARTn_FCR  --------------------------------- */
#define USARTn_FCR_FIFOEN_Pos                 0                                                       /*!< USARTn FCR: FIFOEN Position             */
#define USARTn_FCR_FIFOEN_Msk                 (0x01UL << USARTn_FCR_FIFOEN_Pos)                       /*!< USARTn FCR: FIFOEN Mask                 */
#define USARTn_FCR_RXFIFORES_Pos              1                                                       /*!< USARTn FCR: RXFIFORES Position          */
#define USARTn_FCR_RXFIFORES_Msk              (0x01UL << USARTn_FCR_RXFIFORES_Pos)                    /*!< USARTn FCR: RXFIFORES Mask              */
#define USARTn_FCR_TXFIFORES_Pos              2                                                       /*!< USARTn FCR: TXFIFORES Position          */
#define USARTn_FCR_TXFIFORES_Msk              (0x01UL << USARTn_FCR_TXFIFORES_Pos)                    /*!< USARTn FCR: TXFIFORES Mask              */
#define USARTn_FCR_DMAMODE_Pos                3                                                       /*!< USARTn FCR: DMAMODE Position            */
#define USARTn_FCR_DMAMODE_Msk                (0x01UL << USARTn_FCR_DMAMODE_Pos)                      /*!< USARTn FCR: DMAMODE Mask                */
#define USARTn_FCR_RXTRIGLVL_Pos              6                                                       /*!< USARTn FCR: RXTRIGLVL Position          */
#define USARTn_FCR_RXTRIGLVL_Msk              (0x03UL << USARTn_FCR_RXTRIGLVL_Pos)                    /*!< USARTn FCR: RXTRIGLVL Mask              */

