roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  USARTn_LCR  --------------------------------- */
#define USARTn_LCR_WLS_Pos                    0                                                       /*!< USARTn LCR: WLS Position                */
#define USARTn_LCR_WLS_Msk                    (0x03UL << USARTn_LCR_WLS_Pos)                          /*!< USARTn LCR: WLS Mask                    */
#define USARTn_LCR_SBS_Pos                    2                                                       /*!< USARTn LCR: SBS Position                */
#define USARTn_LCR_SBS_Msk                    (0x01UL << USARTn_LCR_SBS_Pos)                          /*!< USARTn LCR: SBS Mask                    */
#define USARTn_LCR_PE_Pos                     3                                                       /*!< USARTn LCR: PE Position                 */
#define USARTn_LCR_PE_Msk                     (0x01UL << USARTn_LCR_PE_Pos)                           /*!< USARTn LCR: PE Mask                     */
#define USARTn_LCR_PS_Pos                     4                                                       /*!< USARTn LCR: PS Position                 */
#define USARTn_LCR_PS_Msk                     (0x03UL << USARTn_LCR_PS_Pos)                           /*!< USARTn LCR: PS Mask                     */
#define USARTn_LCR_BC_Pos                     6                                                       /*!< USARTn LCR: BC Position                 */
#define USARTn_LCR_BC_Msk                     (0x01UL << USARTn_LCR_BC_Pos)                           /*!< USARTn LCR: BC Mask                     */
#define USARTn_LCR_DLAB_Pos                   7                                                       /*!< USARTn LCR: DLAB Position               */
#define USARTn_LCR_DLAB_Msk                   (0x01UL << USARTn_LCR_DLAB_Pos)                         /*!< USARTn LCR: DLAB Mask                   */

/* ---------------------------------  USARTn_LSR  --------------------------------- */
#define USARTn_LSR_RDR_Pos                    0                                                       /*!< USARTn LSR: RDR Position                */
#define USARTn_LSR_RDR_Msk                    (0x01UL << USARTn_LSR_RDR_Pos)                          /*!< USARTn LSR: RDR Mask                    */
#define USARTn_LSR_OE_Pos                     1                                                       /*!< USARTn LSR: OE Position                 */
#define USARTn_LSR_OE_Msk                     (0x01UL << USARTn_LSR_OE_Pos)                           /*!< USARTn LSR: OE Mask                     */
#define USARTn_LSR_PE_Pos                     2                                                       /*!< USARTn LSR: PE Position                 */
#define USARTn_LSR_PE_Msk                     (0x01UL << USARTn_LSR_PE_Pos)                           /*!< USARTn LSR: PE Mask                     */
#define USARTn_LSR_FE_Pos                     3                                                       /*!< USARTn LSR: FE Position                 */
#define USARTn_LSR_FE_Msk                     (0x01UL << USARTn_LSR_FE_Pos)                           /*!< USARTn LSR: FE Mask                     */
#define USARTn_LSR_BI_Pos                     4                                                       /*!< USARTn LSR: BI Position                 */
#define USARTn_LSR_BI_Msk                     (0x01UL << USARTn_LSR_BI_Pos)                           /*!< USARTn LSR: BI Mask                     */
#define USARTn_LSR_THRE_Pos                   5                                                       /*!< USARTn LSR: THRE Position               */
#define USARTn_LSR_THRE_Msk                   (0x01UL << USARTn_LSR_THRE_Pos)                         /*!< USARTn LSR: THRE Mask                   */
#define USARTn_LSR_TEMT_Pos                   6                                                       /*!< USARTn LSR: TEMT Position               */
#define USARTn_LSR_TEMT_Msk                   (0x01UL << USARTn_LSR_TEMT_Pos)                         /*!< USARTn LSR: TEMT Mask                   */
#define USARTn_LSR_RXFE_Pos                   7                                                       /*!< USARTn LSR: RXFE Position               */
#define USARTn_LSR_RXFE_Msk                   (0x01UL << USARTn_LSR_RXFE_Pos)                         /*!< USARTn LSR: RXFE Mask                   */
#define USARTn_LSR_TXERR_Pos                  8                                                       /*!< USARTn LSR: TXERR Position              */
#define USARTn_LSR_TXERR_Msk                  (0x01UL << USARTn_LSR_TXERR_Pos)                        /*!< USARTn LSR: TXERR Mask                  */

/* ---------------------------------  USARTn_SCR  --------------------------------- */
#define USARTn_SCR_PAD_Pos                    0                                                       /*!< USARTn SCR: PAD Position                */
#define USARTn_SCR_PAD_Msk                    (0x000000ffUL << USARTn_SCR_PAD_Pos)                    /*!< USARTn SCR: PAD Mask                    */

/* ---------------------------------  USARTn_ACR  --------------------------------- */
#define USARTn_ACR_START_Pos                  0                                                       /*!< USARTn ACR: START Position              */
#define USARTn_ACR_START_Msk                  (0x01UL << USARTn_ACR_START_Pos)                        /*!< USARTn ACR: START Mask                  */
#define USARTn_ACR_MODE_Pos                   1                                                       /*!< USARTn ACR: MODE Position               */
#define USARTn_ACR_MODE_Msk                   (0x01UL << USARTn_ACR_MODE_Pos)                         /*!< USARTn ACR: MODE Mask                   */
#define USARTn_ACR_AUTORESTART_Pos            2                                                       /*!< USARTn ACR: AUTORESTART Position        */
#define USARTn_ACR_AUTORESTART_Msk            (0x01UL << USARTn_ACR_AUTORESTART_Pos)                  /*!< USARTn ACR: AUTORESTART Mask            */
#define USARTn_ACR_ABEOINTCLR_Pos             8                                                       /*!< USARTn ACR: ABEOINTCLR Position         */
#define USARTn_ACR_ABEOINTCLR_Msk             (0x01UL << USARTn_ACR_ABEOINTCLR_Pos)                   /*!< USARTn ACR: ABEOINTCLR Mask             */
#define USARTn_ACR_ABTOINTCLR_Pos             9                                                       /*!< USARTn ACR: ABTOINTCLR Position         */
#define USARTn_ACR_ABTOINTCLR_Msk             (0x01UL << USARTn_ACR_ABTOINTCLR_Pos)                   /*!< USARTn ACR: ABTOINTCLR Mask             */

/* ---------------------------------  USARTn_ICR  --------------------------------- */
#define USARTn_ICR_IRDAEN_Pos                 0                                                       /*!< USARTn ICR: IRDAEN Position             */
#define USARTn_ICR_IRDAEN_Msk                 (0x01UL << USARTn_ICR_IRDAEN_Pos)                       /*!< USARTn ICR: IRDAEN Mask                 */
#define USARTn_ICR_IRDAINV_Pos                1                                                       /*!< USARTn ICR: IRDAINV Position            */
#define USARTn_ICR_IRDAINV_Msk                (0x01UL << USARTn_ICR_IRDAINV_Pos)                      /*!< USARTn ICR: IRDAINV Mask                */
#define USARTn_ICR_FIXPULSEEN_Pos             2                                                       /*!< USARTn ICR: FIXPULSEEN Position         */
#define USARTn_ICR_FIXPULSEEN_Msk             (0x01UL << USARTn_ICR_FIXPULSEEN_Pos)                   /*!< USARTn ICR: FIXPULSEEN Mask             */
#define USARTn_ICR_PULSEDIV_Pos               3                                                       /*!< USARTn ICR: PULSEDIV Position           */
#define USARTn_ICR_PULSEDIV_Msk               (0x07UL << USARTn_ICR_PULSEDIV_Pos)                     /*!< USARTn ICR: PULSEDIV Mask               */

