roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  USART0_HDEN  -------------------------------- */
#define USART0_HDEN_HDEN_Pos                  0                                                       /*!< USART0 HDEN: HDEN Position              */
#define USART0_HDEN_HDEN_Msk                  (0x01UL << USART0_HDEN_HDEN_Pos)                        /*!< USART0 HDEN: HDEN Mask                  */

/* -------------------------------  USART0_SCICTRL  ------------------------------- */
#define USART0_SCICTRL_SCIEN_Pos              0                                                       /*!< USART0 SCICTRL: SCIEN Position          */
#define USART0_SCICTRL_SCIEN_Msk              (0x01UL << USART0_SCICTRL_SCIEN_Pos)                    /*!< USART0 SCICTRL: SCIEN Mask              */
#define USART0_SCICTRL_NACKDIS_Pos            1                                                       /*!< USART0 SCICTRL: NACKDIS Position        */
#define USART0_SCICTRL_NACKDIS_Msk            (0x01UL << USART0_SCICTRL_NACKDIS_Pos)                  /*!< USART0 SCICTRL: NACKDIS Mask            */
#define USART0_SCICTRL_PROTSEL_Pos            2                                                       /*!< USART0 SCICTRL: PROTSEL Position        */
#define USART0_SCICTRL_PROTSEL_Msk            (0x01UL << USART0_SCICTRL_PROTSEL_Pos)                  /*!< USART0 SCICTRL: PROTSEL Mask            */
#define USART0_SCICTRL_TXRETRY_Pos            5                                                       /*!< USART0 SCICTRL: TXRETRY Position        */
#define USART0_SCICTRL_TXRETRY_Msk            (0x07UL << USART0_SCICTRL_TXRETRY_Pos)                  /*!< USART0 SCICTRL: TXRETRY Mask            */
#define USART0_SCICTRL_GUARDTIME_Pos          8                                                       /*!< USART0 SCICTRL: GUARDTIME Position      */
#define USART0_SCICTRL_GUARDTIME_Msk          (0x000000ffUL << USART0_SCICTRL_GUARDTIME_Pos)          /*!< USART0 SCICTRL: GUARDTIME Mask          */

/* ------------------------------  USART0_RS485CTRL  ------------------------------ */
#define USART0_RS485CTRL_NMMEN_Pos            0                                                       /*!< USART0 RS485CTRL: NMMEN Position        */
#define USART0_RS485CTRL_NMMEN_Msk            (0x01UL << USART0_RS485CTRL_NMMEN_Pos)                  /*!< USART0 RS485CTRL: NMMEN Mask            */
#define USART0_RS485CTRL_RXDIS_Pos            1                                                       /*!< USART0 RS485CTRL: RXDIS Position        */
#define USART0_RS485CTRL_RXDIS_Msk            (0x01UL << USART0_RS485CTRL_RXDIS_Pos)                  /*!< USART0 RS485CTRL: RXDIS Mask            */
#define USART0_RS485CTRL_AADEN_Pos            2                                                       /*!< USART0 RS485CTRL: AADEN Position        */
#define USART0_RS485CTRL_AADEN_Msk            (0x01UL << USART0_RS485CTRL_AADEN_Pos)                  /*!< USART0 RS485CTRL: AADEN Mask            */
#define USART0_RS485CTRL_DCTRL_Pos            4                                                       /*!< USART0 RS485CTRL: DCTRL Position        */
#define USART0_RS485CTRL_DCTRL_Msk            (0x01UL << USART0_RS485CTRL_DCTRL_Pos)                  /*!< USART0 RS485CTRL: DCTRL Mask            */
#define USART0_RS485CTRL_OINV_Pos             5                                                       /*!< USART0 RS485CTRL: OINV Position         */
#define USART0_RS485CTRL_OINV_Msk             (0x01UL << USART0_RS485CTRL_OINV_Pos)                   /*!< USART0 RS485CTRL: OINV Mask             */

/* ----------------------------  USART0_RS485ADRMATCH  ---------------------------- */
#define USART0_RS485ADRMATCH_ADRMATCH_Pos     0                                                       /*!< USART0 RS485ADRMATCH: ADRMATCH Position */
#define USART0_RS485ADRMATCH_ADRMATCH_Msk     (0x000000ffUL << USART0_RS485ADRMATCH_ADRMATCH_Pos)     /*!< USART0 RS485ADRMATCH: ADRMATCH Mask     */

/* -------------------------------  USART0_RS485DLY  ------------------------------ */
#define USART0_RS485DLY_DLY_Pos               0                                                       /*!< USART0 RS485DLY: DLY Position           */
#define USART0_RS485DLY_DLY_Msk               (0x000000ffUL << USART0_RS485DLY_DLY_Pos)               /*!< USART0 RS485DLY: DLY Mask               */

/* -------------------------------  USART0_SYNCCTRL  ------------------------------ */
#define USART0_SYNCCTRL_SYNC_Pos              0                                                       /*!< USART0 SYNCCTRL: SYNC Position          */
#define USART0_SYNCCTRL_SYNC_Msk              (0x01UL << USART0_SYNCCTRL_SYNC_Pos)                    /*!< USART0 SYNCCTRL: SYNC Mask              */
#define USART0_SYNCCTRL_CSRC_Pos              1                                                       /*!< USART0 SYNCCTRL: CSRC Position          */
#define USART0_SYNCCTRL_CSRC_Msk              (0x01UL << USART0_SYNCCTRL_CSRC_Pos)                    /*!< USART0 SYNCCTRL: CSRC Mask              */
#define USART0_SYNCCTRL_FES_Pos               2                                                       /*!< USART0 SYNCCTRL: FES Position           */
#define USART0_SYNCCTRL_FES_Msk               (0x01UL << USART0_SYNCCTRL_FES_Pos)                     /*!< USART0 SYNCCTRL: FES Mask               */
#define USART0_SYNCCTRL_TSBYPASS_Pos          3                                                       /*!< USART0 SYNCCTRL: TSBYPASS Position      */
#define USART0_SYNCCTRL_TSBYPASS_Msk          (0x01UL << USART0_SYNCCTRL_TSBYPASS_Pos)                /*!< USART0 SYNCCTRL: TSBYPASS Mask          */
#define USART0_SYNCCTRL_CSCEN_Pos             4                                                       /*!< USART0 SYNCCTRL: CSCEN Position         */
#define USART0_SYNCCTRL_CSCEN_Msk             (0x01UL << USART0_SYNCCTRL_CSCEN_Pos)                   /*!< USART0 SYNCCTRL: CSCEN Mask             */
#define USART0_SYNCCTRL_SSSDIS_Pos            5                                                       /*!< USART0 SYNCCTRL: SSSDIS Position        */
#define USART0_SYNCCTRL_SSSDIS_Msk            (0x01UL << USART0_SYNCCTRL_SSSDIS_Pos)                  /*!< USART0 SYNCCTRL: SSSDIS Mask            */
#define USART0_SYNCCTRL_CCCLR_Pos             6                                                       /*!< USART0 SYNCCTRL: CCCLR Position         */
#define USART0_SYNCCTRL_CCCLR_Msk             (0x01UL << USART0_SYNCCTRL_CCCLR_Pos)                   /*!< USART0 SYNCCTRL: CCCLR Mask             */

/* ---------------------------------  USART0_TER  --------------------------------- */
#define USART0_TER_TXEN_Pos                   0                                                       /*!< USART0 TER: TXEN Position               */
#define USART0_TER_TXEN_Msk                   (0x01UL << USART0_TER_TXEN_Pos)                         /*!< USART0 TER: TXEN Mask                   */


/* ================================================================================ */
/* ================         struct 'USART2' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  USART2_DLL  --------------------------------- */
#define USART2_DLL_DLLSB_Pos                  0                                                       /*!< USART2 DLL: DLLSB Position              */
#define USART2_DLL_DLLSB_Msk                  (0x000000ffUL << USART2_DLL_DLLSB_Pos)                  /*!< USART2 DLL: DLLSB Mask                  */

