roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  USART2_THR  --------------------------------- */
#define USART2_THR_THR_Pos                    0                                                       /*!< USART2 THR: THR Position                */
#define USART2_THR_THR_Msk                    (0x000000ffUL << USART2_THR_THR_Pos)                    /*!< USART2 THR: THR Mask                    */

/* ---------------------------------  USART2_RBR  --------------------------------- */
#define USART2_RBR_RBR_Pos                    0                                                       /*!< USART2 RBR: RBR Position                */
#define USART2_RBR_RBR_Msk                    (0x000000ffUL << USART2_RBR_RBR_Pos)                    /*!< USART2 RBR: RBR Mask                    */

/* ---------------------------------  USART2_IER  --------------------------------- */
#define USART2_IER_RBRIE_Pos                  0                                                       /*!< USART2 IER: RBRIE Position              */
#define USART2_IER_RBRIE_Msk                  (0x01UL << USART2_IER_RBRIE_Pos)                        /*!< USART2 IER: RBRIE Mask                  */
#define USART2_IER_THREIE_Pos                 1                                                       /*!< USART2 IER: THREIE Position             */
#define USART2_IER_THREIE_Msk                 (0x01UL << USART2_IER_THREIE_Pos)                       /*!< USART2 IER: THREIE Mask                 */
#define USART2_IER_RXIE_Pos                   2                                                       /*!< USART2 IER: RXIE Position               */
#define USART2_IER_RXIE_Msk                   (0x01UL << USART2_IER_RXIE_Pos)                         /*!< USART2 IER: RXIE Mask                   */
#define USART2_IER_ABEOINTEN_Pos              8                                                       /*!< USART2 IER: ABEOINTEN Position          */
#define USART2_IER_ABEOINTEN_Msk              (0x01UL << USART2_IER_ABEOINTEN_Pos)                    /*!< USART2 IER: ABEOINTEN Mask              */
#define USART2_IER_ABTOINTEN_Pos              9                                                       /*!< USART2 IER: ABTOINTEN Position          */
#define USART2_IER_ABTOINTEN_Msk              (0x01UL << USART2_IER_ABTOINTEN_Pos)                    /*!< USART2 IER: ABTOINTEN Mask              */

/* ---------------------------------  USART2_DLM  --------------------------------- */
#define USART2_DLM_DLMSB_Pos                  0                                                       /*!< USART2 DLM: DLMSB Position              */
#define USART2_DLM_DLMSB_Msk                  (0x000000ffUL << USART2_DLM_DLMSB_Pos)                  /*!< USART2 DLM: DLMSB Mask                  */

/* ---------------------------------  USART2_FCR  --------------------------------- */
#define USART2_FCR_FIFOEN_Pos                 0                                                       /*!< USART2 FCR: FIFOEN Position             */
#define USART2_FCR_FIFOEN_Msk                 (0x01UL << USART2_FCR_FIFOEN_Pos)                       /*!< USART2 FCR: FIFOEN Mask                 */
#define USART2_FCR_RXFIFORES_Pos              1                                                       /*!< USART2 FCR: RXFIFORES Position          */
#define USART2_FCR_RXFIFORES_Msk              (0x01UL << USART2_FCR_RXFIFORES_Pos)                    /*!< USART2 FCR: RXFIFORES Mask              */
#define USART2_FCR_TXFIFORES_Pos              2                                                       /*!< USART2 FCR: TXFIFORES Position          */
#define USART2_FCR_TXFIFORES_Msk              (0x01UL << USART2_FCR_TXFIFORES_Pos)                    /*!< USART2 FCR: TXFIFORES Mask              */
#define USART2_FCR_DMAMODE_Pos                3                                                       /*!< USART2 FCR: DMAMODE Position            */
#define USART2_FCR_DMAMODE_Msk                (0x01UL << USART2_FCR_DMAMODE_Pos)                      /*!< USART2 FCR: DMAMODE Mask                */
#define USART2_FCR_RXTRIGLVL_Pos              6                                                       /*!< USART2 FCR: RXTRIGLVL Position          */
#define USART2_FCR_RXTRIGLVL_Msk              (0x03UL << USART2_FCR_RXTRIGLVL_Pos)                    /*!< USART2 FCR: RXTRIGLVL Mask              */

/* ---------------------------------  USART2_IIR  --------------------------------- */
#define USART2_IIR_INTSTATUS_Pos              0                                                       /*!< USART2 IIR: INTSTATUS Position          */
#define USART2_IIR_INTSTATUS_Msk              (0x01UL << USART2_IIR_INTSTATUS_Pos)                    /*!< USART2 IIR: INTSTATUS Mask              */
#define USART2_IIR_INTID_Pos                  1                                                       /*!< USART2 IIR: INTID Position              */
#define USART2_IIR_INTID_Msk                  (0x07UL << USART2_IIR_INTID_Pos)                        /*!< USART2 IIR: INTID Mask                  */
#define USART2_IIR_FIFOENABLE_Pos             6                                                       /*!< USART2 IIR: FIFOENABLE Position         */
#define USART2_IIR_FIFOENABLE_Msk             (0x03UL << USART2_IIR_FIFOENABLE_Pos)                   /*!< USART2 IIR: FIFOENABLE Mask             */
#define USART2_IIR_ABEOINT_Pos                8                                                       /*!< USART2 IIR: ABEOINT Position            */
#define USART2_IIR_ABEOINT_Msk                (0x01UL << USART2_IIR_ABEOINT_Pos)                      /*!< USART2 IIR: ABEOINT Mask                */
#define USART2_IIR_ABTOINT_Pos                9                                                       /*!< USART2 IIR: ABTOINT Position            */
#define USART2_IIR_ABTOINT_Msk                (0x01UL << USART2_IIR_ABTOINT_Pos)                      /*!< USART2 IIR: ABTOINT Mask                */

/* ---------------------------------  USART2_LCR  --------------------------------- */
#define USART2_LCR_WLS_Pos                    0                                                       /*!< USART2 LCR: WLS Position                */
#define USART2_LCR_WLS_Msk                    (0x03UL << USART2_LCR_WLS_Pos)                          /*!< USART2 LCR: WLS Mask                    */
#define USART2_LCR_SBS_Pos                    2                                                       /*!< USART2 LCR: SBS Position                */
#define USART2_LCR_SBS_Msk                    (0x01UL << USART2_LCR_SBS_Pos)                          /*!< USART2 LCR: SBS Mask                    */
#define USART2_LCR_PE_Pos                     3                                                       /*!< USART2 LCR: PE Position                 */
#define USART2_LCR_PE_Msk                     (0x01UL << USART2_LCR_PE_Pos)                           /*!< USART2 LCR: PE Mask                     */
#define USART2_LCR_PS_Pos                     4                                                       /*!< USART2 LCR: PS Position                 */
#define USART2_LCR_PS_Msk                     (0x03UL << USART2_LCR_PS_Pos)                           /*!< USART2 LCR: PS Mask                     */
#define USART2_LCR_BC_Pos                     6                                                       /*!< USART2 LCR: BC Position                 */
#define USART2_LCR_BC_Msk                     (0x01UL << USART2_LCR_BC_Pos)                           /*!< USART2 LCR: BC Mask                     */
#define USART2_LCR_DLAB_Pos                   7                                                       /*!< USART2 LCR: DLAB Position               */
#define USART2_LCR_DLAB_Msk                   (0x01UL << USART2_LCR_DLAB_Pos)                         /*!< USART2 LCR: DLAB Mask                   */

/* ---------------------------------  USART2_LSR  --------------------------------- */
#define USART2_LSR_RDR_Pos                    0                                                       /*!< USART2 LSR: RDR Position                */
#define USART2_LSR_RDR_Msk                    (0x01UL << USART2_LSR_RDR_Pos)                          /*!< USART2 LSR: RDR Mask                    */
#define USART2_LSR_OE_Pos                     1                                                       /*!< USART2 LSR: OE Position                 */
#define USART2_LSR_OE_Msk                     (0x01UL << USART2_LSR_OE_Pos)                           /*!< USART2 LSR: OE Mask                     */
#define USART2_LSR_PE_Pos                     2                                                       /*!< USART2 LSR: PE Position                 */
#define USART2_LSR_PE_Msk                     (0x01UL << USART2_LSR_PE_Pos)                           /*!< USART2 LSR: PE Mask                     */
#define USART2_LSR_FE_Pos                     3                                                       /*!< USART2 LSR: FE Position                 */
#define USART2_LSR_FE_Msk                     (0x01UL << USART2_LSR_FE_Pos)                           /*!< USART2 LSR: FE Mask                     */
#define USART2_LSR_BI_Pos                     4                                                       /*!< USART2 LSR: BI Position                 */
#define USART2_LSR_BI_Msk                     (0x01UL << USART2_LSR_BI_Pos)                           /*!< USART2 LSR: BI Mask                     */
#define USART2_LSR_THRE_Pos                   5                                                       /*!< USART2 LSR: THRE Position               */
#define USART2_LSR_THRE_Msk                   (0x01UL << USART2_LSR_THRE_Pos)                         /*!< USART2 LSR: THRE Mask                   */
#define USART2_LSR_TEMT_Pos                   6                                                       /*!< USART2 LSR: TEMT Position               */
#define USART2_LSR_TEMT_Msk                   (0x01UL << USART2_LSR_TEMT_Pos)                         /*!< USART2 LSR: TEMT Mask                   */
#define USART2_LSR_RXFE_Pos                   7                                                       /*!< USART2 LSR: RXFE Position               */
#define USART2_LSR_RXFE_Msk                   (0x01UL << USART2_LSR_RXFE_Pos)                         /*!< USART2 LSR: RXFE Mask                   */
#define USART2_LSR_TXERR_Pos                  8                                                       /*!< USART2 LSR: TXERR Position              */
#define USART2_LSR_TXERR_Msk                  (0x01UL << USART2_LSR_TXERR_Pos)                        /*!< USART2 LSR: TXERR Mask                  */

/* ---------------------------------  USART2_SCR  --------------------------------- */
#define USART2_SCR_PAD_Pos                    0                                                       /*!< USART2 SCR: PAD Position                */
#define USART2_SCR_PAD_Msk                    (0x000000ffUL << USART2_SCR_PAD_Pos)                    /*!< USART2 SCR: PAD Mask                    */

