roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------  USART2_RS485ADRMATCH  ---------------------------- */
#define USART2_RS485ADRMATCH_ADRMATCH_Pos     0                                                       /*!< USART2 RS485ADRMATCH: ADRMATCH Position */
#define USART2_RS485ADRMATCH_ADRMATCH_Msk     (0x000000ffUL << USART2_RS485ADRMATCH_ADRMATCH_Pos)     /*!< USART2 RS485ADRMATCH: ADRMATCH Mask     */

/* -------------------------------  USART2_RS485DLY  ------------------------------ */
#define USART2_RS485DLY_DLY_Pos               0                                                       /*!< USART2 RS485DLY: DLY Position           */
#define USART2_RS485DLY_DLY_Msk               (0x000000ffUL << USART2_RS485DLY_DLY_Pos)               /*!< USART2 RS485DLY: DLY Mask               */

/* -------------------------------  USART2_SYNCCTRL  ------------------------------ */
#define USART2_SYNCCTRL_SYNC_Pos              0                                                       /*!< USART2 SYNCCTRL: SYNC Position          */
#define USART2_SYNCCTRL_SYNC_Msk              (0x01UL << USART2_SYNCCTRL_SYNC_Pos)                    /*!< USART2 SYNCCTRL: SYNC Mask              */
#define USART2_SYNCCTRL_CSRC_Pos              1                                                       /*!< USART2 SYNCCTRL: CSRC Position          */
#define USART2_SYNCCTRL_CSRC_Msk              (0x01UL << USART2_SYNCCTRL_CSRC_Pos)                    /*!< USART2 SYNCCTRL: CSRC Mask              */
#define USART2_SYNCCTRL_FES_Pos               2                                                       /*!< USART2 SYNCCTRL: FES Position           */
#define USART2_SYNCCTRL_FES_Msk               (0x01UL << USART2_SYNCCTRL_FES_Pos)                     /*!< USART2 SYNCCTRL: FES Mask               */
#define USART2_SYNCCTRL_TSBYPASS_Pos          3                                                       /*!< USART2 SYNCCTRL: TSBYPASS Position      */
#define USART2_SYNCCTRL_TSBYPASS_Msk          (0x01UL << USART2_SYNCCTRL_TSBYPASS_Pos)                /*!< USART2 SYNCCTRL: TSBYPASS Mask          */
#define USART2_SYNCCTRL_CSCEN_Pos             4                                                       /*!< USART2 SYNCCTRL: CSCEN Position         */
#define USART2_SYNCCTRL_CSCEN_Msk             (0x01UL << USART2_SYNCCTRL_CSCEN_Pos)                   /*!< USART2 SYNCCTRL: CSCEN Mask             */
#define USART2_SYNCCTRL_SSSDIS_Pos            5                                                       /*!< USART2 SYNCCTRL: SSSDIS Position        */
#define USART2_SYNCCTRL_SSSDIS_Msk            (0x01UL << USART2_SYNCCTRL_SSSDIS_Pos)                  /*!< USART2 SYNCCTRL: SSSDIS Mask            */
#define USART2_SYNCCTRL_CCCLR_Pos             6                                                       /*!< USART2 SYNCCTRL: CCCLR Position         */
#define USART2_SYNCCTRL_CCCLR_Msk             (0x01UL << USART2_SYNCCTRL_CCCLR_Pos)                   /*!< USART2 SYNCCTRL: CCCLR Mask             */

/* ---------------------------------  USART2_TER  --------------------------------- */
#define USART2_TER_TXEN_Pos                   0                                                       /*!< USART2 TER: TXEN Position               */
#define USART2_TER_TXEN_Msk                   (0x01UL << USART2_TER_TXEN_Pos)                         /*!< USART2 TER: TXEN Mask                   */


/* ================================================================================ */
/* ================         struct 'USART3' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  USART3_DLL  --------------------------------- */
#define USART3_DLL_DLLSB_Pos                  0                                                       /*!< USART3 DLL: DLLSB Position              */
#define USART3_DLL_DLLSB_Msk                  (0x000000ffUL << USART3_DLL_DLLSB_Pos)                  /*!< USART3 DLL: DLLSB Mask                  */

/* ---------------------------------  USART3_THR  --------------------------------- */
#define USART3_THR_THR_Pos                    0                                                       /*!< USART3 THR: THR Position                */
#define USART3_THR_THR_Msk                    (0x000000ffUL << USART3_THR_THR_Pos)                    /*!< USART3 THR: THR Mask                    */

/* ---------------------------------  USART3_RBR  --------------------------------- */
#define USART3_RBR_RBR_Pos                    0                                                       /*!< USART3 RBR: RBR Position                */
#define USART3_RBR_RBR_Msk                    (0x000000ffUL << USART3_RBR_RBR_Pos)                    /*!< USART3 RBR: RBR Mask                    */

/* ---------------------------------  USART3_IER  --------------------------------- */
#define USART3_IER_RBRIE_Pos                  0                                                       /*!< USART3 IER: RBRIE Position              */
#define USART3_IER_RBRIE_Msk                  (0x01UL << USART3_IER_RBRIE_Pos)                        /*!< USART3 IER: RBRIE Mask                  */
#define USART3_IER_THREIE_Pos                 1                                                       /*!< USART3 IER: THREIE Position             */
#define USART3_IER_THREIE_Msk                 (0x01UL << USART3_IER_THREIE_Pos)                       /*!< USART3 IER: THREIE Mask                 */
#define USART3_IER_RXIE_Pos                   2                                                       /*!< USART3 IER: RXIE Position               */
#define USART3_IER_RXIE_Msk                   (0x01UL << USART3_IER_RXIE_Pos)                         /*!< USART3 IER: RXIE Mask                   */
#define USART3_IER_ABEOINTEN_Pos              8                                                       /*!< USART3 IER: ABEOINTEN Position          */
#define USART3_IER_ABEOINTEN_Msk              (0x01UL << USART3_IER_ABEOINTEN_Pos)                    /*!< USART3 IER: ABEOINTEN Mask              */
#define USART3_IER_ABTOINTEN_Pos              9                                                       /*!< USART3 IER: ABTOINTEN Position          */
#define USART3_IER_ABTOINTEN_Msk              (0x01UL << USART3_IER_ABTOINTEN_Pos)                    /*!< USART3 IER: ABTOINTEN Mask              */

/* ---------------------------------  USART3_DLM  --------------------------------- */
#define USART3_DLM_DLMSB_Pos                  0                                                       /*!< USART3 DLM: DLMSB Position              */
#define USART3_DLM_DLMSB_Msk                  (0x000000ffUL << USART3_DLM_DLMSB_Pos)                  /*!< USART3 DLM: DLMSB Mask                  */

/* ---------------------------------  USART3_FCR  --------------------------------- */
#define USART3_FCR_FIFOEN_Pos                 0                                                       /*!< USART3 FCR: FIFOEN Position             */
#define USART3_FCR_FIFOEN_Msk                 (0x01UL << USART3_FCR_FIFOEN_Pos)                       /*!< USART3 FCR: FIFOEN Mask                 */
#define USART3_FCR_RXFIFORES_Pos              1                                                       /*!< USART3 FCR: RXFIFORES Position          */
#define USART3_FCR_RXFIFORES_Msk              (0x01UL << USART3_FCR_RXFIFORES_Pos)                    /*!< USART3 FCR: RXFIFORES Mask              */
#define USART3_FCR_TXFIFORES_Pos              2                                                       /*!< USART3 FCR: TXFIFORES Position          */
#define USART3_FCR_TXFIFORES_Msk              (0x01UL << USART3_FCR_TXFIFORES_Pos)                    /*!< USART3 FCR: TXFIFORES Mask              */
#define USART3_FCR_DMAMODE_Pos                3                                                       /*!< USART3 FCR: DMAMODE Position            */
#define USART3_FCR_DMAMODE_Msk                (0x01UL << USART3_FCR_DMAMODE_Pos)                      /*!< USART3 FCR: DMAMODE Mask                */
#define USART3_FCR_RXTRIGLVL_Pos              6                                                       /*!< USART3 FCR: RXTRIGLVL Position          */
#define USART3_FCR_RXTRIGLVL_Msk              (0x03UL << USART3_FCR_RXTRIGLVL_Pos)                    /*!< USART3 FCR: RXTRIGLVL Mask              */

/* ---------------------------------  USART3_IIR  --------------------------------- */
#define USART3_IIR_INTSTATUS_Pos              0                                                       /*!< USART3 IIR: INTSTATUS Position          */
#define USART3_IIR_INTSTATUS_Msk              (0x01UL << USART3_IIR_INTSTATUS_Pos)                    /*!< USART3 IIR: INTSTATUS Mask              */
#define USART3_IIR_INTID_Pos                  1                                                       /*!< USART3 IIR: INTID Position              */
#define USART3_IIR_INTID_Msk                  (0x07UL << USART3_IIR_INTID_Pos)                        /*!< USART3 IIR: INTID Mask                  */
#define USART3_IIR_FIFOENABLE_Pos             6                                                       /*!< USART3 IIR: FIFOENABLE Position         */
#define USART3_IIR_FIFOENABLE_Msk             (0x03UL << USART3_IIR_FIFOENABLE_Pos)                   /*!< USART3 IIR: FIFOENABLE Mask             */
#define USART3_IIR_ABEOINT_Pos                8                                                       /*!< USART3 IIR: ABEOINT Position            */
#define USART3_IIR_ABEOINT_Msk                (0x01UL << USART3_IIR_ABEOINT_Pos)                      /*!< USART3 IIR: ABEOINT Mask                */
#define USART3_IIR_ABTOINT_Pos                9                                                       /*!< USART3 IIR: ABTOINT Position            */
#define USART3_IIR_ABTOINT_Msk                (0x01UL << USART3_IIR_ABTOINT_Pos)                      /*!< USART3 IIR: ABTOINT Mask                */

