roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  USART3_LCR  --------------------------------- */
#define USART3_LCR_WLS_Pos                    0                                                       /*!< USART3 LCR: WLS Position                */
#define USART3_LCR_WLS_Msk                    (0x03UL << USART3_LCR_WLS_Pos)                          /*!< USART3 LCR: WLS Mask                    */
#define USART3_LCR_SBS_Pos                    2                                                       /*!< USART3 LCR: SBS Position                */
#define USART3_LCR_SBS_Msk                    (0x01UL << USART3_LCR_SBS_Pos)                          /*!< USART3 LCR: SBS Mask                    */
#define USART3_LCR_PE_Pos                     3                                                       /*!< USART3 LCR: PE Position                 */
#define USART3_LCR_PE_Msk                     (0x01UL << USART3_LCR_PE_Pos)                           /*!< USART3 LCR: PE Mask                     */
#define USART3_LCR_PS_Pos                     4                                                       /*!< USART3 LCR: PS Position                 */
#define USART3_LCR_PS_Msk                     (0x03UL << USART3_LCR_PS_Pos)                           /*!< USART3 LCR: PS Mask                     */
#define USART3_LCR_BC_Pos                     6                                                       /*!< USART3 LCR: BC Position                 */
#define USART3_LCR_BC_Msk                     (0x01UL << USART3_LCR_BC_Pos)                           /*!< USART3 LCR: BC Mask                     */
#define USART3_LCR_DLAB_Pos                   7                                                       /*!< USART3 LCR: DLAB Position               */
#define USART3_LCR_DLAB_Msk                   (0x01UL << USART3_LCR_DLAB_Pos)                         /*!< USART3 LCR: DLAB Mask                   */

/* ---------------------------------  USART3_LSR  --------------------------------- */
#define USART3_LSR_RDR_Pos                    0                                                       /*!< USART3 LSR: RDR Position                */
#define USART3_LSR_RDR_Msk                    (0x01UL << USART3_LSR_RDR_Pos)                          /*!< USART3 LSR: RDR Mask                    */
#define USART3_LSR_OE_Pos                     1                                                       /*!< USART3 LSR: OE Position                 */
#define USART3_LSR_OE_Msk                     (0x01UL << USART3_LSR_OE_Pos)                           /*!< USART3 LSR: OE Mask                     */
#define USART3_LSR_PE_Pos                     2                                                       /*!< USART3 LSR: PE Position                 */
#define USART3_LSR_PE_Msk                     (0x01UL << USART3_LSR_PE_Pos)                           /*!< USART3 LSR: PE Mask                     */
#define USART3_LSR_FE_Pos                     3                                                       /*!< USART3 LSR: FE Position                 */
#define USART3_LSR_FE_Msk                     (0x01UL << USART3_LSR_FE_Pos)                           /*!< USART3 LSR: FE Mask                     */
#define USART3_LSR_BI_Pos                     4                                                       /*!< USART3 LSR: BI Position                 */
#define USART3_LSR_BI_Msk                     (0x01UL << USART3_LSR_BI_Pos)                           /*!< USART3 LSR: BI Mask                     */
#define USART3_LSR_THRE_Pos                   5                                                       /*!< USART3 LSR: THRE Position               */
#define USART3_LSR_THRE_Msk                   (0x01UL << USART3_LSR_THRE_Pos)                         /*!< USART3 LSR: THRE Mask                   */
#define USART3_LSR_TEMT_Pos                   6                                                       /*!< USART3 LSR: TEMT Position               */
#define USART3_LSR_TEMT_Msk                   (0x01UL << USART3_LSR_TEMT_Pos)                         /*!< USART3 LSR: TEMT Mask                   */
#define USART3_LSR_RXFE_Pos                   7                                                       /*!< USART3 LSR: RXFE Position               */
#define USART3_LSR_RXFE_Msk                   (0x01UL << USART3_LSR_RXFE_Pos)                         /*!< USART3 LSR: RXFE Mask                   */
#define USART3_LSR_TXERR_Pos                  8                                                       /*!< USART3 LSR: TXERR Position              */
#define USART3_LSR_TXERR_Msk                  (0x01UL << USART3_LSR_TXERR_Pos)                        /*!< USART3 LSR: TXERR Mask                  */

/* ---------------------------------  USART3_SCR  --------------------------------- */
#define USART3_SCR_PAD_Pos                    0                                                       /*!< USART3 SCR: PAD Position                */
#define USART3_SCR_PAD_Msk                    (0x000000ffUL << USART3_SCR_PAD_Pos)                    /*!< USART3 SCR: PAD Mask                    */

/* ---------------------------------  USART3_ACR  --------------------------------- */
#define USART3_ACR_START_Pos                  0                                                       /*!< USART3 ACR: START Position              */
#define USART3_ACR_START_Msk                  (0x01UL << USART3_ACR_START_Pos)                        /*!< USART3 ACR: START Mask                  */
#define USART3_ACR_MODE_Pos                   1                                                       /*!< USART3 ACR: MODE Position               */
#define USART3_ACR_MODE_Msk                   (0x01UL << USART3_ACR_MODE_Pos)                         /*!< USART3 ACR: MODE Mask                   */
#define USART3_ACR_AUTORESTART_Pos            2                                                       /*!< USART3 ACR: AUTORESTART Position        */
#define USART3_ACR_AUTORESTART_Msk            (0x01UL << USART3_ACR_AUTORESTART_Pos)                  /*!< USART3 ACR: AUTORESTART Mask            */
#define USART3_ACR_ABEOINTCLR_Pos             8                                                       /*!< USART3 ACR: ABEOINTCLR Position         */
#define USART3_ACR_ABEOINTCLR_Msk             (0x01UL << USART3_ACR_ABEOINTCLR_Pos)                   /*!< USART3 ACR: ABEOINTCLR Mask             */
#define USART3_ACR_ABTOINTCLR_Pos             9                                                       /*!< USART3 ACR: ABTOINTCLR Position         */
#define USART3_ACR_ABTOINTCLR_Msk             (0x01UL << USART3_ACR_ABTOINTCLR_Pos)                   /*!< USART3 ACR: ABTOINTCLR Mask             */

/* ---------------------------------  USART3_ICR  --------------------------------- */
#define USART3_ICR_IRDAEN_Pos                 0                                                       /*!< USART3 ICR: IRDAEN Position             */
#define USART3_ICR_IRDAEN_Msk                 (0x01UL << USART3_ICR_IRDAEN_Pos)                       /*!< USART3 ICR: IRDAEN Mask                 */
#define USART3_ICR_IRDAINV_Pos                1                                                       /*!< USART3 ICR: IRDAINV Position            */
#define USART3_ICR_IRDAINV_Msk                (0x01UL << USART3_ICR_IRDAINV_Pos)                      /*!< USART3 ICR: IRDAINV Mask                */
#define USART3_ICR_FIXPULSEEN_Pos             2                                                       /*!< USART3 ICR: FIXPULSEEN Position         */
#define USART3_ICR_FIXPULSEEN_Msk             (0x01UL << USART3_ICR_FIXPULSEEN_Pos)                   /*!< USART3 ICR: FIXPULSEEN Mask             */
#define USART3_ICR_PULSEDIV_Pos               3                                                       /*!< USART3 ICR: PULSEDIV Position           */
#define USART3_ICR_PULSEDIV_Msk               (0x07UL << USART3_ICR_PULSEDIV_Pos)                     /*!< USART3 ICR: PULSEDIV Mask               */

