roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  UART1_RS485ADRMATCH  ---------------------------- */
#define UART1_RS485ADRMATCH_ADRMATCH_Pos      0                                                       /*!< UART1 RS485ADRMATCH: ADRMATCH Position  */
#define UART1_RS485ADRMATCH_ADRMATCH_Msk      (0x000000ffUL << UART1_RS485ADRMATCH_ADRMATCH_Pos)      /*!< UART1 RS485ADRMATCH: ADRMATCH Mask      */

/* -------------------------------  UART1_RS485DLY  ------------------------------- */
#define UART1_RS485DLY_DLY_Pos                0                                                       /*!< UART1 RS485DLY: DLY Position            */
#define UART1_RS485DLY_DLY_Msk                (0x000000ffUL << UART1_RS485DLY_DLY_Pos)                /*!< UART1 RS485DLY: DLY Mask                */

/* ----------------------------------  UART1_TER  --------------------------------- */
#define UART1_TER_TXEN_Pos                    0                                                       /*!< UART1 TER: TXEN Position                */
#define UART1_TER_TXEN_Msk                    (0x01UL << UART1_TER_TXEN_Pos)                          /*!< UART1 TER: TXEN Mask                    */


/* ================================================================================ */
/* ================          Group 'SSPn' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------------  SSPn_CR0  ---------------------------------- */
#define SSPn_CR0_DSS_Pos                      0                                                       /*!< SSPn CR0: DSS Position                  */
#define SSPn_CR0_DSS_Msk                      (0x0fUL << SSPn_CR0_DSS_Pos)                            /*!< SSPn CR0: DSS Mask                      */
#define SSPn_CR0_FRF_Pos                      4                                                       /*!< SSPn CR0: FRF Position                  */
#define SSPn_CR0_FRF_Msk                      (0x03UL << SSPn_CR0_FRF_Pos)                            /*!< SSPn CR0: FRF Mask                      */
#define SSPn_CR0_CPOL_Pos                     6                                                       /*!< SSPn CR0: CPOL Position                 */
#define SSPn_CR0_CPOL_Msk                     (0x01UL << SSPn_CR0_CPOL_Pos)                           /*!< SSPn CR0: CPOL Mask                     */
#define SSPn_CR0_CPHA_Pos                     7                                                       /*!< SSPn CR0: CPHA Position                 */
#define SSPn_CR0_CPHA_Msk                     (0x01UL << SSPn_CR0_CPHA_Pos)                           /*!< SSPn CR0: CPHA Mask                     */
#define SSPn_CR0_SCR_Pos                      8                                                       /*!< SSPn CR0: SCR Position                  */
#define SSPn_CR0_SCR_Msk                      (0x000000ffUL << SSPn_CR0_SCR_Pos)                      /*!< SSPn CR0: SCR Mask                      */

/* ----------------------------------  SSPn_CR1  ---------------------------------- */
#define SSPn_CR1_LBM_Pos                      0                                                       /*!< SSPn CR1: LBM Position                  */
#define SSPn_CR1_LBM_Msk                      (0x01UL << SSPn_CR1_LBM_Pos)                            /*!< SSPn CR1: LBM Mask                      */
#define SSPn_CR1_SSE_Pos                      1                                                       /*!< SSPn CR1: SSE Position                  */
#define SSPn_CR1_SSE_Msk                      (0x01UL << SSPn_CR1_SSE_Pos)                            /*!< SSPn CR1: SSE Mask                      */
#define SSPn_CR1_MS_Pos                       2                                                       /*!< SSPn CR1: MS Position                   */
#define SSPn_CR1_MS_Msk                       (0x01UL << SSPn_CR1_MS_Pos)                             /*!< SSPn CR1: MS Mask                       */
#define SSPn_CR1_SOD_Pos                      3                                                       /*!< SSPn CR1: SOD Position                  */
#define SSPn_CR1_SOD_Msk                      (0x01UL << SSPn_CR1_SOD_Pos)                            /*!< SSPn CR1: SOD Mask                      */

/* -----------------------------------  SSPn_DR  ---------------------------------- */
#define SSPn_DR_DATA_Pos                      0                                                       /*!< SSPn DR: DATA Position                  */
#define SSPn_DR_DATA_Msk                      (0x0000ffffUL << SSPn_DR_DATA_Pos)                      /*!< SSPn DR: DATA Mask                      */

/* -----------------------------------  SSPn_SR  ---------------------------------- */
#define SSPn_SR_TFE_Pos                       0                                                       /*!< SSPn SR: TFE Position                   */
#define SSPn_SR_TFE_Msk                       (0x01UL << SSPn_SR_TFE_Pos)                             /*!< SSPn SR: TFE Mask                       */
#define SSPn_SR_TNF_Pos                       1                                                       /*!< SSPn SR: TNF Position                   */
#define SSPn_SR_TNF_Msk                       (0x01UL << SSPn_SR_TNF_Pos)                             /*!< SSPn SR: TNF Mask                       */
#define SSPn_SR_RNE_Pos                       2                                                       /*!< SSPn SR: RNE Position                   */
#define SSPn_SR_RNE_Msk                       (0x01UL << SSPn_SR_RNE_Pos)                             /*!< SSPn SR: RNE Mask                       */
#define SSPn_SR_RFF_Pos                       3                                                       /*!< SSPn SR: RFF Position                   */
#define SSPn_SR_RFF_Msk                       (0x01UL << SSPn_SR_RFF_Pos)                             /*!< SSPn SR: RFF Mask                       */
#define SSPn_SR_BSY_Pos                       4                                                       /*!< SSPn SR: BSY Position                   */
#define SSPn_SR_BSY_Msk                       (0x01UL << SSPn_SR_BSY_Pos)                             /*!< SSPn SR: BSY Mask                       */

/* ----------------------------------  SSPn_CPSR  --------------------------------- */
#define SSPn_CPSR_CPSDVSR_Pos                 0                                                       /*!< SSPn CPSR: CPSDVSR Position             */
#define SSPn_CPSR_CPSDVSR_Msk                 (0x000000ffUL << SSPn_CPSR_CPSDVSR_Pos)                 /*!< SSPn CPSR: CPSDVSR Mask                 */

/* ----------------------------------  SSPn_IMSC  --------------------------------- */
#define SSPn_IMSC_RORIM_Pos                   0                                                       /*!< SSPn IMSC: RORIM Position               */
#define SSPn_IMSC_RORIM_Msk                   (0x01UL << SSPn_IMSC_RORIM_Pos)                         /*!< SSPn IMSC: RORIM Mask                   */
#define SSPn_IMSC_RTIM_Pos                    1                                                       /*!< SSPn IMSC: RTIM Position                */
#define SSPn_IMSC_RTIM_Msk                    (0x01UL << SSPn_IMSC_RTIM_Pos)                          /*!< SSPn IMSC: RTIM Mask                    */
#define SSPn_IMSC_RXIM_Pos                    2                                                       /*!< SSPn IMSC: RXIM Position                */
#define SSPn_IMSC_RXIM_Msk                    (0x01UL << SSPn_IMSC_RXIM_Pos)                          /*!< SSPn IMSC: RXIM Mask                    */
#define SSPn_IMSC_TXIM_Pos                    3                                                       /*!< SSPn IMSC: TXIM Position                */
#define SSPn_IMSC_TXIM_Msk                    (0x01UL << SSPn_IMSC_TXIM_Pos)                          /*!< SSPn IMSC: TXIM Mask                    */

