roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SSP0_RIS  ---------------------------------- */
#define SSP0_RIS_RORRIS_Pos                   0                                                       /*!< SSP0 RIS: RORRIS Position               */
#define SSP0_RIS_RORRIS_Msk                   (0x01UL << SSP0_RIS_RORRIS_Pos)                         /*!< SSP0 RIS: RORRIS Mask                   */
#define SSP0_RIS_RTRIS_Pos                    1                                                       /*!< SSP0 RIS: RTRIS Position                */
#define SSP0_RIS_RTRIS_Msk                    (0x01UL << SSP0_RIS_RTRIS_Pos)                          /*!< SSP0 RIS: RTRIS Mask                    */
#define SSP0_RIS_RXRIS_Pos                    2                                                       /*!< SSP0 RIS: RXRIS Position                */
#define SSP0_RIS_RXRIS_Msk                    (0x01UL << SSP0_RIS_RXRIS_Pos)                          /*!< SSP0 RIS: RXRIS Mask                    */
#define SSP0_RIS_TXRIS_Pos                    3                                                       /*!< SSP0 RIS: TXRIS Position                */
#define SSP0_RIS_TXRIS_Msk                    (0x01UL << SSP0_RIS_TXRIS_Pos)                          /*!< SSP0 RIS: TXRIS Mask                    */

/* ----------------------------------  SSP0_MIS  ---------------------------------- */
#define SSP0_MIS_RORMIS_Pos                   0                                                       /*!< SSP0 MIS: RORMIS Position               */
#define SSP0_MIS_RORMIS_Msk                   (0x01UL << SSP0_MIS_RORMIS_Pos)                         /*!< SSP0 MIS: RORMIS Mask                   */
#define SSP0_MIS_RTMIS_Pos                    1                                                       /*!< SSP0 MIS: RTMIS Position                */
#define SSP0_MIS_RTMIS_Msk                    (0x01UL << SSP0_MIS_RTMIS_Pos)                          /*!< SSP0 MIS: RTMIS Mask                    */
#define SSP0_MIS_RXMIS_Pos                    2                                                       /*!< SSP0 MIS: RXMIS Position                */
#define SSP0_MIS_RXMIS_Msk                    (0x01UL << SSP0_MIS_RXMIS_Pos)                          /*!< SSP0 MIS: RXMIS Mask                    */
#define SSP0_MIS_TXMIS_Pos                    3                                                       /*!< SSP0 MIS: TXMIS Position                */
#define SSP0_MIS_TXMIS_Msk                    (0x01UL << SSP0_MIS_TXMIS_Pos)                          /*!< SSP0 MIS: TXMIS Mask                    */

/* ----------------------------------  SSP0_ICR  ---------------------------------- */
#define SSP0_ICR_RORIC_Pos                    0                                                       /*!< SSP0 ICR: RORIC Position                */
#define SSP0_ICR_RORIC_Msk                    (0x01UL << SSP0_ICR_RORIC_Pos)                          /*!< SSP0 ICR: RORIC Mask                    */
#define SSP0_ICR_RTIC_Pos                     1                                                       /*!< SSP0 ICR: RTIC Position                 */
#define SSP0_ICR_RTIC_Msk                     (0x01UL << SSP0_ICR_RTIC_Pos)                           /*!< SSP0 ICR: RTIC Mask                     */

/* ---------------------------------  SSP0_DMACR  --------------------------------- */
#define SSP0_DMACR_RXDMAE_Pos                 0                                                       /*!< SSP0 DMACR: RXDMAE Position             */
#define SSP0_DMACR_RXDMAE_Msk                 (0x01UL << SSP0_DMACR_RXDMAE_Pos)                       /*!< SSP0 DMACR: RXDMAE Mask                 */
#define SSP0_DMACR_TXDMAE_Pos                 1                                                       /*!< SSP0 DMACR: TXDMAE Position             */
#define SSP0_DMACR_TXDMAE_Msk                 (0x01UL << SSP0_DMACR_TXDMAE_Pos)                       /*!< SSP0 DMACR: TXDMAE Mask                 */


/* ================================================================================ */
/* ================          struct 'SSP1' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  SSP1_CR0  ---------------------------------- */
#define SSP1_CR0_DSS_Pos                      0                                                       /*!< SSP1 CR0: DSS Position                  */
#define SSP1_CR0_DSS_Msk                      (0x0fUL << SSP1_CR0_DSS_Pos)                            /*!< SSP1 CR0: DSS Mask                      */
#define SSP1_CR0_FRF_Pos                      4                                                       /*!< SSP1 CR0: FRF Position                  */
#define SSP1_CR0_FRF_Msk                      (0x03UL << SSP1_CR0_FRF_Pos)                            /*!< SSP1 CR0: FRF Mask                      */
#define SSP1_CR0_CPOL_Pos                     6                                                       /*!< SSP1 CR0: CPOL Position                 */
#define SSP1_CR0_CPOL_Msk                     (0x01UL << SSP1_CR0_CPOL_Pos)                           /*!< SSP1 CR0: CPOL Mask                     */
#define SSP1_CR0_CPHA_Pos                     7                                                       /*!< SSP1 CR0: CPHA Position                 */
#define SSP1_CR0_CPHA_Msk                     (0x01UL << SSP1_CR0_CPHA_Pos)                           /*!< SSP1 CR0: CPHA Mask                     */
#define SSP1_CR0_SCR_Pos                      8                                                       /*!< SSP1 CR0: SCR Position                  */
#define SSP1_CR0_SCR_Msk                      (0x000000ffUL << SSP1_CR0_SCR_Pos)                      /*!< SSP1 CR0: SCR Mask                      */

/* ----------------------------------  SSP1_CR1  ---------------------------------- */
#define SSP1_CR1_LBM_Pos                      0                                                       /*!< SSP1 CR1: LBM Position                  */
#define SSP1_CR1_LBM_Msk                      (0x01UL << SSP1_CR1_LBM_Pos)                            /*!< SSP1 CR1: LBM Mask                      */
#define SSP1_CR1_SSE_Pos                      1                                                       /*!< SSP1 CR1: SSE Position                  */
#define SSP1_CR1_SSE_Msk                      (0x01UL << SSP1_CR1_SSE_Pos)                            /*!< SSP1 CR1: SSE Mask                      */
#define SSP1_CR1_MS_Pos                       2                                                       /*!< SSP1 CR1: MS Position                   */
#define SSP1_CR1_MS_Msk                       (0x01UL << SSP1_CR1_MS_Pos)                             /*!< SSP1 CR1: MS Mask                       */
#define SSP1_CR1_SOD_Pos                      3                                                       /*!< SSP1 CR1: SOD Position                  */
#define SSP1_CR1_SOD_Msk                      (0x01UL << SSP1_CR1_SOD_Pos)                            /*!< SSP1 CR1: SOD Mask                      */

/* -----------------------------------  SSP1_DR  ---------------------------------- */
#define SSP1_DR_DATA_Pos                      0                                                       /*!< SSP1 DR: DATA Position                  */
#define SSP1_DR_DATA_Msk                      (0x0000ffffUL << SSP1_DR_DATA_Pos)                      /*!< SSP1 DR: DATA Mask                      */

/* -----------------------------------  SSP1_SR  ---------------------------------- */
#define SSP1_SR_TFE_Pos                       0                                                       /*!< SSP1 SR: TFE Position                   */
#define SSP1_SR_TFE_Msk                       (0x01UL << SSP1_SR_TFE_Pos)                             /*!< SSP1 SR: TFE Mask                       */
#define SSP1_SR_TNF_Pos                       1                                                       /*!< SSP1 SR: TNF Position                   */
#define SSP1_SR_TNF_Msk                       (0x01UL << SSP1_SR_TNF_Pos)                             /*!< SSP1 SR: TNF Mask                       */
#define SSP1_SR_RNE_Pos                       2                                                       /*!< SSP1 SR: RNE Position                   */
#define SSP1_SR_RNE_Msk                       (0x01UL << SSP1_SR_RNE_Pos)                             /*!< SSP1 SR: RNE Mask                       */
#define SSP1_SR_RFF_Pos                       3                                                       /*!< SSP1 SR: RFF Position                   */
#define SSP1_SR_RFF_Msk                       (0x01UL << SSP1_SR_RFF_Pos)                             /*!< SSP1 SR: RFF Mask                       */
#define SSP1_SR_BSY_Pos                       4                                                       /*!< SSP1 SR: BSY Position                   */
#define SSP1_SR_BSY_Msk                       (0x01UL << SSP1_SR_BSY_Pos)                             /*!< SSP1 SR: BSY Mask                       */

/* ----------------------------------  SSP1_CPSR  --------------------------------- */
#define SSP1_CPSR_CPSDVSR_Pos                 0                                                       /*!< SSP1 CPSR: CPSDVSR Position             */
#define SSP1_CPSR_CPSDVSR_Msk                 (0x000000ffUL << SSP1_CPSR_CPSDVSR_Pos)                 /*!< SSP1 CPSR: CPSDVSR Mask                 */

/* ----------------------------------  SSP1_IMSC  --------------------------------- */
#define SSP1_IMSC_RORIM_Pos                   0                                                       /*!< SSP1 IMSC: RORIM Position               */
#define SSP1_IMSC_RORIM_Msk                   (0x01UL << SSP1_IMSC_RORIM_Pos)                         /*!< SSP1 IMSC: RORIM Mask                   */
#define SSP1_IMSC_RTIM_Pos                    1                                                       /*!< SSP1 IMSC: RTIM Position                */
#define SSP1_IMSC_RTIM_Msk                    (0x01UL << SSP1_IMSC_RTIM_Pos)                          /*!< SSP1 IMSC: RTIM Mask                    */
#define SSP1_IMSC_RXIM_Pos                    2                                                       /*!< SSP1 IMSC: RXIM Position                */
#define SSP1_IMSC_RXIM_Msk                    (0x01UL << SSP1_IMSC_RXIM_Pos)                          /*!< SSP1 IMSC: RXIM Mask                    */
#define SSP1_IMSC_TXIM_Pos                    3                                                       /*!< SSP1 IMSC: TXIM Position                */
#define SSP1_IMSC_TXIM_Msk                    (0x01UL << SSP1_IMSC_TXIM_Pos)                          /*!< SSP1 IMSC: TXIM Mask                    */

/* ----------------------------------  SSP1_RIS  ---------------------------------- */
#define SSP1_RIS_RORRIS_Pos                   0                                                       /*!< SSP1 RIS: RORRIS Position               */
#define SSP1_RIS_RORRIS_Msk                   (0x01UL << SSP1_RIS_RORRIS_Pos)                         /*!< SSP1 RIS: RORRIS Mask                   */
#define SSP1_RIS_RTRIS_Pos                    1                                                       /*!< SSP1 RIS: RTRIS Position                */
#define SSP1_RIS_RTRIS_Msk                    (0x01UL << SSP1_RIS_RTRIS_Pos)                          /*!< SSP1 RIS: RTRIS Mask                    */
#define SSP1_RIS_RXRIS_Pos                    2                                                       /*!< SSP1 RIS: RXRIS Position                */
#define SSP1_RIS_RXRIS_Msk                    (0x01UL << SSP1_RIS_RXRIS_Pos)                          /*!< SSP1 RIS: RXRIS Mask                    */
#define SSP1_RIS_TXRIS_Pos                    3                                                       /*!< SSP1 RIS: TXRIS Position                */
#define SSP1_RIS_TXRIS_Msk                    (0x01UL << SSP1_RIS_TXRIS_Pos)                          /*!< SSP1 RIS: TXRIS Mask                    */

/* ----------------------------------  SSP1_MIS  ---------------------------------- */
#define SSP1_MIS_RORMIS_Pos                   0                                                       /*!< SSP1 MIS: RORMIS Position               */
#define SSP1_MIS_RORMIS_Msk                   (0x01UL << SSP1_MIS_RORMIS_Pos)                         /*!< SSP1 MIS: RORMIS Mask                   */
#define SSP1_MIS_RTMIS_Pos                    1                                                       /*!< SSP1 MIS: RTMIS Position                */
#define SSP1_MIS_RTMIS_Msk                    (0x01UL << SSP1_MIS_RTMIS_Pos)                          /*!< SSP1 MIS: RTMIS Mask                    */
#define SSP1_MIS_RXMIS_Pos                    2                                                       /*!< SSP1 MIS: RXMIS Position                */
#define SSP1_MIS_RXMIS_Msk                    (0x01UL << SSP1_MIS_RXMIS_Pos)                          /*!< SSP1 MIS: RXMIS Mask                    */
#define SSP1_MIS_TXMIS_Pos                    3                                                       /*!< SSP1 MIS: TXMIS Position                */
#define SSP1_MIS_TXMIS_Msk                    (0x01UL << SSP1_MIS_TXMIS_Pos)                          /*!< SSP1 MIS: TXMIS Mask                    */

