roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SSP1_ICR  ---------------------------------- */
#define SSP1_ICR_RORIC_Pos                    0                                                       /*!< SSP1 ICR: RORIC Position                */
#define SSP1_ICR_RORIC_Msk                    (0x01UL << SSP1_ICR_RORIC_Pos)                          /*!< SSP1 ICR: RORIC Mask                    */
#define SSP1_ICR_RTIC_Pos                     1                                                       /*!< SSP1 ICR: RTIC Position                 */
#define SSP1_ICR_RTIC_Msk                     (0x01UL << SSP1_ICR_RTIC_Pos)                           /*!< SSP1 ICR: RTIC Mask                     */

/* ---------------------------------  SSP1_DMACR  --------------------------------- */
#define SSP1_DMACR_RXDMAE_Pos                 0                                                       /*!< SSP1 DMACR: RXDMAE Position             */
#define SSP1_DMACR_RXDMAE_Msk                 (0x01UL << SSP1_DMACR_RXDMAE_Pos)                       /*!< SSP1 DMACR: RXDMAE Mask                 */
#define SSP1_DMACR_TXDMAE_Pos                 1                                                       /*!< SSP1 DMACR: TXDMAE Position             */
#define SSP1_DMACR_TXDMAE_Msk                 (0x01UL << SSP1_DMACR_TXDMAE_Pos)                       /*!< SSP1 DMACR: TXDMAE Mask                 */


/* ================================================================================ */
/* ================         Group 'TIMERn' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  TIMERn_IR  --------------------------------- */
#define TIMERn_IR_MR0INT_Pos                  0                                                       /*!< TIMERn IR: MR0INT Position              */
#define TIMERn_IR_MR0INT_Msk                  (0x01UL << TIMERn_IR_MR0INT_Pos)                        /*!< TIMERn IR: MR0INT Mask                  */
#define TIMERn_IR_MR1INT_Pos                  1                                                       /*!< TIMERn IR: MR1INT Position              */
#define TIMERn_IR_MR1INT_Msk                  (0x01UL << TIMERn_IR_MR1INT_Pos)                        /*!< TIMERn IR: MR1INT Mask                  */
#define TIMERn_IR_MR2INT_Pos                  2                                                       /*!< TIMERn IR: MR2INT Position              */
#define TIMERn_IR_MR2INT_Msk                  (0x01UL << TIMERn_IR_MR2INT_Pos)                        /*!< TIMERn IR: MR2INT Mask                  */
#define TIMERn_IR_MR3INT_Pos                  3                                                       /*!< TIMERn IR: MR3INT Position              */
#define TIMERn_IR_MR3INT_Msk                  (0x01UL << TIMERn_IR_MR3INT_Pos)                        /*!< TIMERn IR: MR3INT Mask                  */
#define TIMERn_IR_CR0INT_Pos                  4                                                       /*!< TIMERn IR: CR0INT Position              */
#define TIMERn_IR_CR0INT_Msk                  (0x01UL << TIMERn_IR_CR0INT_Pos)                        /*!< TIMERn IR: CR0INT Mask                  */
#define TIMERn_IR_CR1INT_Pos                  5                                                       /*!< TIMERn IR: CR1INT Position              */
#define TIMERn_IR_CR1INT_Msk                  (0x01UL << TIMERn_IR_CR1INT_Pos)                        /*!< TIMERn IR: CR1INT Mask                  */
#define TIMERn_IR_CR2INT_Pos                  6                                                       /*!< TIMERn IR: CR2INT Position              */
#define TIMERn_IR_CR2INT_Msk                  (0x01UL << TIMERn_IR_CR2INT_Pos)                        /*!< TIMERn IR: CR2INT Mask                  */
#define TIMERn_IR_CR3INT_Pos                  7                                                       /*!< TIMERn IR: CR3INT Position              */
#define TIMERn_IR_CR3INT_Msk                  (0x01UL << TIMERn_IR_CR3INT_Pos)                        /*!< TIMERn IR: CR3INT Mask                  */

/* ---------------------------------  TIMERn_TCR  --------------------------------- */
#define TIMERn_TCR_CEN_Pos                    0                                                       /*!< TIMERn TCR: CEN Position                */
#define TIMERn_TCR_CEN_Msk                    (0x01UL << TIMERn_TCR_CEN_Pos)                          /*!< TIMERn TCR: CEN Mask                    */
#define TIMERn_TCR_CRST_Pos                   1                                                       /*!< TIMERn TCR: CRST Position               */
#define TIMERn_TCR_CRST_Msk                   (0x01UL << TIMERn_TCR_CRST_Pos)                         /*!< TIMERn TCR: CRST Mask                   */

/* ----------------------------------  TIMERn_TC  --------------------------------- */
#define TIMERn_TC_TC_Pos                      0                                                       /*!< TIMERn TC: TC Position                  */
#define TIMERn_TC_TC_Msk                      (0xffffffffUL << TIMERn_TC_TC_Pos)                      /*!< TIMERn TC: TC Mask                      */

/* ----------------------------------  TIMERn_PR  --------------------------------- */
#define TIMERn_PR_PM_Pos                      0                                                       /*!< TIMERn PR: PM Position                  */
#define TIMERn_PR_PM_Msk                      (0xffffffffUL << TIMERn_PR_PM_Pos)                      /*!< TIMERn PR: PM Mask                      */

/* ----------------------------------  TIMERn_PC  --------------------------------- */
#define TIMERn_PC_PC_Pos                      0                                                       /*!< TIMERn PC: PC Position                  */
#define TIMERn_PC_PC_Msk                      (0xffffffffUL << TIMERn_PC_PC_Pos)                      /*!< TIMERn PC: PC Mask                      */

/* ---------------------------------  TIMERn_MCR  --------------------------------- */
#define TIMERn_MCR_MR0I_Pos                   0                                                       /*!< TIMERn MCR: MR0I Position               */
#define TIMERn_MCR_MR0I_Msk                   (0x01UL << TIMERn_MCR_MR0I_Pos)                         /*!< TIMERn MCR: MR0I Mask                   */
#define TIMERn_MCR_MR0R_Pos                   1                                                       /*!< TIMERn MCR: MR0R Position               */
#define TIMERn_MCR_MR0R_Msk                   (0x01UL << TIMERn_MCR_MR0R_Pos)                         /*!< TIMERn MCR: MR0R Mask                   */
#define TIMERn_MCR_MR0S_Pos                   2                                                       /*!< TIMERn MCR: MR0S Position               */
#define TIMERn_MCR_MR0S_Msk                   (0x01UL << TIMERn_MCR_MR0S_Pos)                         /*!< TIMERn MCR: MR0S Mask                   */
#define TIMERn_MCR_MR1I_Pos                   3                                                       /*!< TIMERn MCR: MR1I Position               */
#define TIMERn_MCR_MR1I_Msk                   (0x01UL << TIMERn_MCR_MR1I_Pos)                         /*!< TIMERn MCR: MR1I Mask                   */
#define TIMERn_MCR_MR1R_Pos                   4                                                       /*!< TIMERn MCR: MR1R Position               */
#define TIMERn_MCR_MR1R_Msk                   (0x01UL << TIMERn_MCR_MR1R_Pos)                         /*!< TIMERn MCR: MR1R Mask                   */
#define TIMERn_MCR_MR1S_Pos                   5                                                       /*!< TIMERn MCR: MR1S Position               */
#define TIMERn_MCR_MR1S_Msk                   (0x01UL << TIMERn_MCR_MR1S_Pos)                         /*!< TIMERn MCR: MR1S Mask                   */
#define TIMERn_MCR_MR2I_Pos                   6                                                       /*!< TIMERn MCR: MR2I Position               */
#define TIMERn_MCR_MR2I_Msk                   (0x01UL << TIMERn_MCR_MR2I_Pos)                         /*!< TIMERn MCR: MR2I Mask                   */
#define TIMERn_MCR_MR2R_Pos                   7                                                       /*!< TIMERn MCR: MR2R Position               */
#define TIMERn_MCR_MR2R_Msk                   (0x01UL << TIMERn_MCR_MR2R_Pos)                         /*!< TIMERn MCR: MR2R Mask                   */
#define TIMERn_MCR_MR2S_Pos                   8                                                       /*!< TIMERn MCR: MR2S Position               */
#define TIMERn_MCR_MR2S_Msk                   (0x01UL << TIMERn_MCR_MR2S_Pos)                         /*!< TIMERn MCR: MR2S Mask                   */
#define TIMERn_MCR_MR3I_Pos                   9                                                       /*!< TIMERn MCR: MR3I Position               */
#define TIMERn_MCR_MR3I_Msk                   (0x01UL << TIMERn_MCR_MR3I_Pos)                         /*!< TIMERn MCR: MR3I Mask                   */
#define TIMERn_MCR_MR3R_Pos                   10                                                      /*!< TIMERn MCR: MR3R Position               */
#define TIMERn_MCR_MR3R_Msk                   (0x01UL << TIMERn_MCR_MR3R_Pos)                         /*!< TIMERn MCR: MR3R Mask                   */
#define TIMERn_MCR_MR3S_Pos                   11                                                      /*!< TIMERn MCR: MR3S Position               */
#define TIMERn_MCR_MR3S_Msk                   (0x01UL << TIMERn_MCR_MR3S_Pos)                         /*!< TIMERn MCR: MR3S Mask                   */

