roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  TIMERn_MR0  --------------------------------- */
#define TIMERn_MR0_MATCH_Pos                  0                                                       /*!< TIMERn MR0: MATCH Position              */
#define TIMERn_MR0_MATCH_Msk                  (0xffffffffUL << TIMERn_MR0_MATCH_Pos)                  /*!< TIMERn MR0: MATCH Mask                  */

/* ---------------------------------  TIMERn_MR1  --------------------------------- */
#define TIMERn_MR1_MATCH_Pos                  0                                                       /*!< TIMERn MR1: MATCH Position              */
#define TIMERn_MR1_MATCH_Msk                  (0xffffffffUL << TIMERn_MR1_MATCH_Pos)                  /*!< TIMERn MR1: MATCH Mask                  */

/* ---------------------------------  TIMERn_MR2  --------------------------------- */
#define TIMERn_MR2_MATCH_Pos                  0                                                       /*!< TIMERn MR2: MATCH Position              */
#define TIMERn_MR2_MATCH_Msk                  (0xffffffffUL << TIMERn_MR2_MATCH_Pos)                  /*!< TIMERn MR2: MATCH Mask                  */

/* ---------------------------------  TIMERn_MR3  --------------------------------- */
#define TIMERn_MR3_MATCH_Pos                  0                                                       /*!< TIMERn MR3: MATCH Position              */
#define TIMERn_MR3_MATCH_Msk                  (0xffffffffUL << TIMERn_MR3_MATCH_Pos)                  /*!< TIMERn MR3: MATCH Mask                  */

/* ---------------------------------  TIMERn_CCR  --------------------------------- */
#define TIMERn_CCR_CAP0RE_Pos                 0                                                       /*!< TIMERn CCR: CAP0RE Position             */
#define TIMERn_CCR_CAP0RE_Msk                 (0x01UL << TIMERn_CCR_CAP0RE_Pos)                       /*!< TIMERn CCR: CAP0RE Mask                 */
#define TIMERn_CCR_CAP0FE_Pos                 1                                                       /*!< TIMERn CCR: CAP0FE Position             */
#define TIMERn_CCR_CAP0FE_Msk                 (0x01UL << TIMERn_CCR_CAP0FE_Pos)                       /*!< TIMERn CCR: CAP0FE Mask                 */
#define TIMERn_CCR_CAP0I_Pos                  2                                                       /*!< TIMERn CCR: CAP0I Position              */
#define TIMERn_CCR_CAP0I_Msk                  (0x01UL << TIMERn_CCR_CAP0I_Pos)                        /*!< TIMERn CCR: CAP0I Mask                  */
#define TIMERn_CCR_CAP1RE_Pos                 3                                                       /*!< TIMERn CCR: CAP1RE Position             */
#define TIMERn_CCR_CAP1RE_Msk                 (0x01UL << TIMERn_CCR_CAP1RE_Pos)                       /*!< TIMERn CCR: CAP1RE Mask                 */
#define TIMERn_CCR_CAP1FE_Pos                 4                                                       /*!< TIMERn CCR: CAP1FE Position             */
#define TIMERn_CCR_CAP1FE_Msk                 (0x01UL << TIMERn_CCR_CAP1FE_Pos)                       /*!< TIMERn CCR: CAP1FE Mask                 */
#define TIMERn_CCR_CAP1I_Pos                  5                                                       /*!< TIMERn CCR: CAP1I Position              */
#define TIMERn_CCR_CAP1I_Msk                  (0x01UL << TIMERn_CCR_CAP1I_Pos)                        /*!< TIMERn CCR: CAP1I Mask                  */
#define TIMERn_CCR_CAP2RE_Pos                 6                                                       /*!< TIMERn CCR: CAP2RE Position             */
#define TIMERn_CCR_CAP2RE_Msk                 (0x01UL << TIMERn_CCR_CAP2RE_Pos)                       /*!< TIMERn CCR: CAP2RE Mask                 */
#define TIMERn_CCR_CAP2FE_Pos                 7                                                       /*!< TIMERn CCR: CAP2FE Position             */
#define TIMERn_CCR_CAP2FE_Msk                 (0x01UL << TIMERn_CCR_CAP2FE_Pos)                       /*!< TIMERn CCR: CAP2FE Mask                 */
#define TIMERn_CCR_CAP2I_Pos                  8                                                       /*!< TIMERn CCR: CAP2I Position              */
#define TIMERn_CCR_CAP2I_Msk                  (0x01UL << TIMERn_CCR_CAP2I_Pos)                        /*!< TIMERn CCR: CAP2I Mask                  */
#define TIMERn_CCR_CAP3RE_Pos                 9                                                       /*!< TIMERn CCR: CAP3RE Position             */
#define TIMERn_CCR_CAP3RE_Msk                 (0x01UL << TIMERn_CCR_CAP3RE_Pos)                       /*!< TIMERn CCR: CAP3RE Mask                 */
#define TIMERn_CCR_CAP3FE_Pos                 10                                                      /*!< TIMERn CCR: CAP3FE Position             */
#define TIMERn_CCR_CAP3FE_Msk                 (0x01UL << TIMERn_CCR_CAP3FE_Pos)                       /*!< TIMERn CCR: CAP3FE Mask                 */
#define TIMERn_CCR_CAP3I_Pos                  11                                                      /*!< TIMERn CCR: CAP3I Position              */
#define TIMERn_CCR_CAP3I_Msk                  (0x01UL << TIMERn_CCR_CAP3I_Pos)                        /*!< TIMERn CCR: CAP3I Mask                  */

/* ---------------------------------  TIMERn_CR0  --------------------------------- */
#define TIMERn_CR0_CAP_Pos                    0                                                       /*!< TIMERn CR0: CAP Position                */
#define TIMERn_CR0_CAP_Msk                    (0xffffffffUL << TIMERn_CR0_CAP_Pos)                    /*!< TIMERn CR0: CAP Mask                    */

/* ---------------------------------  TIMERn_CR1  --------------------------------- */
#define TIMERn_CR1_CAP_Pos                    0                                                       /*!< TIMERn CR1: CAP Position                */
#define TIMERn_CR1_CAP_Msk                    (0xffffffffUL << TIMERn_CR1_CAP_Pos)                    /*!< TIMERn CR1: CAP Mask                    */

/* ---------------------------------  TIMERn_CR2  --------------------------------- */
#define TIMERn_CR2_CAP_Pos                    0                                                       /*!< TIMERn CR2: CAP Position                */
#define TIMERn_CR2_CAP_Msk                    (0xffffffffUL << TIMERn_CR2_CAP_Pos)                    /*!< TIMERn CR2: CAP Mask                    */

/* ---------------------------------  TIMERn_CR3  --------------------------------- */
#define TIMERn_CR3_CAP_Pos                    0                                                       /*!< TIMERn CR3: CAP Position                */
#define TIMERn_CR3_CAP_Msk                    (0xffffffffUL << TIMERn_CR3_CAP_Pos)                    /*!< TIMERn CR3: CAP Mask                    */

