roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  TIMERn_EMR  --------------------------------- */
#define TIMERn_EMR_EM0_Pos                    0                                                       /*!< TIMERn EMR: EM0 Position                */
#define TIMERn_EMR_EM0_Msk                    (0x01UL << TIMERn_EMR_EM0_Pos)                          /*!< TIMERn EMR: EM0 Mask                    */
#define TIMERn_EMR_EM1_Pos                    1                                                       /*!< TIMERn EMR: EM1 Position                */
#define TIMERn_EMR_EM1_Msk                    (0x01UL << TIMERn_EMR_EM1_Pos)                          /*!< TIMERn EMR: EM1 Mask                    */
#define TIMERn_EMR_EM2_Pos                    2                                                       /*!< TIMERn EMR: EM2 Position                */
#define TIMERn_EMR_EM2_Msk                    (0x01UL << TIMERn_EMR_EM2_Pos)                          /*!< TIMERn EMR: EM2 Mask                    */
#define TIMERn_EMR_EM3_Pos                    3                                                       /*!< TIMERn EMR: EM3 Position                */
#define TIMERn_EMR_EM3_Msk                    (0x01UL << TIMERn_EMR_EM3_Pos)                          /*!< TIMERn EMR: EM3 Mask                    */
#define TIMERn_EMR_EMC0_Pos                   4                                                       /*!< TIMERn EMR: EMC0 Position               */
#define TIMERn_EMR_EMC0_Msk                   (0x03UL << TIMERn_EMR_EMC0_Pos)                         /*!< TIMERn EMR: EMC0 Mask                   */
#define TIMERn_EMR_EMC1_Pos                   6                                                       /*!< TIMERn EMR: EMC1 Position               */
#define TIMERn_EMR_EMC1_Msk                   (0x03UL << TIMERn_EMR_EMC1_Pos)                         /*!< TIMERn EMR: EMC1 Mask                   */
#define TIMERn_EMR_EMC2_Pos                   8                                                       /*!< TIMERn EMR: EMC2 Position               */
#define TIMERn_EMR_EMC2_Msk                   (0x03UL << TIMERn_EMR_EMC2_Pos)                         /*!< TIMERn EMR: EMC2 Mask                   */
#define TIMERn_EMR_EMC3_Pos                   10                                                      /*!< TIMERn EMR: EMC3 Position               */
#define TIMERn_EMR_EMC3_Msk                   (0x03UL << TIMERn_EMR_EMC3_Pos)                         /*!< TIMERn EMR: EMC3 Mask                   */

/* ---------------------------------  TIMERn_CTCR  -------------------------------- */
#define TIMERn_CTCR_CTMODE_Pos                0                                                       /*!< TIMERn CTCR: CTMODE Position            */
#define TIMERn_CTCR_CTMODE_Msk                (0x03UL << TIMERn_CTCR_CTMODE_Pos)                      /*!< TIMERn CTCR: CTMODE Mask                */
#define TIMERn_CTCR_CINSEL_Pos                2                                                       /*!< TIMERn CTCR: CINSEL Position            */
#define TIMERn_CTCR_CINSEL_Msk                (0x03UL << TIMERn_CTCR_CINSEL_Pos)                      /*!< TIMERn CTCR: CINSEL Mask                */


/* ================================================================================ */
/* ================         struct 'TIMER0' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------------  TIMER0_IR  --------------------------------- */
#define TIMER0_IR_MR0INT_Pos                  0                                                       /*!< TIMER0 IR: MR0INT Position              */
#define TIMER0_IR_MR0INT_Msk                  (0x01UL << TIMER0_IR_MR0INT_Pos)                        /*!< TIMER0 IR: MR0INT Mask                  */
#define TIMER0_IR_MR1INT_Pos                  1                                                       /*!< TIMER0 IR: MR1INT Position              */
#define TIMER0_IR_MR1INT_Msk                  (0x01UL << TIMER0_IR_MR1INT_Pos)                        /*!< TIMER0 IR: MR1INT Mask                  */
#define TIMER0_IR_MR2INT_Pos                  2                                                       /*!< TIMER0 IR: MR2INT Position              */
#define TIMER0_IR_MR2INT_Msk                  (0x01UL << TIMER0_IR_MR2INT_Pos)                        /*!< TIMER0 IR: MR2INT Mask                  */
#define TIMER0_IR_MR3INT_Pos                  3                                                       /*!< TIMER0 IR: MR3INT Position              */
#define TIMER0_IR_MR3INT_Msk                  (0x01UL << TIMER0_IR_MR3INT_Pos)                        /*!< TIMER0 IR: MR3INT Mask                  */
#define TIMER0_IR_CR0INT_Pos                  4                                                       /*!< TIMER0 IR: CR0INT Position              */
#define TIMER0_IR_CR0INT_Msk                  (0x01UL << TIMER0_IR_CR0INT_Pos)                        /*!< TIMER0 IR: CR0INT Mask                  */
#define TIMER0_IR_CR1INT_Pos                  5                                                       /*!< TIMER0 IR: CR1INT Position              */
#define TIMER0_IR_CR1INT_Msk                  (0x01UL << TIMER0_IR_CR1INT_Pos)                        /*!< TIMER0 IR: CR1INT Mask                  */
#define TIMER0_IR_CR2INT_Pos                  6                                                       /*!< TIMER0 IR: CR2INT Position              */
#define TIMER0_IR_CR2INT_Msk                  (0x01UL << TIMER0_IR_CR2INT_Pos)                        /*!< TIMER0 IR: CR2INT Mask                  */
#define TIMER0_IR_CR3INT_Pos                  7                                                       /*!< TIMER0 IR: CR3INT Position              */
#define TIMER0_IR_CR3INT_Msk                  (0x01UL << TIMER0_IR_CR3INT_Pos)                        /*!< TIMER0 IR: CR3INT Mask                  */

/* ---------------------------------  TIMER0_TCR  --------------------------------- */
#define TIMER0_TCR_CEN_Pos                    0                                                       /*!< TIMER0 TCR: CEN Position                */
#define TIMER0_TCR_CEN_Msk                    (0x01UL << TIMER0_TCR_CEN_Pos)                          /*!< TIMER0 TCR: CEN Mask                    */
#define TIMER0_TCR_CRST_Pos                   1                                                       /*!< TIMER0 TCR: CRST Position               */
#define TIMER0_TCR_CRST_Msk                   (0x01UL << TIMER0_TCR_CRST_Pos)                         /*!< TIMER0 TCR: CRST Mask                   */

/* ----------------------------------  TIMER0_TC  --------------------------------- */
#define TIMER0_TC_TC_Pos                      0                                                       /*!< TIMER0 TC: TC Position                  */
#define TIMER0_TC_TC_Msk                      (0xffffffffUL << TIMER0_TC_TC_Pos)                      /*!< TIMER0 TC: TC Mask                      */

/* ----------------------------------  TIMER0_PR  --------------------------------- */
#define TIMER0_PR_PM_Pos                      0                                                       /*!< TIMER0 PR: PM Position                  */
#define TIMER0_PR_PM_Msk                      (0xffffffffUL << TIMER0_PR_PM_Pos)                      /*!< TIMER0 PR: PM Mask                      */

