roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  TIMER0_PC  --------------------------------- */
#define TIMER0_PC_PC_Pos                      0                                                       /*!< TIMER0 PC: PC Position                  */
#define TIMER0_PC_PC_Msk                      (0xffffffffUL << TIMER0_PC_PC_Pos)                      /*!< TIMER0 PC: PC Mask                      */

/* ---------------------------------  TIMER0_MCR  --------------------------------- */
#define TIMER0_MCR_MR0I_Pos                   0                                                       /*!< TIMER0 MCR: MR0I Position               */
#define TIMER0_MCR_MR0I_Msk                   (0x01UL << TIMER0_MCR_MR0I_Pos)                         /*!< TIMER0 MCR: MR0I Mask                   */
#define TIMER0_MCR_MR0R_Pos                   1                                                       /*!< TIMER0 MCR: MR0R Position               */
#define TIMER0_MCR_MR0R_Msk                   (0x01UL << TIMER0_MCR_MR0R_Pos)                         /*!< TIMER0 MCR: MR0R Mask                   */
#define TIMER0_MCR_MR0S_Pos                   2                                                       /*!< TIMER0 MCR: MR0S Position               */
#define TIMER0_MCR_MR0S_Msk                   (0x01UL << TIMER0_MCR_MR0S_Pos)                         /*!< TIMER0 MCR: MR0S Mask                   */
#define TIMER0_MCR_MR1I_Pos                   3                                                       /*!< TIMER0 MCR: MR1I Position               */
#define TIMER0_MCR_MR1I_Msk                   (0x01UL << TIMER0_MCR_MR1I_Pos)                         /*!< TIMER0 MCR: MR1I Mask                   */
#define TIMER0_MCR_MR1R_Pos                   4                                                       /*!< TIMER0 MCR: MR1R Position               */
#define TIMER0_MCR_MR1R_Msk                   (0x01UL << TIMER0_MCR_MR1R_Pos)                         /*!< TIMER0 MCR: MR1R Mask                   */
#define TIMER0_MCR_MR1S_Pos                   5                                                       /*!< TIMER0 MCR: MR1S Position               */
#define TIMER0_MCR_MR1S_Msk                   (0x01UL << TIMER0_MCR_MR1S_Pos)                         /*!< TIMER0 MCR: MR1S Mask                   */
#define TIMER0_MCR_MR2I_Pos                   6                                                       /*!< TIMER0 MCR: MR2I Position               */
#define TIMER0_MCR_MR2I_Msk                   (0x01UL << TIMER0_MCR_MR2I_Pos)                         /*!< TIMER0 MCR: MR2I Mask                   */
#define TIMER0_MCR_MR2R_Pos                   7                                                       /*!< TIMER0 MCR: MR2R Position               */
#define TIMER0_MCR_MR2R_Msk                   (0x01UL << TIMER0_MCR_MR2R_Pos)                         /*!< TIMER0 MCR: MR2R Mask                   */
#define TIMER0_MCR_MR2S_Pos                   8                                                       /*!< TIMER0 MCR: MR2S Position               */
#define TIMER0_MCR_MR2S_Msk                   (0x01UL << TIMER0_MCR_MR2S_Pos)                         /*!< TIMER0 MCR: MR2S Mask                   */
#define TIMER0_MCR_MR3I_Pos                   9                                                       /*!< TIMER0 MCR: MR3I Position               */
#define TIMER0_MCR_MR3I_Msk                   (0x01UL << TIMER0_MCR_MR3I_Pos)                         /*!< TIMER0 MCR: MR3I Mask                   */
#define TIMER0_MCR_MR3R_Pos                   10                                                      /*!< TIMER0 MCR: MR3R Position               */
#define TIMER0_MCR_MR3R_Msk                   (0x01UL << TIMER0_MCR_MR3R_Pos)                         /*!< TIMER0 MCR: MR3R Mask                   */
#define TIMER0_MCR_MR3S_Pos                   11                                                      /*!< TIMER0 MCR: MR3S Position               */
#define TIMER0_MCR_MR3S_Msk                   (0x01UL << TIMER0_MCR_MR3S_Pos)                         /*!< TIMER0 MCR: MR3S Mask                   */

/* ---------------------------------  TIMER0_MR0  --------------------------------- */
#define TIMER0_MR0_MATCH_Pos                  0                                                       /*!< TIMER0 MR0: MATCH Position              */
#define TIMER0_MR0_MATCH_Msk                  (0xffffffffUL << TIMER0_MR0_MATCH_Pos)                  /*!< TIMER0 MR0: MATCH Mask                  */

/* ---------------------------------  TIMER0_MR1  --------------------------------- */
#define TIMER0_MR1_MATCH_Pos                  0                                                       /*!< TIMER0 MR1: MATCH Position              */
#define TIMER0_MR1_MATCH_Msk                  (0xffffffffUL << TIMER0_MR1_MATCH_Pos)                  /*!< TIMER0 MR1: MATCH Mask                  */

/* ---------------------------------  TIMER0_MR2  --------------------------------- */
#define TIMER0_MR2_MATCH_Pos                  0                                                       /*!< TIMER0 MR2: MATCH Position              */
#define TIMER0_MR2_MATCH_Msk                  (0xffffffffUL << TIMER0_MR2_MATCH_Pos)                  /*!< TIMER0 MR2: MATCH Mask                  */

/* ---------------------------------  TIMER0_MR3  --------------------------------- */
#define TIMER0_MR3_MATCH_Pos                  0                                                       /*!< TIMER0 MR3: MATCH Position              */
#define TIMER0_MR3_MATCH_Msk                  (0xffffffffUL << TIMER0_MR3_MATCH_Pos)                  /*!< TIMER0 MR3: MATCH Mask                  */

/* ---------------------------------  TIMER0_CCR  --------------------------------- */
#define TIMER0_CCR_CAP0RE_Pos                 0                                                       /*!< TIMER0 CCR: CAP0RE Position             */
#define TIMER0_CCR_CAP0RE_Msk                 (0x01UL << TIMER0_CCR_CAP0RE_Pos)                       /*!< TIMER0 CCR: CAP0RE Mask                 */
#define TIMER0_CCR_CAP0FE_Pos                 1                                                       /*!< TIMER0 CCR: CAP0FE Position             */
#define TIMER0_CCR_CAP0FE_Msk                 (0x01UL << TIMER0_CCR_CAP0FE_Pos)                       /*!< TIMER0 CCR: CAP0FE Mask                 */
#define TIMER0_CCR_CAP0I_Pos                  2                                                       /*!< TIMER0 CCR: CAP0I Position              */
#define TIMER0_CCR_CAP0I_Msk                  (0x01UL << TIMER0_CCR_CAP0I_Pos)                        /*!< TIMER0 CCR: CAP0I Mask                  */
#define TIMER0_CCR_CAP1RE_Pos                 3                                                       /*!< TIMER0 CCR: CAP1RE Position             */
#define TIMER0_CCR_CAP1RE_Msk                 (0x01UL << TIMER0_CCR_CAP1RE_Pos)                       /*!< TIMER0 CCR: CAP1RE Mask                 */
#define TIMER0_CCR_CAP1FE_Pos                 4                                                       /*!< TIMER0 CCR: CAP1FE Position             */
#define TIMER0_CCR_CAP1FE_Msk                 (0x01UL << TIMER0_CCR_CAP1FE_Pos)                       /*!< TIMER0 CCR: CAP1FE Mask                 */
#define TIMER0_CCR_CAP1I_Pos                  5                                                       /*!< TIMER0 CCR: CAP1I Position              */
#define TIMER0_CCR_CAP1I_Msk                  (0x01UL << TIMER0_CCR_CAP1I_Pos)                        /*!< TIMER0 CCR: CAP1I Mask                  */
#define TIMER0_CCR_CAP2RE_Pos                 6                                                       /*!< TIMER0 CCR: CAP2RE Position             */
#define TIMER0_CCR_CAP2RE_Msk                 (0x01UL << TIMER0_CCR_CAP2RE_Pos)                       /*!< TIMER0 CCR: CAP2RE Mask                 */
#define TIMER0_CCR_CAP2FE_Pos                 7                                                       /*!< TIMER0 CCR: CAP2FE Position             */
#define TIMER0_CCR_CAP2FE_Msk                 (0x01UL << TIMER0_CCR_CAP2FE_Pos)                       /*!< TIMER0 CCR: CAP2FE Mask                 */
#define TIMER0_CCR_CAP2I_Pos                  8                                                       /*!< TIMER0 CCR: CAP2I Position              */
#define TIMER0_CCR_CAP2I_Msk                  (0x01UL << TIMER0_CCR_CAP2I_Pos)                        /*!< TIMER0 CCR: CAP2I Mask                  */
#define TIMER0_CCR_CAP3RE_Pos                 9                                                       /*!< TIMER0 CCR: CAP3RE Position             */
#define TIMER0_CCR_CAP3RE_Msk                 (0x01UL << TIMER0_CCR_CAP3RE_Pos)                       /*!< TIMER0 CCR: CAP3RE Mask                 */
#define TIMER0_CCR_CAP3FE_Pos                 10                                                      /*!< TIMER0 CCR: CAP3FE Position             */
#define TIMER0_CCR_CAP3FE_Msk                 (0x01UL << TIMER0_CCR_CAP3FE_Pos)                       /*!< TIMER0 CCR: CAP3FE Mask                 */
#define TIMER0_CCR_CAP3I_Pos                  11                                                      /*!< TIMER0 CCR: CAP3I Position              */
#define TIMER0_CCR_CAP3I_Msk                  (0x01UL << TIMER0_CCR_CAP3I_Pos)                        /*!< TIMER0 CCR: CAP3I Mask                  */

