roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  TIMER2_MR3  --------------------------------- */
#define TIMER2_MR3_MATCH_Pos                  0                                                       /*!< TIMER2 MR3: MATCH Position              */
#define TIMER2_MR3_MATCH_Msk                  (0xffffffffUL << TIMER2_MR3_MATCH_Pos)                  /*!< TIMER2 MR3: MATCH Mask                  */

/* ---------------------------------  TIMER2_CCR  --------------------------------- */
#define TIMER2_CCR_CAP0RE_Pos                 0                                                       /*!< TIMER2 CCR: CAP0RE Position             */
#define TIMER2_CCR_CAP0RE_Msk                 (0x01UL << TIMER2_CCR_CAP0RE_Pos)                       /*!< TIMER2 CCR: CAP0RE Mask                 */
#define TIMER2_CCR_CAP0FE_Pos                 1                                                       /*!< TIMER2 CCR: CAP0FE Position             */
#define TIMER2_CCR_CAP0FE_Msk                 (0x01UL << TIMER2_CCR_CAP0FE_Pos)                       /*!< TIMER2 CCR: CAP0FE Mask                 */
#define TIMER2_CCR_CAP0I_Pos                  2                                                       /*!< TIMER2 CCR: CAP0I Position              */
#define TIMER2_CCR_CAP0I_Msk                  (0x01UL << TIMER2_CCR_CAP0I_Pos)                        /*!< TIMER2 CCR: CAP0I Mask                  */
#define TIMER2_CCR_CAP1RE_Pos                 3                                                       /*!< TIMER2 CCR: CAP1RE Position             */
#define TIMER2_CCR_CAP1RE_Msk                 (0x01UL << TIMER2_CCR_CAP1RE_Pos)                       /*!< TIMER2 CCR: CAP1RE Mask                 */
#define TIMER2_CCR_CAP1FE_Pos                 4                                                       /*!< TIMER2 CCR: CAP1FE Position             */
#define TIMER2_CCR_CAP1FE_Msk                 (0x01UL << TIMER2_CCR_CAP1FE_Pos)                       /*!< TIMER2 CCR: CAP1FE Mask                 */
#define TIMER2_CCR_CAP1I_Pos                  5                                                       /*!< TIMER2 CCR: CAP1I Position              */
#define TIMER2_CCR_CAP1I_Msk                  (0x01UL << TIMER2_CCR_CAP1I_Pos)                        /*!< TIMER2 CCR: CAP1I Mask                  */
#define TIMER2_CCR_CAP2RE_Pos                 6                                                       /*!< TIMER2 CCR: CAP2RE Position             */
#define TIMER2_CCR_CAP2RE_Msk                 (0x01UL << TIMER2_CCR_CAP2RE_Pos)                       /*!< TIMER2 CCR: CAP2RE Mask                 */
#define TIMER2_CCR_CAP2FE_Pos                 7                                                       /*!< TIMER2 CCR: CAP2FE Position             */
#define TIMER2_CCR_CAP2FE_Msk                 (0x01UL << TIMER2_CCR_CAP2FE_Pos)                       /*!< TIMER2 CCR: CAP2FE Mask                 */
#define TIMER2_CCR_CAP2I_Pos                  8                                                       /*!< TIMER2 CCR: CAP2I Position              */
#define TIMER2_CCR_CAP2I_Msk                  (0x01UL << TIMER2_CCR_CAP2I_Pos)                        /*!< TIMER2 CCR: CAP2I Mask                  */
#define TIMER2_CCR_CAP3RE_Pos                 9                                                       /*!< TIMER2 CCR: CAP3RE Position             */
#define TIMER2_CCR_CAP3RE_Msk                 (0x01UL << TIMER2_CCR_CAP3RE_Pos)                       /*!< TIMER2 CCR: CAP3RE Mask                 */
#define TIMER2_CCR_CAP3FE_Pos                 10                                                      /*!< TIMER2 CCR: CAP3FE Position             */
#define TIMER2_CCR_CAP3FE_Msk                 (0x01UL << TIMER2_CCR_CAP3FE_Pos)                       /*!< TIMER2 CCR: CAP3FE Mask                 */
#define TIMER2_CCR_CAP3I_Pos                  11                                                      /*!< TIMER2 CCR: CAP3I Position              */
#define TIMER2_CCR_CAP3I_Msk                  (0x01UL << TIMER2_CCR_CAP3I_Pos)                        /*!< TIMER2 CCR: CAP3I Mask                  */

/* ---------------------------------  TIMER2_CR0  --------------------------------- */
#define TIMER2_CR0_CAP_Pos                    0                                                       /*!< TIMER2 CR0: CAP Position                */
#define TIMER2_CR0_CAP_Msk                    (0xffffffffUL << TIMER2_CR0_CAP_Pos)                    /*!< TIMER2 CR0: CAP Mask                    */

/* ---------------------------------  TIMER2_CR1  --------------------------------- */
#define TIMER2_CR1_CAP_Pos                    0                                                       /*!< TIMER2 CR1: CAP Position                */
#define TIMER2_CR1_CAP_Msk                    (0xffffffffUL << TIMER2_CR1_CAP_Pos)                    /*!< TIMER2 CR1: CAP Mask                    */

/* ---------------------------------  TIMER2_CR2  --------------------------------- */
#define TIMER2_CR2_CAP_Pos                    0                                                       /*!< TIMER2 CR2: CAP Position                */
#define TIMER2_CR2_CAP_Msk                    (0xffffffffUL << TIMER2_CR2_CAP_Pos)                    /*!< TIMER2 CR2: CAP Mask                    */

/* ---------------------------------  TIMER2_CR3  --------------------------------- */
#define TIMER2_CR3_CAP_Pos                    0                                                       /*!< TIMER2 CR3: CAP Position                */
#define TIMER2_CR3_CAP_Msk                    (0xffffffffUL << TIMER2_CR3_CAP_Pos)                    /*!< TIMER2 CR3: CAP Mask                    */

/* ---------------------------------  TIMER2_EMR  --------------------------------- */
#define TIMER2_EMR_EM0_Pos                    0                                                       /*!< TIMER2 EMR: EM0 Position                */
#define TIMER2_EMR_EM0_Msk                    (0x01UL << TIMER2_EMR_EM0_Pos)                          /*!< TIMER2 EMR: EM0 Mask                    */
#define TIMER2_EMR_EM1_Pos                    1                                                       /*!< TIMER2 EMR: EM1 Position                */
#define TIMER2_EMR_EM1_Msk                    (0x01UL << TIMER2_EMR_EM1_Pos)                          /*!< TIMER2 EMR: EM1 Mask                    */
#define TIMER2_EMR_EM2_Pos                    2                                                       /*!< TIMER2 EMR: EM2 Position                */
#define TIMER2_EMR_EM2_Msk                    (0x01UL << TIMER2_EMR_EM2_Pos)                          /*!< TIMER2 EMR: EM2 Mask                    */
#define TIMER2_EMR_EM3_Pos                    3                                                       /*!< TIMER2 EMR: EM3 Position                */
#define TIMER2_EMR_EM3_Msk                    (0x01UL << TIMER2_EMR_EM3_Pos)                          /*!< TIMER2 EMR: EM3 Mask                    */
#define TIMER2_EMR_EMC0_Pos                   4                                                       /*!< TIMER2 EMR: EMC0 Position               */
#define TIMER2_EMR_EMC0_Msk                   (0x03UL << TIMER2_EMR_EMC0_Pos)                         /*!< TIMER2 EMR: EMC0 Mask                   */
#define TIMER2_EMR_EMC1_Pos                   6                                                       /*!< TIMER2 EMR: EMC1 Position               */
#define TIMER2_EMR_EMC1_Msk                   (0x03UL << TIMER2_EMR_EMC1_Pos)                         /*!< TIMER2 EMR: EMC1 Mask                   */
#define TIMER2_EMR_EMC2_Pos                   8                                                       /*!< TIMER2 EMR: EMC2 Position               */
#define TIMER2_EMR_EMC2_Msk                   (0x03UL << TIMER2_EMR_EMC2_Pos)                         /*!< TIMER2 EMR: EMC2 Mask                   */
#define TIMER2_EMR_EMC3_Pos                   10                                                      /*!< TIMER2 EMR: EMC3 Position               */
#define TIMER2_EMR_EMC3_Msk                   (0x03UL << TIMER2_EMR_EMC3_Pos)                         /*!< TIMER2 EMR: EMC3 Mask                   */

/* ---------------------------------  TIMER2_CTCR  -------------------------------- */
#define TIMER2_CTCR_CTMODE_Pos                0                                                       /*!< TIMER2 CTCR: CTMODE Position            */
#define TIMER2_CTCR_CTMODE_Msk                (0x03UL << TIMER2_CTCR_CTMODE_Pos)                      /*!< TIMER2 CTCR: CTMODE Mask                */
#define TIMER2_CTCR_CINSEL_Pos                2                                                       /*!< TIMER2 CTCR: CINSEL Position            */
#define TIMER2_CTCR_CINSEL_Msk                (0x03UL << TIMER2_CTCR_CINSEL_Pos)                      /*!< TIMER2 CTCR: CINSEL Mask                */


/* ================================================================================ */
/* ================         struct 'TIMER3' Position & Mask        ================ */
/* ================================================================================ */


/* ----------------------------------  TIMER3_IR  --------------------------------- */
#define TIMER3_IR_MR0INT_Pos                  0                                                       /*!< TIMER3 IR: MR0INT Position              */
#define TIMER3_IR_MR0INT_Msk                  (0x01UL << TIMER3_IR_MR0INT_Pos)                        /*!< TIMER3 IR: MR0INT Mask                  */
#define TIMER3_IR_MR1INT_Pos                  1                                                       /*!< TIMER3 IR: MR1INT Position              */
#define TIMER3_IR_MR1INT_Msk                  (0x01UL << TIMER3_IR_MR1INT_Pos)                        /*!< TIMER3 IR: MR1INT Mask                  */
#define TIMER3_IR_MR2INT_Pos                  2                                                       /*!< TIMER3 IR: MR2INT Position              */
#define TIMER3_IR_MR2INT_Msk                  (0x01UL << TIMER3_IR_MR2INT_Pos)                        /*!< TIMER3 IR: MR2INT Mask                  */
#define TIMER3_IR_MR3INT_Pos                  3                                                       /*!< TIMER3 IR: MR3INT Position              */
#define TIMER3_IR_MR3INT_Msk                  (0x01UL << TIMER3_IR_MR3INT_Pos)                        /*!< TIMER3 IR: MR3INT Mask                  */
#define TIMER3_IR_CR0INT_Pos                  4                                                       /*!< TIMER3 IR: CR0INT Position              */
#define TIMER3_IR_CR0INT_Msk                  (0x01UL << TIMER3_IR_CR0INT_Pos)                        /*!< TIMER3 IR: CR0INT Mask                  */
#define TIMER3_IR_CR1INT_Pos                  5                                                       /*!< TIMER3 IR: CR1INT Position              */
#define TIMER3_IR_CR1INT_Msk                  (0x01UL << TIMER3_IR_CR1INT_Pos)                        /*!< TIMER3 IR: CR1INT Mask                  */
#define TIMER3_IR_CR2INT_Pos                  6                                                       /*!< TIMER3 IR: CR2INT Position              */
#define TIMER3_IR_CR2INT_Msk                  (0x01UL << TIMER3_IR_CR2INT_Pos)                        /*!< TIMER3 IR: CR2INT Mask                  */
#define TIMER3_IR_CR3INT_Pos                  7                                                       /*!< TIMER3 IR: CR3INT Position              */
#define TIMER3_IR_CR3INT_Msk                  (0x01UL << TIMER3_IR_CR3INT_Pos)                        /*!< TIMER3 IR: CR3INT Mask                  */

/* ---------------------------------  TIMER3_TCR  --------------------------------- */
#define TIMER3_TCR_CEN_Pos                    0                                                       /*!< TIMER3 TCR: CEN Position                */
#define TIMER3_TCR_CEN_Msk                    (0x01UL << TIMER3_TCR_CEN_Pos)                          /*!< TIMER3 TCR: CEN Mask                    */
#define TIMER3_TCR_CRST_Pos                   1                                                       /*!< TIMER3 TCR: CRST Position               */
#define TIMER3_TCR_CRST_Msk                   (0x01UL << TIMER3_TCR_CRST_Pos)                         /*!< TIMER3 TCR: CRST Mask                   */

