roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSP1_1  -------------------------------- */
#define SCU_SFSP1_1_MODE_Pos                  0                                                       /*!< SCU SFSP1_1: MODE Position              */
#define SCU_SFSP1_1_MODE_Msk                  (0x07UL << SCU_SFSP1_1_MODE_Pos)                        /*!< SCU SFSP1_1: MODE Mask                  */
#define SCU_SFSP1_1_EPD_Pos                   3                                                       /*!< SCU SFSP1_1: EPD Position               */
#define SCU_SFSP1_1_EPD_Msk                   (0x01UL << SCU_SFSP1_1_EPD_Pos)                         /*!< SCU SFSP1_1: EPD Mask                   */
#define SCU_SFSP1_1_EPUN_Pos                  4                                                       /*!< SCU SFSP1_1: EPUN Position              */
#define SCU_SFSP1_1_EPUN_Msk                  (0x01UL << SCU_SFSP1_1_EPUN_Pos)                        /*!< SCU SFSP1_1: EPUN Mask                  */
#define SCU_SFSP1_1_EHS_Pos                   5                                                       /*!< SCU SFSP1_1: EHS Position               */
#define SCU_SFSP1_1_EHS_Msk                   (0x01UL << SCU_SFSP1_1_EHS_Pos)                         /*!< SCU SFSP1_1: EHS Mask                   */
#define SCU_SFSP1_1_EZI_Pos                   6                                                       /*!< SCU SFSP1_1: EZI Position               */
#define SCU_SFSP1_1_EZI_Msk                   (0x01UL << SCU_SFSP1_1_EZI_Pos)                         /*!< SCU SFSP1_1: EZI Mask                   */
#define SCU_SFSP1_1_ZIF_Pos                   7                                                       /*!< SCU SFSP1_1: ZIF Position               */
#define SCU_SFSP1_1_ZIF_Msk                   (0x01UL << SCU_SFSP1_1_ZIF_Pos)                         /*!< SCU SFSP1_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_2  -------------------------------- */
#define SCU_SFSP1_2_MODE_Pos                  0                                                       /*!< SCU SFSP1_2: MODE Position              */
#define SCU_SFSP1_2_MODE_Msk                  (0x07UL << SCU_SFSP1_2_MODE_Pos)                        /*!< SCU SFSP1_2: MODE Mask                  */
#define SCU_SFSP1_2_EPD_Pos                   3                                                       /*!< SCU SFSP1_2: EPD Position               */
#define SCU_SFSP1_2_EPD_Msk                   (0x01UL << SCU_SFSP1_2_EPD_Pos)                         /*!< SCU SFSP1_2: EPD Mask                   */
#define SCU_SFSP1_2_EPUN_Pos                  4                                                       /*!< SCU SFSP1_2: EPUN Position              */
#define SCU_SFSP1_2_EPUN_Msk                  (0x01UL << SCU_SFSP1_2_EPUN_Pos)                        /*!< SCU SFSP1_2: EPUN Mask                  */
#define SCU_SFSP1_2_EHS_Pos                   5                                                       /*!< SCU SFSP1_2: EHS Position               */
#define SCU_SFSP1_2_EHS_Msk                   (0x01UL << SCU_SFSP1_2_EHS_Pos)                         /*!< SCU SFSP1_2: EHS Mask                   */
#define SCU_SFSP1_2_EZI_Pos                   6                                                       /*!< SCU SFSP1_2: EZI Position               */
#define SCU_SFSP1_2_EZI_Msk                   (0x01UL << SCU_SFSP1_2_EZI_Pos)                         /*!< SCU SFSP1_2: EZI Mask                   */
#define SCU_SFSP1_2_ZIF_Pos                   7                                                       /*!< SCU SFSP1_2: ZIF Position               */
#define SCU_SFSP1_2_ZIF_Msk                   (0x01UL << SCU_SFSP1_2_ZIF_Pos)                         /*!< SCU SFSP1_2: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_3  -------------------------------- */
#define SCU_SFSP1_3_MODE_Pos                  0                                                       /*!< SCU SFSP1_3: MODE Position              */
#define SCU_SFSP1_3_MODE_Msk                  (0x07UL << SCU_SFSP1_3_MODE_Pos)                        /*!< SCU SFSP1_3: MODE Mask                  */
#define SCU_SFSP1_3_EPD_Pos                   3                                                       /*!< SCU SFSP1_3: EPD Position               */
#define SCU_SFSP1_3_EPD_Msk                   (0x01UL << SCU_SFSP1_3_EPD_Pos)                         /*!< SCU SFSP1_3: EPD Mask                   */
#define SCU_SFSP1_3_EPUN_Pos                  4                                                       /*!< SCU SFSP1_3: EPUN Position              */
#define SCU_SFSP1_3_EPUN_Msk                  (0x01UL << SCU_SFSP1_3_EPUN_Pos)                        /*!< SCU SFSP1_3: EPUN Mask                  */
#define SCU_SFSP1_3_EHS_Pos                   5                                                       /*!< SCU SFSP1_3: EHS Position               */
#define SCU_SFSP1_3_EHS_Msk                   (0x01UL << SCU_SFSP1_3_EHS_Pos)                         /*!< SCU SFSP1_3: EHS Mask                   */
#define SCU_SFSP1_3_EZI_Pos                   6                                                       /*!< SCU SFSP1_3: EZI Position               */
#define SCU_SFSP1_3_EZI_Msk                   (0x01UL << SCU_SFSP1_3_EZI_Pos)                         /*!< SCU SFSP1_3: EZI Mask                   */
#define SCU_SFSP1_3_ZIF_Pos                   7                                                       /*!< SCU SFSP1_3: ZIF Position               */
#define SCU_SFSP1_3_ZIF_Msk                   (0x01UL << SCU_SFSP1_3_ZIF_Pos)                         /*!< SCU SFSP1_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_4  -------------------------------- */
#define SCU_SFSP1_4_MODE_Pos                  0                                                       /*!< SCU SFSP1_4: MODE Position              */
#define SCU_SFSP1_4_MODE_Msk                  (0x07UL << SCU_SFSP1_4_MODE_Pos)                        /*!< SCU SFSP1_4: MODE Mask                  */
#define SCU_SFSP1_4_EPD_Pos                   3                                                       /*!< SCU SFSP1_4: EPD Position               */
#define SCU_SFSP1_4_EPD_Msk                   (0x01UL << SCU_SFSP1_4_EPD_Pos)                         /*!< SCU SFSP1_4: EPD Mask                   */
#define SCU_SFSP1_4_EPUN_Pos                  4                                                       /*!< SCU SFSP1_4: EPUN Position              */
#define SCU_SFSP1_4_EPUN_Msk                  (0x01UL << SCU_SFSP1_4_EPUN_Pos)                        /*!< SCU SFSP1_4: EPUN Mask                  */
#define SCU_SFSP1_4_EHS_Pos                   5                                                       /*!< SCU SFSP1_4: EHS Position               */
#define SCU_SFSP1_4_EHS_Msk                   (0x01UL << SCU_SFSP1_4_EHS_Pos)                         /*!< SCU SFSP1_4: EHS Mask                   */
#define SCU_SFSP1_4_EZI_Pos                   6                                                       /*!< SCU SFSP1_4: EZI Position               */
#define SCU_SFSP1_4_EZI_Msk                   (0x01UL << SCU_SFSP1_4_EZI_Pos)                         /*!< SCU SFSP1_4: EZI Mask                   */
#define SCU_SFSP1_4_ZIF_Pos                   7                                                       /*!< SCU SFSP1_4: ZIF Position               */
#define SCU_SFSP1_4_ZIF_Msk                   (0x01UL << SCU_SFSP1_4_ZIF_Pos)                         /*!< SCU SFSP1_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP1_5  -------------------------------- */
#define SCU_SFSP1_5_MODE_Pos                  0                                                       /*!< SCU SFSP1_5: MODE Position              */
#define SCU_SFSP1_5_MODE_Msk                  (0x07UL << SCU_SFSP1_5_MODE_Pos)                        /*!< SCU SFSP1_5: MODE Mask                  */
#define SCU_SFSP1_5_EPD_Pos                   3                                                       /*!< SCU SFSP1_5: EPD Position               */
#define SCU_SFSP1_5_EPD_Msk                   (0x01UL << SCU_SFSP1_5_EPD_Pos)                         /*!< SCU SFSP1_5: EPD Mask                   */
#define SCU_SFSP1_5_EPUN_Pos                  4                                                       /*!< SCU SFSP1_5: EPUN Position              */
#define SCU_SFSP1_5_EPUN_Msk                  (0x01UL << SCU_SFSP1_5_EPUN_Pos)                        /*!< SCU SFSP1_5: EPUN Mask                  */
#define SCU_SFSP1_5_EHS_Pos                   5                                                       /*!< SCU SFSP1_5: EHS Position               */
#define SCU_SFSP1_5_EHS_Msk                   (0x01UL << SCU_SFSP1_5_EHS_Pos)                         /*!< SCU SFSP1_5: EHS Mask                   */
#define SCU_SFSP1_5_EZI_Pos                   6                                                       /*!< SCU SFSP1_5: EZI Position               */
#define SCU_SFSP1_5_EZI_Msk                   (0x01UL << SCU_SFSP1_5_EZI_Pos)                         /*!< SCU SFSP1_5: EZI Mask                   */
#define SCU_SFSP1_5_ZIF_Pos                   7                                                       /*!< SCU SFSP1_5: ZIF Position               */
#define SCU_SFSP1_5_ZIF_Msk                   (0x01UL << SCU_SFSP1_5_ZIF_Pos)                         /*!< SCU SFSP1_5: ZIF Mask                   */

