roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCU_SFSP1_12  -------------------------------- */
#define SCU_SFSP1_12_MODE_Pos                 0                                                       /*!< SCU SFSP1_12: MODE Position             */
#define SCU_SFSP1_12_MODE_Msk                 (0x07UL << SCU_SFSP1_12_MODE_Pos)                       /*!< SCU SFSP1_12: MODE Mask                 */
#define SCU_SFSP1_12_EPD_Pos                  3                                                       /*!< SCU SFSP1_12: EPD Position              */
#define SCU_SFSP1_12_EPD_Msk                  (0x01UL << SCU_SFSP1_12_EPD_Pos)                        /*!< SCU SFSP1_12: EPD Mask                  */
#define SCU_SFSP1_12_EPUN_Pos                 4                                                       /*!< SCU SFSP1_12: EPUN Position             */
#define SCU_SFSP1_12_EPUN_Msk                 (0x01UL << SCU_SFSP1_12_EPUN_Pos)                       /*!< SCU SFSP1_12: EPUN Mask                 */
#define SCU_SFSP1_12_EHS_Pos                  5                                                       /*!< SCU SFSP1_12: EHS Position              */
#define SCU_SFSP1_12_EHS_Msk                  (0x01UL << SCU_SFSP1_12_EHS_Pos)                        /*!< SCU SFSP1_12: EHS Mask                  */
#define SCU_SFSP1_12_EZI_Pos                  6                                                       /*!< SCU SFSP1_12: EZI Position              */
#define SCU_SFSP1_12_EZI_Msk                  (0x01UL << SCU_SFSP1_12_EZI_Pos)                        /*!< SCU SFSP1_12: EZI Mask                  */
#define SCU_SFSP1_12_ZIF_Pos                  7                                                       /*!< SCU SFSP1_12: ZIF Position              */
#define SCU_SFSP1_12_ZIF_Msk                  (0x01UL << SCU_SFSP1_12_ZIF_Pos)                        /*!< SCU SFSP1_12: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_13  -------------------------------- */
#define SCU_SFSP1_13_MODE_Pos                 0                                                       /*!< SCU SFSP1_13: MODE Position             */
#define SCU_SFSP1_13_MODE_Msk                 (0x07UL << SCU_SFSP1_13_MODE_Pos)                       /*!< SCU SFSP1_13: MODE Mask                 */
#define SCU_SFSP1_13_EPD_Pos                  3                                                       /*!< SCU SFSP1_13: EPD Position              */
#define SCU_SFSP1_13_EPD_Msk                  (0x01UL << SCU_SFSP1_13_EPD_Pos)                        /*!< SCU SFSP1_13: EPD Mask                  */
#define SCU_SFSP1_13_EPUN_Pos                 4                                                       /*!< SCU SFSP1_13: EPUN Position             */
#define SCU_SFSP1_13_EPUN_Msk                 (0x01UL << SCU_SFSP1_13_EPUN_Pos)                       /*!< SCU SFSP1_13: EPUN Mask                 */
#define SCU_SFSP1_13_EHS_Pos                  5                                                       /*!< SCU SFSP1_13: EHS Position              */
#define SCU_SFSP1_13_EHS_Msk                  (0x01UL << SCU_SFSP1_13_EHS_Pos)                        /*!< SCU SFSP1_13: EHS Mask                  */
#define SCU_SFSP1_13_EZI_Pos                  6                                                       /*!< SCU SFSP1_13: EZI Position              */
#define SCU_SFSP1_13_EZI_Msk                  (0x01UL << SCU_SFSP1_13_EZI_Pos)                        /*!< SCU SFSP1_13: EZI Mask                  */
#define SCU_SFSP1_13_ZIF_Pos                  7                                                       /*!< SCU SFSP1_13: ZIF Position              */
#define SCU_SFSP1_13_ZIF_Msk                  (0x01UL << SCU_SFSP1_13_ZIF_Pos)                        /*!< SCU SFSP1_13: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_14  -------------------------------- */
#define SCU_SFSP1_14_MODE_Pos                 0                                                       /*!< SCU SFSP1_14: MODE Position             */
#define SCU_SFSP1_14_MODE_Msk                 (0x07UL << SCU_SFSP1_14_MODE_Pos)                       /*!< SCU SFSP1_14: MODE Mask                 */
#define SCU_SFSP1_14_EPD_Pos                  3                                                       /*!< SCU SFSP1_14: EPD Position              */
#define SCU_SFSP1_14_EPD_Msk                  (0x01UL << SCU_SFSP1_14_EPD_Pos)                        /*!< SCU SFSP1_14: EPD Mask                  */
#define SCU_SFSP1_14_EPUN_Pos                 4                                                       /*!< SCU SFSP1_14: EPUN Position             */
#define SCU_SFSP1_14_EPUN_Msk                 (0x01UL << SCU_SFSP1_14_EPUN_Pos)                       /*!< SCU SFSP1_14: EPUN Mask                 */
#define SCU_SFSP1_14_EHS_Pos                  5                                                       /*!< SCU SFSP1_14: EHS Position              */
#define SCU_SFSP1_14_EHS_Msk                  (0x01UL << SCU_SFSP1_14_EHS_Pos)                        /*!< SCU SFSP1_14: EHS Mask                  */
#define SCU_SFSP1_14_EZI_Pos                  6                                                       /*!< SCU SFSP1_14: EZI Position              */
#define SCU_SFSP1_14_EZI_Msk                  (0x01UL << SCU_SFSP1_14_EZI_Pos)                        /*!< SCU SFSP1_14: EZI Mask                  */
#define SCU_SFSP1_14_ZIF_Pos                  7                                                       /*!< SCU SFSP1_14: ZIF Position              */
#define SCU_SFSP1_14_ZIF_Msk                  (0x01UL << SCU_SFSP1_14_ZIF_Pos)                        /*!< SCU SFSP1_14: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_15  -------------------------------- */
#define SCU_SFSP1_15_MODE_Pos                 0                                                       /*!< SCU SFSP1_15: MODE Position             */
#define SCU_SFSP1_15_MODE_Msk                 (0x07UL << SCU_SFSP1_15_MODE_Pos)                       /*!< SCU SFSP1_15: MODE Mask                 */
#define SCU_SFSP1_15_EPD_Pos                  3                                                       /*!< SCU SFSP1_15: EPD Position              */
#define SCU_SFSP1_15_EPD_Msk                  (0x01UL << SCU_SFSP1_15_EPD_Pos)                        /*!< SCU SFSP1_15: EPD Mask                  */
#define SCU_SFSP1_15_EPUN_Pos                 4                                                       /*!< SCU SFSP1_15: EPUN Position             */
#define SCU_SFSP1_15_EPUN_Msk                 (0x01UL << SCU_SFSP1_15_EPUN_Pos)                       /*!< SCU SFSP1_15: EPUN Mask                 */
#define SCU_SFSP1_15_EHS_Pos                  5                                                       /*!< SCU SFSP1_15: EHS Position              */
#define SCU_SFSP1_15_EHS_Msk                  (0x01UL << SCU_SFSP1_15_EHS_Pos)                        /*!< SCU SFSP1_15: EHS Mask                  */
#define SCU_SFSP1_15_EZI_Pos                  6                                                       /*!< SCU SFSP1_15: EZI Position              */
#define SCU_SFSP1_15_EZI_Msk                  (0x01UL << SCU_SFSP1_15_EZI_Pos)                        /*!< SCU SFSP1_15: EZI Mask                  */
#define SCU_SFSP1_15_ZIF_Pos                  7                                                       /*!< SCU SFSP1_15: ZIF Position              */
#define SCU_SFSP1_15_ZIF_Msk                  (0x01UL << SCU_SFSP1_15_ZIF_Pos)                        /*!< SCU SFSP1_15: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_16  -------------------------------- */
#define SCU_SFSP1_16_MODE_Pos                 0                                                       /*!< SCU SFSP1_16: MODE Position             */
#define SCU_SFSP1_16_MODE_Msk                 (0x07UL << SCU_SFSP1_16_MODE_Pos)                       /*!< SCU SFSP1_16: MODE Mask                 */
#define SCU_SFSP1_16_EPD_Pos                  3                                                       /*!< SCU SFSP1_16: EPD Position              */
#define SCU_SFSP1_16_EPD_Msk                  (0x01UL << SCU_SFSP1_16_EPD_Pos)                        /*!< SCU SFSP1_16: EPD Mask                  */
#define SCU_SFSP1_16_EPUN_Pos                 4                                                       /*!< SCU SFSP1_16: EPUN Position             */
#define SCU_SFSP1_16_EPUN_Msk                 (0x01UL << SCU_SFSP1_16_EPUN_Pos)                       /*!< SCU SFSP1_16: EPUN Mask                 */
#define SCU_SFSP1_16_EHS_Pos                  5                                                       /*!< SCU SFSP1_16: EHS Position              */
#define SCU_SFSP1_16_EHS_Msk                  (0x01UL << SCU_SFSP1_16_EHS_Pos)                        /*!< SCU SFSP1_16: EHS Mask                  */
#define SCU_SFSP1_16_EZI_Pos                  6                                                       /*!< SCU SFSP1_16: EZI Position              */
#define SCU_SFSP1_16_EZI_Msk                  (0x01UL << SCU_SFSP1_16_EZI_Pos)                        /*!< SCU SFSP1_16: EZI Mask                  */
#define SCU_SFSP1_16_ZIF_Pos                  7                                                       /*!< SCU SFSP1_16: ZIF Position              */
#define SCU_SFSP1_16_ZIF_Msk                  (0x01UL << SCU_SFSP1_16_ZIF_Pos)                        /*!< SCU SFSP1_16: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_17  -------------------------------- */
#define SCU_SFSP1_17_MODE_Pos                 0                                                       /*!< SCU SFSP1_17: MODE Position             */
#define SCU_SFSP1_17_MODE_Msk                 (0x07UL << SCU_SFSP1_17_MODE_Pos)                       /*!< SCU SFSP1_17: MODE Mask                 */
#define SCU_SFSP1_17_EPD_Pos                  3                                                       /*!< SCU SFSP1_17: EPD Position              */
#define SCU_SFSP1_17_EPD_Msk                  (0x01UL << SCU_SFSP1_17_EPD_Pos)                        /*!< SCU SFSP1_17: EPD Mask                  */
#define SCU_SFSP1_17_EPUN_Pos                 4                                                       /*!< SCU SFSP1_17: EPUN Position             */
#define SCU_SFSP1_17_EPUN_Msk                 (0x01UL << SCU_SFSP1_17_EPUN_Pos)                       /*!< SCU SFSP1_17: EPUN Mask                 */
#define SCU_SFSP1_17_EZI_Pos                  6                                                       /*!< SCU SFSP1_17: EZI Position              */
#define SCU_SFSP1_17_EZI_Msk                  (0x01UL << SCU_SFSP1_17_EZI_Pos)                        /*!< SCU SFSP1_17: EZI Mask                  */
#define SCU_SFSP1_17_ZIF_Pos                  7                                                       /*!< SCU SFSP1_17: ZIF Position              */
#define SCU_SFSP1_17_ZIF_Msk                  (0x01UL << SCU_SFSP1_17_ZIF_Pos)                        /*!< SCU SFSP1_17: ZIF Mask                  */
#define SCU_SFSP1_17_EHD_Pos                  8                                                       /*!< SCU SFSP1_17: EHD Position              */
#define SCU_SFSP1_17_EHD_Msk                  (0x03UL << SCU_SFSP1_17_EHD_Pos)                        /*!< SCU SFSP1_17: EHD Mask                  */

/* --------------------------------  SCU_SFSP1_18  -------------------------------- */
#define SCU_SFSP1_18_MODE_Pos                 0                                                       /*!< SCU SFSP1_18: MODE Position             */
#define SCU_SFSP1_18_MODE_Msk                 (0x07UL << SCU_SFSP1_18_MODE_Pos)                       /*!< SCU SFSP1_18: MODE Mask                 */
#define SCU_SFSP1_18_EPD_Pos                  3                                                       /*!< SCU SFSP1_18: EPD Position              */
#define SCU_SFSP1_18_EPD_Msk                  (0x01UL << SCU_SFSP1_18_EPD_Pos)                        /*!< SCU SFSP1_18: EPD Mask                  */
#define SCU_SFSP1_18_EPUN_Pos                 4                                                       /*!< SCU SFSP1_18: EPUN Position             */
#define SCU_SFSP1_18_EPUN_Msk                 (0x01UL << SCU_SFSP1_18_EPUN_Pos)                       /*!< SCU SFSP1_18: EPUN Mask                 */
#define SCU_SFSP1_18_EHS_Pos                  5                                                       /*!< SCU SFSP1_18: EHS Position              */
#define SCU_SFSP1_18_EHS_Msk                  (0x01UL << SCU_SFSP1_18_EHS_Pos)                        /*!< SCU SFSP1_18: EHS Mask                  */
#define SCU_SFSP1_18_EZI_Pos                  6                                                       /*!< SCU SFSP1_18: EZI Position              */
#define SCU_SFSP1_18_EZI_Msk                  (0x01UL << SCU_SFSP1_18_EZI_Pos)                        /*!< SCU SFSP1_18: EZI Mask                  */
#define SCU_SFSP1_18_ZIF_Pos                  7                                                       /*!< SCU SFSP1_18: ZIF Position              */
#define SCU_SFSP1_18_ZIF_Msk                  (0x01UL << SCU_SFSP1_18_ZIF_Pos)                        /*!< SCU SFSP1_18: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_19  -------------------------------- */
#define SCU_SFSP1_19_MODE_Pos                 0                                                       /*!< SCU SFSP1_19: MODE Position             */
#define SCU_SFSP1_19_MODE_Msk                 (0x07UL << SCU_SFSP1_19_MODE_Pos)                       /*!< SCU SFSP1_19: MODE Mask                 */
#define SCU_SFSP1_19_EPD_Pos                  3                                                       /*!< SCU SFSP1_19: EPD Position              */
#define SCU_SFSP1_19_EPD_Msk                  (0x01UL << SCU_SFSP1_19_EPD_Pos)                        /*!< SCU SFSP1_19: EPD Mask                  */
#define SCU_SFSP1_19_EPUN_Pos                 4                                                       /*!< SCU SFSP1_19: EPUN Position             */
#define SCU_SFSP1_19_EPUN_Msk                 (0x01UL << SCU_SFSP1_19_EPUN_Pos)                       /*!< SCU SFSP1_19: EPUN Mask                 */
#define SCU_SFSP1_19_EHS_Pos                  5                                                       /*!< SCU SFSP1_19: EHS Position              */
#define SCU_SFSP1_19_EHS_Msk                  (0x01UL << SCU_SFSP1_19_EHS_Pos)                        /*!< SCU SFSP1_19: EHS Mask                  */
#define SCU_SFSP1_19_EZI_Pos                  6                                                       /*!< SCU SFSP1_19: EZI Position              */
#define SCU_SFSP1_19_EZI_Msk                  (0x01UL << SCU_SFSP1_19_EZI_Pos)                        /*!< SCU SFSP1_19: EZI Mask                  */
#define SCU_SFSP1_19_ZIF_Pos                  7                                                       /*!< SCU SFSP1_19: ZIF Position              */
#define SCU_SFSP1_19_ZIF_Msk                  (0x01UL << SCU_SFSP1_19_ZIF_Pos)                        /*!< SCU SFSP1_19: ZIF Mask                  */

/* --------------------------------  SCU_SFSP1_20  -------------------------------- */
#define SCU_SFSP1_20_MODE_Pos                 0                                                       /*!< SCU SFSP1_20: MODE Position             */
#define SCU_SFSP1_20_MODE_Msk                 (0x07UL << SCU_SFSP1_20_MODE_Pos)                       /*!< SCU SFSP1_20: MODE Mask                 */
#define SCU_SFSP1_20_EPD_Pos                  3                                                       /*!< SCU SFSP1_20: EPD Position              */
#define SCU_SFSP1_20_EPD_Msk                  (0x01UL << SCU_SFSP1_20_EPD_Pos)                        /*!< SCU SFSP1_20: EPD Mask                  */
#define SCU_SFSP1_20_EPUN_Pos                 4                                                       /*!< SCU SFSP1_20: EPUN Position             */
#define SCU_SFSP1_20_EPUN_Msk                 (0x01UL << SCU_SFSP1_20_EPUN_Pos)                       /*!< SCU SFSP1_20: EPUN Mask                 */
#define SCU_SFSP1_20_EHS_Pos                  5                                                       /*!< SCU SFSP1_20: EHS Position              */
#define SCU_SFSP1_20_EHS_Msk                  (0x01UL << SCU_SFSP1_20_EHS_Pos)                        /*!< SCU SFSP1_20: EHS Mask                  */
#define SCU_SFSP1_20_EZI_Pos                  6                                                       /*!< SCU SFSP1_20: EZI Position              */
#define SCU_SFSP1_20_EZI_Msk                  (0x01UL << SCU_SFSP1_20_EZI_Pos)                        /*!< SCU SFSP1_20: EZI Mask                  */
#define SCU_SFSP1_20_ZIF_Pos                  7                                                       /*!< SCU SFSP1_20: ZIF Position              */
#define SCU_SFSP1_20_ZIF_Msk                  (0x01UL << SCU_SFSP1_20_ZIF_Pos)                        /*!< SCU SFSP1_20: ZIF Mask                  */

/* ---------------------------------  SCU_SFSP2_0  -------------------------------- */
#define SCU_SFSP2_0_MODE_Pos                  0                                                       /*!< SCU SFSP2_0: MODE Position              */
#define SCU_SFSP2_0_MODE_Msk                  (0x07UL << SCU_SFSP2_0_MODE_Pos)                        /*!< SCU SFSP2_0: MODE Mask                  */
#define SCU_SFSP2_0_EPD_Pos                   3                                                       /*!< SCU SFSP2_0: EPD Position               */
#define SCU_SFSP2_0_EPD_Msk                   (0x01UL << SCU_SFSP2_0_EPD_Pos)                         /*!< SCU SFSP2_0: EPD Mask                   */
#define SCU_SFSP2_0_EPUN_Pos                  4                                                       /*!< SCU SFSP2_0: EPUN Position              */
#define SCU_SFSP2_0_EPUN_Msk                  (0x01UL << SCU_SFSP2_0_EPUN_Pos)                        /*!< SCU SFSP2_0: EPUN Mask                  */
#define SCU_SFSP2_0_EHS_Pos                   5                                                       /*!< SCU SFSP2_0: EHS Position               */
#define SCU_SFSP2_0_EHS_Msk                   (0x01UL << SCU_SFSP2_0_EHS_Pos)                         /*!< SCU SFSP2_0: EHS Mask                   */
#define SCU_SFSP2_0_EZI_Pos                   6                                                       /*!< SCU SFSP2_0: EZI Position               */
#define SCU_SFSP2_0_EZI_Msk                   (0x01UL << SCU_SFSP2_0_EZI_Pos)                         /*!< SCU SFSP2_0: EZI Mask                   */
#define SCU_SFSP2_0_ZIF_Pos                   7                                                       /*!< SCU SFSP2_0: ZIF Position               */
#define SCU_SFSP2_0_ZIF_Msk                   (0x01UL << SCU_SFSP2_0_ZIF_Pos)                         /*!< SCU SFSP2_0: ZIF Mask                   */

