roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSP2_6  -------------------------------- */
#define SCU_SFSP2_6_MODE_Pos                  0                                                       /*!< SCU SFSP2_6: MODE Position              */
#define SCU_SFSP2_6_MODE_Msk                  (0x07UL << SCU_SFSP2_6_MODE_Pos)                        /*!< SCU SFSP2_6: MODE Mask                  */
#define SCU_SFSP2_6_EPD_Pos                   3                                                       /*!< SCU SFSP2_6: EPD Position               */
#define SCU_SFSP2_6_EPD_Msk                   (0x01UL << SCU_SFSP2_6_EPD_Pos)                         /*!< SCU SFSP2_6: EPD Mask                   */
#define SCU_SFSP2_6_EPUN_Pos                  4                                                       /*!< SCU SFSP2_6: EPUN Position              */
#define SCU_SFSP2_6_EPUN_Msk                  (0x01UL << SCU_SFSP2_6_EPUN_Pos)                        /*!< SCU SFSP2_6: EPUN Mask                  */
#define SCU_SFSP2_6_EHS_Pos                   5                                                       /*!< SCU SFSP2_6: EHS Position               */
#define SCU_SFSP2_6_EHS_Msk                   (0x01UL << SCU_SFSP2_6_EHS_Pos)                         /*!< SCU SFSP2_6: EHS Mask                   */
#define SCU_SFSP2_6_EZI_Pos                   6                                                       /*!< SCU SFSP2_6: EZI Position               */
#define SCU_SFSP2_6_EZI_Msk                   (0x01UL << SCU_SFSP2_6_EZI_Pos)                         /*!< SCU SFSP2_6: EZI Mask                   */
#define SCU_SFSP2_6_ZIF_Pos                   7                                                       /*!< SCU SFSP2_6: ZIF Position               */
#define SCU_SFSP2_6_ZIF_Msk                   (0x01UL << SCU_SFSP2_6_ZIF_Pos)                         /*!< SCU SFSP2_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP2_7  -------------------------------- */
#define SCU_SFSP2_7_MODE_Pos                  0                                                       /*!< SCU SFSP2_7: MODE Position              */
#define SCU_SFSP2_7_MODE_Msk                  (0x07UL << SCU_SFSP2_7_MODE_Pos)                        /*!< SCU SFSP2_7: MODE Mask                  */
#define SCU_SFSP2_7_EPD_Pos                   3                                                       /*!< SCU SFSP2_7: EPD Position               */
#define SCU_SFSP2_7_EPD_Msk                   (0x01UL << SCU_SFSP2_7_EPD_Pos)                         /*!< SCU SFSP2_7: EPD Mask                   */
#define SCU_SFSP2_7_EPUN_Pos                  4                                                       /*!< SCU SFSP2_7: EPUN Position              */
#define SCU_SFSP2_7_EPUN_Msk                  (0x01UL << SCU_SFSP2_7_EPUN_Pos)                        /*!< SCU SFSP2_7: EPUN Mask                  */
#define SCU_SFSP2_7_EHS_Pos                   5                                                       /*!< SCU SFSP2_7: EHS Position               */
#define SCU_SFSP2_7_EHS_Msk                   (0x01UL << SCU_SFSP2_7_EHS_Pos)                         /*!< SCU SFSP2_7: EHS Mask                   */
#define SCU_SFSP2_7_EZI_Pos                   6                                                       /*!< SCU SFSP2_7: EZI Position               */
#define SCU_SFSP2_7_EZI_Msk                   (0x01UL << SCU_SFSP2_7_EZI_Pos)                         /*!< SCU SFSP2_7: EZI Mask                   */
#define SCU_SFSP2_7_ZIF_Pos                   7                                                       /*!< SCU SFSP2_7: ZIF Position               */
#define SCU_SFSP2_7_ZIF_Msk                   (0x01UL << SCU_SFSP2_7_ZIF_Pos)                         /*!< SCU SFSP2_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP2_8  -------------------------------- */
#define SCU_SFSP2_8_MODE_Pos                  0                                                       /*!< SCU SFSP2_8: MODE Position              */
#define SCU_SFSP2_8_MODE_Msk                  (0x07UL << SCU_SFSP2_8_MODE_Pos)                        /*!< SCU SFSP2_8: MODE Mask                  */
#define SCU_SFSP2_8_EPD_Pos                   3                                                       /*!< SCU SFSP2_8: EPD Position               */
#define SCU_SFSP2_8_EPD_Msk                   (0x01UL << SCU_SFSP2_8_EPD_Pos)                         /*!< SCU SFSP2_8: EPD Mask                   */
#define SCU_SFSP2_8_EPUN_Pos                  4                                                       /*!< SCU SFSP2_8: EPUN Position              */
#define SCU_SFSP2_8_EPUN_Msk                  (0x01UL << SCU_SFSP2_8_EPUN_Pos)                        /*!< SCU SFSP2_8: EPUN Mask                  */
#define SCU_SFSP2_8_EHS_Pos                   5                                                       /*!< SCU SFSP2_8: EHS Position               */
#define SCU_SFSP2_8_EHS_Msk                   (0x01UL << SCU_SFSP2_8_EHS_Pos)                         /*!< SCU SFSP2_8: EHS Mask                   */
#define SCU_SFSP2_8_EZI_Pos                   6                                                       /*!< SCU SFSP2_8: EZI Position               */
#define SCU_SFSP2_8_EZI_Msk                   (0x01UL << SCU_SFSP2_8_EZI_Pos)                         /*!< SCU SFSP2_8: EZI Mask                   */
#define SCU_SFSP2_8_ZIF_Pos                   7                                                       /*!< SCU SFSP2_8: ZIF Position               */
#define SCU_SFSP2_8_ZIF_Msk                   (0x01UL << SCU_SFSP2_8_ZIF_Pos)                         /*!< SCU SFSP2_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP2_9  -------------------------------- */
#define SCU_SFSP2_9_MODE_Pos                  0                                                       /*!< SCU SFSP2_9: MODE Position              */
#define SCU_SFSP2_9_MODE_Msk                  (0x07UL << SCU_SFSP2_9_MODE_Pos)                        /*!< SCU SFSP2_9: MODE Mask                  */
#define SCU_SFSP2_9_EPD_Pos                   3                                                       /*!< SCU SFSP2_9: EPD Position               */
#define SCU_SFSP2_9_EPD_Msk                   (0x01UL << SCU_SFSP2_9_EPD_Pos)                         /*!< SCU SFSP2_9: EPD Mask                   */
#define SCU_SFSP2_9_EPUN_Pos                  4                                                       /*!< SCU SFSP2_9: EPUN Position              */
#define SCU_SFSP2_9_EPUN_Msk                  (0x01UL << SCU_SFSP2_9_EPUN_Pos)                        /*!< SCU SFSP2_9: EPUN Mask                  */
#define SCU_SFSP2_9_EHS_Pos                   5                                                       /*!< SCU SFSP2_9: EHS Position               */
#define SCU_SFSP2_9_EHS_Msk                   (0x01UL << SCU_SFSP2_9_EHS_Pos)                         /*!< SCU SFSP2_9: EHS Mask                   */
#define SCU_SFSP2_9_EZI_Pos                   6                                                       /*!< SCU SFSP2_9: EZI Position               */
#define SCU_SFSP2_9_EZI_Msk                   (0x01UL << SCU_SFSP2_9_EZI_Pos)                         /*!< SCU SFSP2_9: EZI Mask                   */
#define SCU_SFSP2_9_ZIF_Pos                   7                                                       /*!< SCU SFSP2_9: ZIF Position               */
#define SCU_SFSP2_9_ZIF_Msk                   (0x01UL << SCU_SFSP2_9_ZIF_Pos)                         /*!< SCU SFSP2_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSP2_10  -------------------------------- */
#define SCU_SFSP2_10_MODE_Pos                 0                                                       /*!< SCU SFSP2_10: MODE Position             */
#define SCU_SFSP2_10_MODE_Msk                 (0x07UL << SCU_SFSP2_10_MODE_Pos)                       /*!< SCU SFSP2_10: MODE Mask                 */
#define SCU_SFSP2_10_EPD_Pos                  3                                                       /*!< SCU SFSP2_10: EPD Position              */
#define SCU_SFSP2_10_EPD_Msk                  (0x01UL << SCU_SFSP2_10_EPD_Pos)                        /*!< SCU SFSP2_10: EPD Mask                  */
#define SCU_SFSP2_10_EPUN_Pos                 4                                                       /*!< SCU SFSP2_10: EPUN Position             */
#define SCU_SFSP2_10_EPUN_Msk                 (0x01UL << SCU_SFSP2_10_EPUN_Pos)                       /*!< SCU SFSP2_10: EPUN Mask                 */
#define SCU_SFSP2_10_EHS_Pos                  5                                                       /*!< SCU SFSP2_10: EHS Position              */
#define SCU_SFSP2_10_EHS_Msk                  (0x01UL << SCU_SFSP2_10_EHS_Pos)                        /*!< SCU SFSP2_10: EHS Mask                  */
#define SCU_SFSP2_10_EZI_Pos                  6                                                       /*!< SCU SFSP2_10: EZI Position              */
#define SCU_SFSP2_10_EZI_Msk                  (0x01UL << SCU_SFSP2_10_EZI_Pos)                        /*!< SCU SFSP2_10: EZI Mask                  */
#define SCU_SFSP2_10_ZIF_Pos                  7                                                       /*!< SCU SFSP2_10: ZIF Position              */
#define SCU_SFSP2_10_ZIF_Msk                  (0x01UL << SCU_SFSP2_10_ZIF_Pos)                        /*!< SCU SFSP2_10: ZIF Mask                  */

/* --------------------------------  SCU_SFSP2_11  -------------------------------- */
#define SCU_SFSP2_11_MODE_Pos                 0                                                       /*!< SCU SFSP2_11: MODE Position             */
#define SCU_SFSP2_11_MODE_Msk                 (0x07UL << SCU_SFSP2_11_MODE_Pos)                       /*!< SCU SFSP2_11: MODE Mask                 */
#define SCU_SFSP2_11_EPD_Pos                  3                                                       /*!< SCU SFSP2_11: EPD Position              */
#define SCU_SFSP2_11_EPD_Msk                  (0x01UL << SCU_SFSP2_11_EPD_Pos)                        /*!< SCU SFSP2_11: EPD Mask                  */
#define SCU_SFSP2_11_EPUN_Pos                 4                                                       /*!< SCU SFSP2_11: EPUN Position             */
#define SCU_SFSP2_11_EPUN_Msk                 (0x01UL << SCU_SFSP2_11_EPUN_Pos)                       /*!< SCU SFSP2_11: EPUN Mask                 */
#define SCU_SFSP2_11_EHS_Pos                  5                                                       /*!< SCU SFSP2_11: EHS Position              */
#define SCU_SFSP2_11_EHS_Msk                  (0x01UL << SCU_SFSP2_11_EHS_Pos)                        /*!< SCU SFSP2_11: EHS Mask                  */
#define SCU_SFSP2_11_EZI_Pos                  6                                                       /*!< SCU SFSP2_11: EZI Position              */
#define SCU_SFSP2_11_EZI_Msk                  (0x01UL << SCU_SFSP2_11_EZI_Pos)                        /*!< SCU SFSP2_11: EZI Mask                  */
#define SCU_SFSP2_11_ZIF_Pos                  7                                                       /*!< SCU SFSP2_11: ZIF Position              */
#define SCU_SFSP2_11_ZIF_Msk                  (0x01UL << SCU_SFSP2_11_ZIF_Pos)                        /*!< SCU SFSP2_11: ZIF Mask                  */

/* --------------------------------  SCU_SFSP2_12  -------------------------------- */
#define SCU_SFSP2_12_MODE_Pos                 0                                                       /*!< SCU SFSP2_12: MODE Position             */
#define SCU_SFSP2_12_MODE_Msk                 (0x07UL << SCU_SFSP2_12_MODE_Pos)                       /*!< SCU SFSP2_12: MODE Mask                 */
#define SCU_SFSP2_12_EPD_Pos                  3                                                       /*!< SCU SFSP2_12: EPD Position              */
#define SCU_SFSP2_12_EPD_Msk                  (0x01UL << SCU_SFSP2_12_EPD_Pos)                        /*!< SCU SFSP2_12: EPD Mask                  */
#define SCU_SFSP2_12_EPUN_Pos                 4                                                       /*!< SCU SFSP2_12: EPUN Position             */
#define SCU_SFSP2_12_EPUN_Msk                 (0x01UL << SCU_SFSP2_12_EPUN_Pos)                       /*!< SCU SFSP2_12: EPUN Mask                 */
#define SCU_SFSP2_12_EHS_Pos                  5                                                       /*!< SCU SFSP2_12: EHS Position              */
#define SCU_SFSP2_12_EHS_Msk                  (0x01UL << SCU_SFSP2_12_EHS_Pos)                        /*!< SCU SFSP2_12: EHS Mask                  */
#define SCU_SFSP2_12_EZI_Pos                  6                                                       /*!< SCU SFSP2_12: EZI Position              */
#define SCU_SFSP2_12_EZI_Msk                  (0x01UL << SCU_SFSP2_12_EZI_Pos)                        /*!< SCU SFSP2_12: EZI Mask                  */
#define SCU_SFSP2_12_ZIF_Pos                  7                                                       /*!< SCU SFSP2_12: ZIF Position              */
#define SCU_SFSP2_12_ZIF_Msk                  (0x01UL << SCU_SFSP2_12_ZIF_Pos)                        /*!< SCU SFSP2_12: ZIF Mask                  */

