roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCU_SFSP2_13  -------------------------------- */
#define SCU_SFSP2_13_MODE_Pos                 0                                                       /*!< SCU SFSP2_13: MODE Position             */
#define SCU_SFSP2_13_MODE_Msk                 (0x07UL << SCU_SFSP2_13_MODE_Pos)                       /*!< SCU SFSP2_13: MODE Mask                 */
#define SCU_SFSP2_13_EPD_Pos                  3                                                       /*!< SCU SFSP2_13: EPD Position              */
#define SCU_SFSP2_13_EPD_Msk                  (0x01UL << SCU_SFSP2_13_EPD_Pos)                        /*!< SCU SFSP2_13: EPD Mask                  */
#define SCU_SFSP2_13_EPUN_Pos                 4                                                       /*!< SCU SFSP2_13: EPUN Position             */
#define SCU_SFSP2_13_EPUN_Msk                 (0x01UL << SCU_SFSP2_13_EPUN_Pos)                       /*!< SCU SFSP2_13: EPUN Mask                 */
#define SCU_SFSP2_13_EHS_Pos                  5                                                       /*!< SCU SFSP2_13: EHS Position              */
#define SCU_SFSP2_13_EHS_Msk                  (0x01UL << SCU_SFSP2_13_EHS_Pos)                        /*!< SCU SFSP2_13: EHS Mask                  */
#define SCU_SFSP2_13_EZI_Pos                  6                                                       /*!< SCU SFSP2_13: EZI Position              */
#define SCU_SFSP2_13_EZI_Msk                  (0x01UL << SCU_SFSP2_13_EZI_Pos)                        /*!< SCU SFSP2_13: EZI Mask                  */
#define SCU_SFSP2_13_ZIF_Pos                  7                                                       /*!< SCU SFSP2_13: ZIF Position              */
#define SCU_SFSP2_13_ZIF_Msk                  (0x01UL << SCU_SFSP2_13_ZIF_Pos)                        /*!< SCU SFSP2_13: ZIF Mask                  */

/* ---------------------------------  SCU_SFSP3_0  -------------------------------- */
#define SCU_SFSP3_0_MODE_Pos                  0                                                       /*!< SCU SFSP3_0: MODE Position              */
#define SCU_SFSP3_0_MODE_Msk                  (0x07UL << SCU_SFSP3_0_MODE_Pos)                        /*!< SCU SFSP3_0: MODE Mask                  */
#define SCU_SFSP3_0_EPD_Pos                   3                                                       /*!< SCU SFSP3_0: EPD Position               */
#define SCU_SFSP3_0_EPD_Msk                   (0x01UL << SCU_SFSP3_0_EPD_Pos)                         /*!< SCU SFSP3_0: EPD Mask                   */
#define SCU_SFSP3_0_EPUN_Pos                  4                                                       /*!< SCU SFSP3_0: EPUN Position              */
#define SCU_SFSP3_0_EPUN_Msk                  (0x01UL << SCU_SFSP3_0_EPUN_Pos)                        /*!< SCU SFSP3_0: EPUN Mask                  */
#define SCU_SFSP3_0_EHS_Pos                   5                                                       /*!< SCU SFSP3_0: EHS Position               */
#define SCU_SFSP3_0_EHS_Msk                   (0x01UL << SCU_SFSP3_0_EHS_Pos)                         /*!< SCU SFSP3_0: EHS Mask                   */
#define SCU_SFSP3_0_EZI_Pos                   6                                                       /*!< SCU SFSP3_0: EZI Position               */
#define SCU_SFSP3_0_EZI_Msk                   (0x01UL << SCU_SFSP3_0_EZI_Pos)                         /*!< SCU SFSP3_0: EZI Mask                   */
#define SCU_SFSP3_0_ZIF_Pos                   7                                                       /*!< SCU SFSP3_0: ZIF Position               */
#define SCU_SFSP3_0_ZIF_Msk                   (0x01UL << SCU_SFSP3_0_ZIF_Pos)                         /*!< SCU SFSP3_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_1  -------------------------------- */
#define SCU_SFSP3_1_MODE_Pos                  0                                                       /*!< SCU SFSP3_1: MODE Position              */
#define SCU_SFSP3_1_MODE_Msk                  (0x07UL << SCU_SFSP3_1_MODE_Pos)                        /*!< SCU SFSP3_1: MODE Mask                  */
#define SCU_SFSP3_1_EPD_Pos                   3                                                       /*!< SCU SFSP3_1: EPD Position               */
#define SCU_SFSP3_1_EPD_Msk                   (0x01UL << SCU_SFSP3_1_EPD_Pos)                         /*!< SCU SFSP3_1: EPD Mask                   */
#define SCU_SFSP3_1_EPUN_Pos                  4                                                       /*!< SCU SFSP3_1: EPUN Position              */
#define SCU_SFSP3_1_EPUN_Msk                  (0x01UL << SCU_SFSP3_1_EPUN_Pos)                        /*!< SCU SFSP3_1: EPUN Mask                  */
#define SCU_SFSP3_1_EHS_Pos                   5                                                       /*!< SCU SFSP3_1: EHS Position               */
#define SCU_SFSP3_1_EHS_Msk                   (0x01UL << SCU_SFSP3_1_EHS_Pos)                         /*!< SCU SFSP3_1: EHS Mask                   */
#define SCU_SFSP3_1_EZI_Pos                   6                                                       /*!< SCU SFSP3_1: EZI Position               */
#define SCU_SFSP3_1_EZI_Msk                   (0x01UL << SCU_SFSP3_1_EZI_Pos)                         /*!< SCU SFSP3_1: EZI Mask                   */
#define SCU_SFSP3_1_ZIF_Pos                   7                                                       /*!< SCU SFSP3_1: ZIF Position               */
#define SCU_SFSP3_1_ZIF_Msk                   (0x01UL << SCU_SFSP3_1_ZIF_Pos)                         /*!< SCU SFSP3_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_2  -------------------------------- */
#define SCU_SFSP3_2_MODE_Pos                  0                                                       /*!< SCU SFSP3_2: MODE Position              */
#define SCU_SFSP3_2_MODE_Msk                  (0x07UL << SCU_SFSP3_2_MODE_Pos)                        /*!< SCU SFSP3_2: MODE Mask                  */
#define SCU_SFSP3_2_EPD_Pos                   3                                                       /*!< SCU SFSP3_2: EPD Position               */
#define SCU_SFSP3_2_EPD_Msk                   (0x01UL << SCU_SFSP3_2_EPD_Pos)                         /*!< SCU SFSP3_2: EPD Mask                   */
#define SCU_SFSP3_2_EPUN_Pos                  4                                                       /*!< SCU SFSP3_2: EPUN Position              */
#define SCU_SFSP3_2_EPUN_Msk                  (0x01UL << SCU_SFSP3_2_EPUN_Pos)                        /*!< SCU SFSP3_2: EPUN Mask                  */
#define SCU_SFSP3_2_EHS_Pos                   5                                                       /*!< SCU SFSP3_2: EHS Position               */
#define SCU_SFSP3_2_EHS_Msk                   (0x01UL << SCU_SFSP3_2_EHS_Pos)                         /*!< SCU SFSP3_2: EHS Mask                   */
#define SCU_SFSP3_2_EZI_Pos                   6                                                       /*!< SCU SFSP3_2: EZI Position               */
#define SCU_SFSP3_2_EZI_Msk                   (0x01UL << SCU_SFSP3_2_EZI_Pos)                         /*!< SCU SFSP3_2: EZI Mask                   */
#define SCU_SFSP3_2_ZIF_Pos                   7                                                       /*!< SCU SFSP3_2: ZIF Position               */
#define SCU_SFSP3_2_ZIF_Msk                   (0x01UL << SCU_SFSP3_2_ZIF_Pos)                         /*!< SCU SFSP3_2: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_3  -------------------------------- */
#define SCU_SFSP3_3_MODE_Pos                  0                                                       /*!< SCU SFSP3_3: MODE Position              */
#define SCU_SFSP3_3_MODE_Msk                  (0x07UL << SCU_SFSP3_3_MODE_Pos)                        /*!< SCU SFSP3_3: MODE Mask                  */
#define SCU_SFSP3_3_EPD_Pos                   3                                                       /*!< SCU SFSP3_3: EPD Position               */
#define SCU_SFSP3_3_EPD_Msk                   (0x01UL << SCU_SFSP3_3_EPD_Pos)                         /*!< SCU SFSP3_3: EPD Mask                   */
#define SCU_SFSP3_3_EPUN_Pos                  4                                                       /*!< SCU SFSP3_3: EPUN Position              */
#define SCU_SFSP3_3_EPUN_Msk                  (0x01UL << SCU_SFSP3_3_EPUN_Pos)                        /*!< SCU SFSP3_3: EPUN Mask                  */
#define SCU_SFSP3_3_EHS_Pos                   5                                                       /*!< SCU SFSP3_3: EHS Position               */
#define SCU_SFSP3_3_EHS_Msk                   (0x01UL << SCU_SFSP3_3_EHS_Pos)                         /*!< SCU SFSP3_3: EHS Mask                   */
#define SCU_SFSP3_3_EZI_Pos                   6                                                       /*!< SCU SFSP3_3: EZI Position               */
#define SCU_SFSP3_3_EZI_Msk                   (0x01UL << SCU_SFSP3_3_EZI_Pos)                         /*!< SCU SFSP3_3: EZI Mask                   */
#define SCU_SFSP3_3_ZIF_Pos                   7                                                       /*!< SCU SFSP3_3: ZIF Position               */
#define SCU_SFSP3_3_ZIF_Msk                   (0x01UL << SCU_SFSP3_3_ZIF_Pos)                         /*!< SCU SFSP3_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP3_4  -------------------------------- */
#define SCU_SFSP3_4_MODE_Pos                  0                                                       /*!< SCU SFSP3_4: MODE Position              */
#define SCU_SFSP3_4_MODE_Msk                  (0x07UL << SCU_SFSP3_4_MODE_Pos)                        /*!< SCU SFSP3_4: MODE Mask                  */
#define SCU_SFSP3_4_EPD_Pos                   3                                                       /*!< SCU SFSP3_4: EPD Position               */
#define SCU_SFSP3_4_EPD_Msk                   (0x01UL << SCU_SFSP3_4_EPD_Pos)                         /*!< SCU SFSP3_4: EPD Mask                   */
#define SCU_SFSP3_4_EPUN_Pos                  4                                                       /*!< SCU SFSP3_4: EPUN Position              */
#define SCU_SFSP3_4_EPUN_Msk                  (0x01UL << SCU_SFSP3_4_EPUN_Pos)                        /*!< SCU SFSP3_4: EPUN Mask                  */
#define SCU_SFSP3_4_EHS_Pos                   5                                                       /*!< SCU SFSP3_4: EHS Position               */
#define SCU_SFSP3_4_EHS_Msk                   (0x01UL << SCU_SFSP3_4_EHS_Pos)                         /*!< SCU SFSP3_4: EHS Mask                   */
#define SCU_SFSP3_4_EZI_Pos                   6                                                       /*!< SCU SFSP3_4: EZI Position               */
#define SCU_SFSP3_4_EZI_Msk                   (0x01UL << SCU_SFSP3_4_EZI_Pos)                         /*!< SCU SFSP3_4: EZI Mask                   */
#define SCU_SFSP3_4_ZIF_Pos                   7                                                       /*!< SCU SFSP3_4: ZIF Position               */
#define SCU_SFSP3_4_ZIF_Msk                   (0x01UL << SCU_SFSP3_4_ZIF_Pos)                         /*!< SCU SFSP3_4: ZIF Mask                   */

