roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSP5_2  -------------------------------- */
#define SCU_SFSP5_2_MODE_Pos                  0                                                       /*!< SCU SFSP5_2: MODE Position              */
#define SCU_SFSP5_2_MODE_Msk                  (0x07UL << SCU_SFSP5_2_MODE_Pos)                        /*!< SCU SFSP5_2: MODE Mask                  */
#define SCU_SFSP5_2_EPD_Pos                   3                                                       /*!< SCU SFSP5_2: EPD Position               */
#define SCU_SFSP5_2_EPD_Msk                   (0x01UL << SCU_SFSP5_2_EPD_Pos)                         /*!< SCU SFSP5_2: EPD Mask                   */
#define SCU_SFSP5_2_EPUN_Pos                  4                                                       /*!< SCU SFSP5_2: EPUN Position              */
#define SCU_SFSP5_2_EPUN_Msk                  (0x01UL << SCU_SFSP5_2_EPUN_Pos)                        /*!< SCU SFSP5_2: EPUN Mask                  */
#define SCU_SFSP5_2_EHS_Pos                   5                                                       /*!< SCU SFSP5_2: EHS Position               */
#define SCU_SFSP5_2_EHS_Msk                   (0x01UL << SCU_SFSP5_2_EHS_Pos)                         /*!< SCU SFSP5_2: EHS Mask                   */
#define SCU_SFSP5_2_EZI_Pos                   6                                                       /*!< SCU SFSP5_2: EZI Position               */
#define SCU_SFSP5_2_EZI_Msk                   (0x01UL << SCU_SFSP5_2_EZI_Pos)                         /*!< SCU SFSP5_2: EZI Mask                   */
#define SCU_SFSP5_2_ZIF_Pos                   7                                                       /*!< SCU SFSP5_2: ZIF Position               */
#define SCU_SFSP5_2_ZIF_Msk                   (0x01UL << SCU_SFSP5_2_ZIF_Pos)                         /*!< SCU SFSP5_2: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP5_3  -------------------------------- */
#define SCU_SFSP5_3_MODE_Pos                  0                                                       /*!< SCU SFSP5_3: MODE Position              */
#define SCU_SFSP5_3_MODE_Msk                  (0x07UL << SCU_SFSP5_3_MODE_Pos)                        /*!< SCU SFSP5_3: MODE Mask                  */
#define SCU_SFSP5_3_EPD_Pos                   3                                                       /*!< SCU SFSP5_3: EPD Position               */
#define SCU_SFSP5_3_EPD_Msk                   (0x01UL << SCU_SFSP5_3_EPD_Pos)                         /*!< SCU SFSP5_3: EPD Mask                   */
#define SCU_SFSP5_3_EPUN_Pos                  4                                                       /*!< SCU SFSP5_3: EPUN Position              */
#define SCU_SFSP5_3_EPUN_Msk                  (0x01UL << SCU_SFSP5_3_EPUN_Pos)                        /*!< SCU SFSP5_3: EPUN Mask                  */
#define SCU_SFSP5_3_EHS_Pos                   5                                                       /*!< SCU SFSP5_3: EHS Position               */
#define SCU_SFSP5_3_EHS_Msk                   (0x01UL << SCU_SFSP5_3_EHS_Pos)                         /*!< SCU SFSP5_3: EHS Mask                   */
#define SCU_SFSP5_3_EZI_Pos                   6                                                       /*!< SCU SFSP5_3: EZI Position               */
#define SCU_SFSP5_3_EZI_Msk                   (0x01UL << SCU_SFSP5_3_EZI_Pos)                         /*!< SCU SFSP5_3: EZI Mask                   */
#define SCU_SFSP5_3_ZIF_Pos                   7                                                       /*!< SCU SFSP5_3: ZIF Position               */
#define SCU_SFSP5_3_ZIF_Msk                   (0x01UL << SCU_SFSP5_3_ZIF_Pos)                         /*!< SCU SFSP5_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP5_4  -------------------------------- */
#define SCU_SFSP5_4_MODE_Pos                  0                                                       /*!< SCU SFSP5_4: MODE Position              */
#define SCU_SFSP5_4_MODE_Msk                  (0x07UL << SCU_SFSP5_4_MODE_Pos)                        /*!< SCU SFSP5_4: MODE Mask                  */
#define SCU_SFSP5_4_EPD_Pos                   3                                                       /*!< SCU SFSP5_4: EPD Position               */
#define SCU_SFSP5_4_EPD_Msk                   (0x01UL << SCU_SFSP5_4_EPD_Pos)                         /*!< SCU SFSP5_4: EPD Mask                   */
#define SCU_SFSP5_4_EPUN_Pos                  4                                                       /*!< SCU SFSP5_4: EPUN Position              */
#define SCU_SFSP5_4_EPUN_Msk                  (0x01UL << SCU_SFSP5_4_EPUN_Pos)                        /*!< SCU SFSP5_4: EPUN Mask                  */
#define SCU_SFSP5_4_EHS_Pos                   5                                                       /*!< SCU SFSP5_4: EHS Position               */
#define SCU_SFSP5_4_EHS_Msk                   (0x01UL << SCU_SFSP5_4_EHS_Pos)                         /*!< SCU SFSP5_4: EHS Mask                   */
#define SCU_SFSP5_4_EZI_Pos                   6                                                       /*!< SCU SFSP5_4: EZI Position               */
#define SCU_SFSP5_4_EZI_Msk                   (0x01UL << SCU_SFSP5_4_EZI_Pos)                         /*!< SCU SFSP5_4: EZI Mask                   */
#define SCU_SFSP5_4_ZIF_Pos                   7                                                       /*!< SCU SFSP5_4: ZIF Position               */
#define SCU_SFSP5_4_ZIF_Msk                   (0x01UL << SCU_SFSP5_4_ZIF_Pos)                         /*!< SCU SFSP5_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP5_5  -------------------------------- */
#define SCU_SFSP5_5_MODE_Pos                  0                                                       /*!< SCU SFSP5_5: MODE Position              */
#define SCU_SFSP5_5_MODE_Msk                  (0x07UL << SCU_SFSP5_5_MODE_Pos)                        /*!< SCU SFSP5_5: MODE Mask                  */
#define SCU_SFSP5_5_EPD_Pos                   3                                                       /*!< SCU SFSP5_5: EPD Position               */
#define SCU_SFSP5_5_EPD_Msk                   (0x01UL << SCU_SFSP5_5_EPD_Pos)                         /*!< SCU SFSP5_5: EPD Mask                   */
#define SCU_SFSP5_5_EPUN_Pos                  4                                                       /*!< SCU SFSP5_5: EPUN Position              */
#define SCU_SFSP5_5_EPUN_Msk                  (0x01UL << SCU_SFSP5_5_EPUN_Pos)                        /*!< SCU SFSP5_5: EPUN Mask                  */
#define SCU_SFSP5_5_EHS_Pos                   5                                                       /*!< SCU SFSP5_5: EHS Position               */
#define SCU_SFSP5_5_EHS_Msk                   (0x01UL << SCU_SFSP5_5_EHS_Pos)                         /*!< SCU SFSP5_5: EHS Mask                   */
#define SCU_SFSP5_5_EZI_Pos                   6                                                       /*!< SCU SFSP5_5: EZI Position               */
#define SCU_SFSP5_5_EZI_Msk                   (0x01UL << SCU_SFSP5_5_EZI_Pos)                         /*!< SCU SFSP5_5: EZI Mask                   */
#define SCU_SFSP5_5_ZIF_Pos                   7                                                       /*!< SCU SFSP5_5: ZIF Position               */
#define SCU_SFSP5_5_ZIF_Msk                   (0x01UL << SCU_SFSP5_5_ZIF_Pos)                         /*!< SCU SFSP5_5: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP5_6  -------------------------------- */
#define SCU_SFSP5_6_MODE_Pos                  0                                                       /*!< SCU SFSP5_6: MODE Position              */
#define SCU_SFSP5_6_MODE_Msk                  (0x07UL << SCU_SFSP5_6_MODE_Pos)                        /*!< SCU SFSP5_6: MODE Mask                  */
#define SCU_SFSP5_6_EPD_Pos                   3                                                       /*!< SCU SFSP5_6: EPD Position               */
#define SCU_SFSP5_6_EPD_Msk                   (0x01UL << SCU_SFSP5_6_EPD_Pos)                         /*!< SCU SFSP5_6: EPD Mask                   */
#define SCU_SFSP5_6_EPUN_Pos                  4                                                       /*!< SCU SFSP5_6: EPUN Position              */
#define SCU_SFSP5_6_EPUN_Msk                  (0x01UL << SCU_SFSP5_6_EPUN_Pos)                        /*!< SCU SFSP5_6: EPUN Mask                  */
#define SCU_SFSP5_6_EHS_Pos                   5                                                       /*!< SCU SFSP5_6: EHS Position               */
#define SCU_SFSP5_6_EHS_Msk                   (0x01UL << SCU_SFSP5_6_EHS_Pos)                         /*!< SCU SFSP5_6: EHS Mask                   */
#define SCU_SFSP5_6_EZI_Pos                   6                                                       /*!< SCU SFSP5_6: EZI Position               */
#define SCU_SFSP5_6_EZI_Msk                   (0x01UL << SCU_SFSP5_6_EZI_Pos)                         /*!< SCU SFSP5_6: EZI Mask                   */
#define SCU_SFSP5_6_ZIF_Pos                   7                                                       /*!< SCU SFSP5_6: ZIF Position               */
#define SCU_SFSP5_6_ZIF_Msk                   (0x01UL << SCU_SFSP5_6_ZIF_Pos)                         /*!< SCU SFSP5_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP5_7  -------------------------------- */
#define SCU_SFSP5_7_MODE_Pos                  0                                                       /*!< SCU SFSP5_7: MODE Position              */
#define SCU_SFSP5_7_MODE_Msk                  (0x07UL << SCU_SFSP5_7_MODE_Pos)                        /*!< SCU SFSP5_7: MODE Mask                  */
#define SCU_SFSP5_7_EPD_Pos                   3                                                       /*!< SCU SFSP5_7: EPD Position               */
#define SCU_SFSP5_7_EPD_Msk                   (0x01UL << SCU_SFSP5_7_EPD_Pos)                         /*!< SCU SFSP5_7: EPD Mask                   */
#define SCU_SFSP5_7_EPUN_Pos                  4                                                       /*!< SCU SFSP5_7: EPUN Position              */
#define SCU_SFSP5_7_EPUN_Msk                  (0x01UL << SCU_SFSP5_7_EPUN_Pos)                        /*!< SCU SFSP5_7: EPUN Mask                  */
#define SCU_SFSP5_7_EHS_Pos                   5                                                       /*!< SCU SFSP5_7: EHS Position               */
#define SCU_SFSP5_7_EHS_Msk                   (0x01UL << SCU_SFSP5_7_EHS_Pos)                         /*!< SCU SFSP5_7: EHS Mask                   */
#define SCU_SFSP5_7_EZI_Pos                   6                                                       /*!< SCU SFSP5_7: EZI Position               */
#define SCU_SFSP5_7_EZI_Msk                   (0x01UL << SCU_SFSP5_7_EZI_Pos)                         /*!< SCU SFSP5_7: EZI Mask                   */
#define SCU_SFSP5_7_ZIF_Pos                   7                                                       /*!< SCU SFSP5_7: ZIF Position               */
#define SCU_SFSP5_7_ZIF_Msk                   (0x01UL << SCU_SFSP5_7_ZIF_Pos)                         /*!< SCU SFSP5_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_0  -------------------------------- */
#define SCU_SFSP6_0_MODE_Pos                  0                                                       /*!< SCU SFSP6_0: MODE Position              */
#define SCU_SFSP6_0_MODE_Msk                  (0x07UL << SCU_SFSP6_0_MODE_Pos)                        /*!< SCU SFSP6_0: MODE Mask                  */
#define SCU_SFSP6_0_EPD_Pos                   3                                                       /*!< SCU SFSP6_0: EPD Position               */
#define SCU_SFSP6_0_EPD_Msk                   (0x01UL << SCU_SFSP6_0_EPD_Pos)                         /*!< SCU SFSP6_0: EPD Mask                   */
#define SCU_SFSP6_0_EPUN_Pos                  4                                                       /*!< SCU SFSP6_0: EPUN Position              */
#define SCU_SFSP6_0_EPUN_Msk                  (0x01UL << SCU_SFSP6_0_EPUN_Pos)                        /*!< SCU SFSP6_0: EPUN Mask                  */
#define SCU_SFSP6_0_EHS_Pos                   5                                                       /*!< SCU SFSP6_0: EHS Position               */
#define SCU_SFSP6_0_EHS_Msk                   (0x01UL << SCU_SFSP6_0_EHS_Pos)                         /*!< SCU SFSP6_0: EHS Mask                   */
#define SCU_SFSP6_0_EZI_Pos                   6                                                       /*!< SCU SFSP6_0: EZI Position               */
#define SCU_SFSP6_0_EZI_Msk                   (0x01UL << SCU_SFSP6_0_EZI_Pos)                         /*!< SCU SFSP6_0: EZI Mask                   */
#define SCU_SFSP6_0_ZIF_Pos                   7                                                       /*!< SCU SFSP6_0: ZIF Position               */
#define SCU_SFSP6_0_ZIF_Msk                   (0x01UL << SCU_SFSP6_0_ZIF_Pos)                         /*!< SCU SFSP6_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP6_1  -------------------------------- */
#define SCU_SFSP6_1_MODE_Pos                  0                                                       /*!< SCU SFSP6_1: MODE Position              */
#define SCU_SFSP6_1_MODE_Msk                  (0x07UL << SCU_SFSP6_1_MODE_Pos)                        /*!< SCU SFSP6_1: MODE Mask                  */
#define SCU_SFSP6_1_EPD_Pos                   3                                                       /*!< SCU SFSP6_1: EPD Position               */
#define SCU_SFSP6_1_EPD_Msk                   (0x01UL << SCU_SFSP6_1_EPD_Pos)                         /*!< SCU SFSP6_1: EPD Mask                   */
#define SCU_SFSP6_1_EPUN_Pos                  4                                                       /*!< SCU SFSP6_1: EPUN Position              */
#define SCU_SFSP6_1_EPUN_Msk                  (0x01UL << SCU_SFSP6_1_EPUN_Pos)                        /*!< SCU SFSP6_1: EPUN Mask                  */
#define SCU_SFSP6_1_EHS_Pos                   5                                                       /*!< SCU SFSP6_1: EHS Position               */
#define SCU_SFSP6_1_EHS_Msk                   (0x01UL << SCU_SFSP6_1_EHS_Pos)                         /*!< SCU SFSP6_1: EHS Mask                   */
#define SCU_SFSP6_1_EZI_Pos                   6                                                       /*!< SCU SFSP6_1: EZI Position               */
#define SCU_SFSP6_1_EZI_Msk                   (0x01UL << SCU_SFSP6_1_EZI_Pos)                         /*!< SCU SFSP6_1: EZI Mask                   */
#define SCU_SFSP6_1_ZIF_Pos                   7                                                       /*!< SCU SFSP6_1: ZIF Position               */
#define SCU_SFSP6_1_ZIF_Msk                   (0x01UL << SCU_SFSP6_1_ZIF_Pos)                         /*!< SCU SFSP6_1: ZIF Mask                   */

