roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCU_SFSP6_12  -------------------------------- */
#define SCU_SFSP6_12_MODE_Pos                 0                                                       /*!< SCU SFSP6_12: MODE Position             */
#define SCU_SFSP6_12_MODE_Msk                 (0x07UL << SCU_SFSP6_12_MODE_Pos)                       /*!< SCU SFSP6_12: MODE Mask                 */
#define SCU_SFSP6_12_EPD_Pos                  3                                                       /*!< SCU SFSP6_12: EPD Position              */
#define SCU_SFSP6_12_EPD_Msk                  (0x01UL << SCU_SFSP6_12_EPD_Pos)                        /*!< SCU SFSP6_12: EPD Mask                  */
#define SCU_SFSP6_12_EPUN_Pos                 4                                                       /*!< SCU SFSP6_12: EPUN Position             */
#define SCU_SFSP6_12_EPUN_Msk                 (0x01UL << SCU_SFSP6_12_EPUN_Pos)                       /*!< SCU SFSP6_12: EPUN Mask                 */
#define SCU_SFSP6_12_EHS_Pos                  5                                                       /*!< SCU SFSP6_12: EHS Position              */
#define SCU_SFSP6_12_EHS_Msk                  (0x01UL << SCU_SFSP6_12_EHS_Pos)                        /*!< SCU SFSP6_12: EHS Mask                  */
#define SCU_SFSP6_12_EZI_Pos                  6                                                       /*!< SCU SFSP6_12: EZI Position              */
#define SCU_SFSP6_12_EZI_Msk                  (0x01UL << SCU_SFSP6_12_EZI_Pos)                        /*!< SCU SFSP6_12: EZI Mask                  */
#define SCU_SFSP6_12_ZIF_Pos                  7                                                       /*!< SCU SFSP6_12: ZIF Position              */
#define SCU_SFSP6_12_ZIF_Msk                  (0x01UL << SCU_SFSP6_12_ZIF_Pos)                        /*!< SCU SFSP6_12: ZIF Mask                  */

/* ---------------------------------  SCU_SFSP7_0  -------------------------------- */
#define SCU_SFSP7_0_MODE_Pos                  0                                                       /*!< SCU SFSP7_0: MODE Position              */
#define SCU_SFSP7_0_MODE_Msk                  (0x07UL << SCU_SFSP7_0_MODE_Pos)                        /*!< SCU SFSP7_0: MODE Mask                  */
#define SCU_SFSP7_0_EPD_Pos                   3                                                       /*!< SCU SFSP7_0: EPD Position               */
#define SCU_SFSP7_0_EPD_Msk                   (0x01UL << SCU_SFSP7_0_EPD_Pos)                         /*!< SCU SFSP7_0: EPD Mask                   */
#define SCU_SFSP7_0_EPUN_Pos                  4                                                       /*!< SCU SFSP7_0: EPUN Position              */
#define SCU_SFSP7_0_EPUN_Msk                  (0x01UL << SCU_SFSP7_0_EPUN_Pos)                        /*!< SCU SFSP7_0: EPUN Mask                  */
#define SCU_SFSP7_0_EHS_Pos                   5                                                       /*!< SCU SFSP7_0: EHS Position               */
#define SCU_SFSP7_0_EHS_Msk                   (0x01UL << SCU_SFSP7_0_EHS_Pos)                         /*!< SCU SFSP7_0: EHS Mask                   */
#define SCU_SFSP7_0_EZI_Pos                   6                                                       /*!< SCU SFSP7_0: EZI Position               */
#define SCU_SFSP7_0_EZI_Msk                   (0x01UL << SCU_SFSP7_0_EZI_Pos)                         /*!< SCU SFSP7_0: EZI Mask                   */
#define SCU_SFSP7_0_ZIF_Pos                   7                                                       /*!< SCU SFSP7_0: ZIF Position               */
#define SCU_SFSP7_0_ZIF_Msk                   (0x01UL << SCU_SFSP7_0_ZIF_Pos)                         /*!< SCU SFSP7_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP7_1  -------------------------------- */
#define SCU_SFSP7_1_MODE_Pos                  0                                                       /*!< SCU SFSP7_1: MODE Position              */
#define SCU_SFSP7_1_MODE_Msk                  (0x07UL << SCU_SFSP7_1_MODE_Pos)                        /*!< SCU SFSP7_1: MODE Mask                  */
#define SCU_SFSP7_1_EPD_Pos                   3                                                       /*!< SCU SFSP7_1: EPD Position               */
#define SCU_SFSP7_1_EPD_Msk                   (0x01UL << SCU_SFSP7_1_EPD_Pos)                         /*!< SCU SFSP7_1: EPD Mask                   */
#define SCU_SFSP7_1_EPUN_Pos                  4                                                       /*!< SCU SFSP7_1: EPUN Position              */
#define SCU_SFSP7_1_EPUN_Msk                  (0x01UL << SCU_SFSP7_1_EPUN_Pos)                        /*!< SCU SFSP7_1: EPUN Mask                  */
#define SCU_SFSP7_1_EHS_Pos                   5                                                       /*!< SCU SFSP7_1: EHS Position               */
#define SCU_SFSP7_1_EHS_Msk                   (0x01UL << SCU_SFSP7_1_EHS_Pos)                         /*!< SCU SFSP7_1: EHS Mask                   */
#define SCU_SFSP7_1_EZI_Pos                   6                                                       /*!< SCU SFSP7_1: EZI Position               */
#define SCU_SFSP7_1_EZI_Msk                   (0x01UL << SCU_SFSP7_1_EZI_Pos)                         /*!< SCU SFSP7_1: EZI Mask                   */
#define SCU_SFSP7_1_ZIF_Pos                   7                                                       /*!< SCU SFSP7_1: ZIF Position               */
#define SCU_SFSP7_1_ZIF_Msk                   (0x01UL << SCU_SFSP7_1_ZIF_Pos)                         /*!< SCU SFSP7_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP7_2  -------------------------------- */
#define SCU_SFSP7_2_MODE_Pos                  0                                                       /*!< SCU SFSP7_2: MODE Position              */
#define SCU_SFSP7_2_MODE_Msk                  (0x07UL << SCU_SFSP7_2_MODE_Pos)                        /*!< SCU SFSP7_2: MODE Mask                  */
#define SCU_SFSP7_2_EPD_Pos                   3                                                       /*!< SCU SFSP7_2: EPD Position               */
#define SCU_SFSP7_2_EPD_Msk                   (0x01UL << SCU_SFSP7_2_EPD_Pos)                         /*!< SCU SFSP7_2: EPD Mask                   */
#define SCU_SFSP7_2_EPUN_Pos                  4                                                       /*!< SCU SFSP7_2: EPUN Position              */
#define SCU_SFSP7_2_EPUN_Msk                  (0x01UL << SCU_SFSP7_2_EPUN_Pos)                        /*!< SCU SFSP7_2: EPUN Mask                  */
#define SCU_SFSP7_2_EHS_Pos                   5                                                       /*!< SCU SFSP7_2: EHS Position               */
#define SCU_SFSP7_2_EHS_Msk                   (0x01UL << SCU_SFSP7_2_EHS_Pos)                         /*!< SCU SFSP7_2: EHS Mask                   */
#define SCU_SFSP7_2_EZI_Pos                   6                                                       /*!< SCU SFSP7_2: EZI Position               */
#define SCU_SFSP7_2_EZI_Msk                   (0x01UL << SCU_SFSP7_2_EZI_Pos)                         /*!< SCU SFSP7_2: EZI Mask                   */
#define SCU_SFSP7_2_ZIF_Pos                   7                                                       /*!< SCU SFSP7_2: ZIF Position               */
#define SCU_SFSP7_2_ZIF_Msk                   (0x01UL << SCU_SFSP7_2_ZIF_Pos)                         /*!< SCU SFSP7_2: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP7_3  -------------------------------- */
#define SCU_SFSP7_3_MODE_Pos                  0                                                       /*!< SCU SFSP7_3: MODE Position              */
#define SCU_SFSP7_3_MODE_Msk                  (0x07UL << SCU_SFSP7_3_MODE_Pos)                        /*!< SCU SFSP7_3: MODE Mask                  */
#define SCU_SFSP7_3_EPD_Pos                   3                                                       /*!< SCU SFSP7_3: EPD Position               */
#define SCU_SFSP7_3_EPD_Msk                   (0x01UL << SCU_SFSP7_3_EPD_Pos)                         /*!< SCU SFSP7_3: EPD Mask                   */
#define SCU_SFSP7_3_EPUN_Pos                  4                                                       /*!< SCU SFSP7_3: EPUN Position              */
#define SCU_SFSP7_3_EPUN_Msk                  (0x01UL << SCU_SFSP7_3_EPUN_Pos)                        /*!< SCU SFSP7_3: EPUN Mask                  */
#define SCU_SFSP7_3_EHS_Pos                   5                                                       /*!< SCU SFSP7_3: EHS Position               */
#define SCU_SFSP7_3_EHS_Msk                   (0x01UL << SCU_SFSP7_3_EHS_Pos)                         /*!< SCU SFSP7_3: EHS Mask                   */
#define SCU_SFSP7_3_EZI_Pos                   6                                                       /*!< SCU SFSP7_3: EZI Position               */
#define SCU_SFSP7_3_EZI_Msk                   (0x01UL << SCU_SFSP7_3_EZI_Pos)                         /*!< SCU SFSP7_3: EZI Mask                   */
#define SCU_SFSP7_3_ZIF_Pos                   7                                                       /*!< SCU SFSP7_3: ZIF Position               */
#define SCU_SFSP7_3_ZIF_Msk                   (0x01UL << SCU_SFSP7_3_ZIF_Pos)                         /*!< SCU SFSP7_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP7_4  -------------------------------- */
#define SCU_SFSP7_4_MODE_Pos                  0                                                       /*!< SCU SFSP7_4: MODE Position              */
#define SCU_SFSP7_4_MODE_Msk                  (0x07UL << SCU_SFSP7_4_MODE_Pos)                        /*!< SCU SFSP7_4: MODE Mask                  */
#define SCU_SFSP7_4_EPD_Pos                   3                                                       /*!< SCU SFSP7_4: EPD Position               */
#define SCU_SFSP7_4_EPD_Msk                   (0x01UL << SCU_SFSP7_4_EPD_Pos)                         /*!< SCU SFSP7_4: EPD Mask                   */
#define SCU_SFSP7_4_EPUN_Pos                  4                                                       /*!< SCU SFSP7_4: EPUN Position              */
#define SCU_SFSP7_4_EPUN_Msk                  (0x01UL << SCU_SFSP7_4_EPUN_Pos)                        /*!< SCU SFSP7_4: EPUN Mask                  */
#define SCU_SFSP7_4_EHS_Pos                   5                                                       /*!< SCU SFSP7_4: EHS Position               */
#define SCU_SFSP7_4_EHS_Msk                   (0x01UL << SCU_SFSP7_4_EHS_Pos)                         /*!< SCU SFSP7_4: EHS Mask                   */
#define SCU_SFSP7_4_EZI_Pos                   6                                                       /*!< SCU SFSP7_4: EZI Position               */
#define SCU_SFSP7_4_EZI_Msk                   (0x01UL << SCU_SFSP7_4_EZI_Pos)                         /*!< SCU SFSP7_4: EZI Mask                   */
#define SCU_SFSP7_4_ZIF_Pos                   7                                                       /*!< SCU SFSP7_4: ZIF Position               */
#define SCU_SFSP7_4_ZIF_Msk                   (0x01UL << SCU_SFSP7_4_ZIF_Pos)                         /*!< SCU SFSP7_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP7_5  -------------------------------- */
#define SCU_SFSP7_5_MODE_Pos                  0                                                       /*!< SCU SFSP7_5: MODE Position              */
#define SCU_SFSP7_5_MODE_Msk                  (0x07UL << SCU_SFSP7_5_MODE_Pos)                        /*!< SCU SFSP7_5: MODE Mask                  */
#define SCU_SFSP7_5_EPD_Pos                   3                                                       /*!< SCU SFSP7_5: EPD Position               */
#define SCU_SFSP7_5_EPD_Msk                   (0x01UL << SCU_SFSP7_5_EPD_Pos)                         /*!< SCU SFSP7_5: EPD Mask                   */
#define SCU_SFSP7_5_EPUN_Pos                  4                                                       /*!< SCU SFSP7_5: EPUN Position              */
#define SCU_SFSP7_5_EPUN_Msk                  (0x01UL << SCU_SFSP7_5_EPUN_Pos)                        /*!< SCU SFSP7_5: EPUN Mask                  */
#define SCU_SFSP7_5_EHS_Pos                   5                                                       /*!< SCU SFSP7_5: EHS Position               */
#define SCU_SFSP7_5_EHS_Msk                   (0x01UL << SCU_SFSP7_5_EHS_Pos)                         /*!< SCU SFSP7_5: EHS Mask                   */
#define SCU_SFSP7_5_EZI_Pos                   6                                                       /*!< SCU SFSP7_5: EZI Position               */
#define SCU_SFSP7_5_EZI_Msk                   (0x01UL << SCU_SFSP7_5_EZI_Pos)                         /*!< SCU SFSP7_5: EZI Mask                   */
#define SCU_SFSP7_5_ZIF_Pos                   7                                                       /*!< SCU SFSP7_5: ZIF Position               */
#define SCU_SFSP7_5_ZIF_Msk                   (0x01UL << SCU_SFSP7_5_ZIF_Pos)                         /*!< SCU SFSP7_5: ZIF Mask                   */

