roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSP8_6  -------------------------------- */
#define SCU_SFSP8_6_MODE_Pos                  0                                                       /*!< SCU SFSP8_6: MODE Position              */
#define SCU_SFSP8_6_MODE_Msk                  (0x07UL << SCU_SFSP8_6_MODE_Pos)                        /*!< SCU SFSP8_6: MODE Mask                  */
#define SCU_SFSP8_6_EPD_Pos                   3                                                       /*!< SCU SFSP8_6: EPD Position               */
#define SCU_SFSP8_6_EPD_Msk                   (0x01UL << SCU_SFSP8_6_EPD_Pos)                         /*!< SCU SFSP8_6: EPD Mask                   */
#define SCU_SFSP8_6_EPUN_Pos                  4                                                       /*!< SCU SFSP8_6: EPUN Position              */
#define SCU_SFSP8_6_EPUN_Msk                  (0x01UL << SCU_SFSP8_6_EPUN_Pos)                        /*!< SCU SFSP8_6: EPUN Mask                  */
#define SCU_SFSP8_6_EHS_Pos                   5                                                       /*!< SCU SFSP8_6: EHS Position               */
#define SCU_SFSP8_6_EHS_Msk                   (0x01UL << SCU_SFSP8_6_EHS_Pos)                         /*!< SCU SFSP8_6: EHS Mask                   */
#define SCU_SFSP8_6_EZI_Pos                   6                                                       /*!< SCU SFSP8_6: EZI Position               */
#define SCU_SFSP8_6_EZI_Msk                   (0x01UL << SCU_SFSP8_6_EZI_Pos)                         /*!< SCU SFSP8_6: EZI Mask                   */
#define SCU_SFSP8_6_ZIF_Pos                   7                                                       /*!< SCU SFSP8_6: ZIF Position               */
#define SCU_SFSP8_6_ZIF_Msk                   (0x01UL << SCU_SFSP8_6_ZIF_Pos)                         /*!< SCU SFSP8_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP8_7  -------------------------------- */
#define SCU_SFSP8_7_MODE_Pos                  0                                                       /*!< SCU SFSP8_7: MODE Position              */
#define SCU_SFSP8_7_MODE_Msk                  (0x07UL << SCU_SFSP8_7_MODE_Pos)                        /*!< SCU SFSP8_7: MODE Mask                  */
#define SCU_SFSP8_7_EPD_Pos                   3                                                       /*!< SCU SFSP8_7: EPD Position               */
#define SCU_SFSP8_7_EPD_Msk                   (0x01UL << SCU_SFSP8_7_EPD_Pos)                         /*!< SCU SFSP8_7: EPD Mask                   */
#define SCU_SFSP8_7_EPUN_Pos                  4                                                       /*!< SCU SFSP8_7: EPUN Position              */
#define SCU_SFSP8_7_EPUN_Msk                  (0x01UL << SCU_SFSP8_7_EPUN_Pos)                        /*!< SCU SFSP8_7: EPUN Mask                  */
#define SCU_SFSP8_7_EHS_Pos                   5                                                       /*!< SCU SFSP8_7: EHS Position               */
#define SCU_SFSP8_7_EHS_Msk                   (0x01UL << SCU_SFSP8_7_EHS_Pos)                         /*!< SCU SFSP8_7: EHS Mask                   */
#define SCU_SFSP8_7_EZI_Pos                   6                                                       /*!< SCU SFSP8_7: EZI Position               */
#define SCU_SFSP8_7_EZI_Msk                   (0x01UL << SCU_SFSP8_7_EZI_Pos)                         /*!< SCU SFSP8_7: EZI Mask                   */
#define SCU_SFSP8_7_ZIF_Pos                   7                                                       /*!< SCU SFSP8_7: ZIF Position               */
#define SCU_SFSP8_7_ZIF_Msk                   (0x01UL << SCU_SFSP8_7_ZIF_Pos)                         /*!< SCU SFSP8_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP8_8  -------------------------------- */
#define SCU_SFSP8_8_MODE_Pos                  0                                                       /*!< SCU SFSP8_8: MODE Position              */
#define SCU_SFSP8_8_MODE_Msk                  (0x07UL << SCU_SFSP8_8_MODE_Pos)                        /*!< SCU SFSP8_8: MODE Mask                  */
#define SCU_SFSP8_8_EPD_Pos                   3                                                       /*!< SCU SFSP8_8: EPD Position               */
#define SCU_SFSP8_8_EPD_Msk                   (0x01UL << SCU_SFSP8_8_EPD_Pos)                         /*!< SCU SFSP8_8: EPD Mask                   */
#define SCU_SFSP8_8_EPUN_Pos                  4                                                       /*!< SCU SFSP8_8: EPUN Position              */
#define SCU_SFSP8_8_EPUN_Msk                  (0x01UL << SCU_SFSP8_8_EPUN_Pos)                        /*!< SCU SFSP8_8: EPUN Mask                  */
#define SCU_SFSP8_8_EHS_Pos                   5                                                       /*!< SCU SFSP8_8: EHS Position               */
#define SCU_SFSP8_8_EHS_Msk                   (0x01UL << SCU_SFSP8_8_EHS_Pos)                         /*!< SCU SFSP8_8: EHS Mask                   */
#define SCU_SFSP8_8_EZI_Pos                   6                                                       /*!< SCU SFSP8_8: EZI Position               */
#define SCU_SFSP8_8_EZI_Msk                   (0x01UL << SCU_SFSP8_8_EZI_Pos)                         /*!< SCU SFSP8_8: EZI Mask                   */
#define SCU_SFSP8_8_ZIF_Pos                   7                                                       /*!< SCU SFSP8_8: ZIF Position               */
#define SCU_SFSP8_8_ZIF_Msk                   (0x01UL << SCU_SFSP8_8_ZIF_Pos)                         /*!< SCU SFSP8_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSP9_0  -------------------------------- */
#define SCU_SFSP9_0_MODE_Pos                  0                                                       /*!< SCU SFSP9_0: MODE Position              */
#define SCU_SFSP9_0_MODE_Msk                  (0x07UL << SCU_SFSP9_0_MODE_Pos)                        /*!< SCU SFSP9_0: MODE Mask                  */
#define SCU_SFSP9_0_EPD_Pos                   3                                                       /*!< SCU SFSP9_0: EPD Position               */
#define SCU_SFSP9_0_EPD_Msk                   (0x01UL << SCU_SFSP9_0_EPD_Pos)                         /*!< SCU SFSP9_0: EPD Mask                   */
#define SCU_SFSP9_0_EPUN_Pos                  4                                                       /*!< SCU SFSP9_0: EPUN Position              */
#define SCU_SFSP9_0_EPUN_Msk                  (0x01UL << SCU_SFSP9_0_EPUN_Pos)                        /*!< SCU SFSP9_0: EPUN Mask                  */
#define SCU_SFSP9_0_EHS_Pos                   5                                                       /*!< SCU SFSP9_0: EHS Position               */
#define SCU_SFSP9_0_EHS_Msk                   (0x01UL << SCU_SFSP9_0_EHS_Pos)                         /*!< SCU SFSP9_0: EHS Mask                   */
#define SCU_SFSP9_0_EZI_Pos                   6                                                       /*!< SCU SFSP9_0: EZI Position               */
#define SCU_SFSP9_0_EZI_Msk                   (0x01UL << SCU_SFSP9_0_EZI_Pos)                         /*!< SCU SFSP9_0: EZI Mask                   */
#define SCU_SFSP9_0_EHD_Pos                   8                                                       /*!< SCU SFSP9_0: EHD Position               */
#define SCU_SFSP9_0_EHD_Msk                   (0x03UL << SCU_SFSP9_0_EHD_Pos)                         /*!< SCU SFSP9_0: EHD Mask                   */

/* ---------------------------------  SCU_SFSP9_1  -------------------------------- */
#define SCU_SFSP9_1_MODE_Pos                  0                                                       /*!< SCU SFSP9_1: MODE Position              */
#define SCU_SFSP9_1_MODE_Msk                  (0x07UL << SCU_SFSP9_1_MODE_Pos)                        /*!< SCU SFSP9_1: MODE Mask                  */
#define SCU_SFSP9_1_EPD_Pos                   3                                                       /*!< SCU SFSP9_1: EPD Position               */
#define SCU_SFSP9_1_EPD_Msk                   (0x01UL << SCU_SFSP9_1_EPD_Pos)                         /*!< SCU SFSP9_1: EPD Mask                   */
#define SCU_SFSP9_1_EPUN_Pos                  4                                                       /*!< SCU SFSP9_1: EPUN Position              */
#define SCU_SFSP9_1_EPUN_Msk                  (0x01UL << SCU_SFSP9_1_EPUN_Pos)                        /*!< SCU SFSP9_1: EPUN Mask                  */
#define SCU_SFSP9_1_EHS_Pos                   5                                                       /*!< SCU SFSP9_1: EHS Position               */
#define SCU_SFSP9_1_EHS_Msk                   (0x01UL << SCU_SFSP9_1_EHS_Pos)                         /*!< SCU SFSP9_1: EHS Mask                   */
#define SCU_SFSP9_1_EZI_Pos                   6                                                       /*!< SCU SFSP9_1: EZI Position               */
#define SCU_SFSP9_1_EZI_Msk                   (0x01UL << SCU_SFSP9_1_EZI_Pos)                         /*!< SCU SFSP9_1: EZI Mask                   */
#define SCU_SFSP9_1_EHD_Pos                   8                                                       /*!< SCU SFSP9_1: EHD Position               */
#define SCU_SFSP9_1_EHD_Msk                   (0x03UL << SCU_SFSP9_1_EHD_Pos)                         /*!< SCU SFSP9_1: EHD Mask                   */

