roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSPA_3  -------------------------------- */
#define SCU_SFSPA_3_MODE_Pos                  0                                                       /*!< SCU SFSPA_3: MODE Position              */
#define SCU_SFSPA_3_MODE_Msk                  (0x07UL << SCU_SFSPA_3_MODE_Pos)                        /*!< SCU SFSPA_3: MODE Mask                  */
#define SCU_SFSPA_3_EPD_Pos                   3                                                       /*!< SCU SFSPA_3: EPD Position               */
#define SCU_SFSPA_3_EPD_Msk                   (0x01UL << SCU_SFSPA_3_EPD_Pos)                         /*!< SCU SFSPA_3: EPD Mask                   */
#define SCU_SFSPA_3_EPUN_Pos                  4                                                       /*!< SCU SFSPA_3: EPUN Position              */
#define SCU_SFSPA_3_EPUN_Msk                  (0x01UL << SCU_SFSPA_3_EPUN_Pos)                        /*!< SCU SFSPA_3: EPUN Mask                  */
#define SCU_SFSPA_3_EZI_Pos                   6                                                       /*!< SCU SFSPA_3: EZI Position               */
#define SCU_SFSPA_3_EZI_Msk                   (0x01UL << SCU_SFSPA_3_EZI_Pos)                         /*!< SCU SFSPA_3: EZI Mask                   */
#define SCU_SFSPA_3_ZIF_Pos                   7                                                       /*!< SCU SFSPA_3: ZIF Position               */
#define SCU_SFSPA_3_ZIF_Msk                   (0x01UL << SCU_SFSPA_3_ZIF_Pos)                         /*!< SCU SFSPA_3: ZIF Mask                   */
#define SCU_SFSPA_3_EHD_Pos                   8                                                       /*!< SCU SFSPA_3: EHD Position               */
#define SCU_SFSPA_3_EHD_Msk                   (0x03UL << SCU_SFSPA_3_EHD_Pos)                         /*!< SCU SFSPA_3: EHD Mask                   */

/* ---------------------------------  SCU_SFSPA_4  -------------------------------- */
#define SCU_SFSPA_4_MODE_Pos                  0                                                       /*!< SCU SFSPA_4: MODE Position              */
#define SCU_SFSPA_4_MODE_Msk                  (0x07UL << SCU_SFSPA_4_MODE_Pos)                        /*!< SCU SFSPA_4: MODE Mask                  */
#define SCU_SFSPA_4_EPD_Pos                   3                                                       /*!< SCU SFSPA_4: EPD Position               */
#define SCU_SFSPA_4_EPD_Msk                   (0x01UL << SCU_SFSPA_4_EPD_Pos)                         /*!< SCU SFSPA_4: EPD Mask                   */
#define SCU_SFSPA_4_EPUN_Pos                  4                                                       /*!< SCU SFSPA_4: EPUN Position              */
#define SCU_SFSPA_4_EPUN_Msk                  (0x01UL << SCU_SFSPA_4_EPUN_Pos)                        /*!< SCU SFSPA_4: EPUN Mask                  */
#define SCU_SFSPA_4_EHS_Pos                   5                                                       /*!< SCU SFSPA_4: EHS Position               */
#define SCU_SFSPA_4_EHS_Msk                   (0x01UL << SCU_SFSPA_4_EHS_Pos)                         /*!< SCU SFSPA_4: EHS Mask                   */
#define SCU_SFSPA_4_EZI_Pos                   6                                                       /*!< SCU SFSPA_4: EZI Position               */
#define SCU_SFSPA_4_EZI_Msk                   (0x01UL << SCU_SFSPA_4_EZI_Pos)                         /*!< SCU SFSPA_4: EZI Mask                   */
#define SCU_SFSPA_4_ZIF_Pos                   7                                                       /*!< SCU SFSPA_4: ZIF Position               */
#define SCU_SFSPA_4_ZIF_Msk                   (0x01UL << SCU_SFSPA_4_ZIF_Pos)                         /*!< SCU SFSPA_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPB_0  -------------------------------- */
#define SCU_SFSPB_0_MODE_Pos                  0                                                       /*!< SCU SFSPB_0: MODE Position              */
#define SCU_SFSPB_0_MODE_Msk                  (0x07UL << SCU_SFSPB_0_MODE_Pos)                        /*!< SCU SFSPB_0: MODE Mask                  */
#define SCU_SFSPB_0_EPD_Pos                   3                                                       /*!< SCU SFSPB_0: EPD Position               */
#define SCU_SFSPB_0_EPD_Msk                   (0x01UL << SCU_SFSPB_0_EPD_Pos)                         /*!< SCU SFSPB_0: EPD Mask                   */
#define SCU_SFSPB_0_EPUN_Pos                  4                                                       /*!< SCU SFSPB_0: EPUN Position              */
#define SCU_SFSPB_0_EPUN_Msk                  (0x01UL << SCU_SFSPB_0_EPUN_Pos)                        /*!< SCU SFSPB_0: EPUN Mask                  */
#define SCU_SFSPB_0_EHS_Pos                   5                                                       /*!< SCU SFSPB_0: EHS Position               */
#define SCU_SFSPB_0_EHS_Msk                   (0x01UL << SCU_SFSPB_0_EHS_Pos)                         /*!< SCU SFSPB_0: EHS Mask                   */
#define SCU_SFSPB_0_EZI_Pos                   6                                                       /*!< SCU SFSPB_0: EZI Position               */
#define SCU_SFSPB_0_EZI_Msk                   (0x01UL << SCU_SFSPB_0_EZI_Pos)                         /*!< SCU SFSPB_0: EZI Mask                   */
#define SCU_SFSPB_0_ZIF_Pos                   7                                                       /*!< SCU SFSPB_0: ZIF Position               */
#define SCU_SFSPB_0_ZIF_Msk                   (0x01UL << SCU_SFSPB_0_ZIF_Pos)                         /*!< SCU SFSPB_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPB_1  -------------------------------- */
#define SCU_SFSPB_1_MODE_Pos                  0                                                       /*!< SCU SFSPB_1: MODE Position              */
#define SCU_SFSPB_1_MODE_Msk                  (0x07UL << SCU_SFSPB_1_MODE_Pos)                        /*!< SCU SFSPB_1: MODE Mask                  */
#define SCU_SFSPB_1_EPD_Pos                   3                                                       /*!< SCU SFSPB_1: EPD Position               */
#define SCU_SFSPB_1_EPD_Msk                   (0x01UL << SCU_SFSPB_1_EPD_Pos)                         /*!< SCU SFSPB_1: EPD Mask                   */
#define SCU_SFSPB_1_EPUN_Pos                  4                                                       /*!< SCU SFSPB_1: EPUN Position              */
#define SCU_SFSPB_1_EPUN_Msk                  (0x01UL << SCU_SFSPB_1_EPUN_Pos)                        /*!< SCU SFSPB_1: EPUN Mask                  */
#define SCU_SFSPB_1_EHS_Pos                   5                                                       /*!< SCU SFSPB_1: EHS Position               */
#define SCU_SFSPB_1_EHS_Msk                   (0x01UL << SCU_SFSPB_1_EHS_Pos)                         /*!< SCU SFSPB_1: EHS Mask                   */
#define SCU_SFSPB_1_EZI_Pos                   6                                                       /*!< SCU SFSPB_1: EZI Position               */
#define SCU_SFSPB_1_EZI_Msk                   (0x01UL << SCU_SFSPB_1_EZI_Pos)                         /*!< SCU SFSPB_1: EZI Mask                   */
#define SCU_SFSPB_1_ZIF_Pos                   7                                                       /*!< SCU SFSPB_1: ZIF Position               */
#define SCU_SFSPB_1_ZIF_Msk                   (0x01UL << SCU_SFSPB_1_ZIF_Pos)                         /*!< SCU SFSPB_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPB_2  -------------------------------- */
#define SCU_SFSPB_2_MODE_Pos                  0                                                       /*!< SCU SFSPB_2: MODE Position              */
#define SCU_SFSPB_2_MODE_Msk                  (0x07UL << SCU_SFSPB_2_MODE_Pos)                        /*!< SCU SFSPB_2: MODE Mask                  */
#define SCU_SFSPB_2_EPD_Pos                   3                                                       /*!< SCU SFSPB_2: EPD Position               */
#define SCU_SFSPB_2_EPD_Msk                   (0x01UL << SCU_SFSPB_2_EPD_Pos)                         /*!< SCU SFSPB_2: EPD Mask                   */
#define SCU_SFSPB_2_EPUN_Pos                  4                                                       /*!< SCU SFSPB_2: EPUN Position              */
#define SCU_SFSPB_2_EPUN_Msk                  (0x01UL << SCU_SFSPB_2_EPUN_Pos)                        /*!< SCU SFSPB_2: EPUN Mask                  */
#define SCU_SFSPB_2_EHS_Pos                   5                                                       /*!< SCU SFSPB_2: EHS Position               */
#define SCU_SFSPB_2_EHS_Msk                   (0x01UL << SCU_SFSPB_2_EHS_Pos)                         /*!< SCU SFSPB_2: EHS Mask                   */
#define SCU_SFSPB_2_EZI_Pos                   6                                                       /*!< SCU SFSPB_2: EZI Position               */
#define SCU_SFSPB_2_EZI_Msk                   (0x01UL << SCU_SFSPB_2_EZI_Pos)                         /*!< SCU SFSPB_2: EZI Mask                   */
#define SCU_SFSPB_2_ZIF_Pos                   7                                                       /*!< SCU SFSPB_2: ZIF Position               */
#define SCU_SFSPB_2_ZIF_Msk                   (0x01UL << SCU_SFSPB_2_ZIF_Pos)                         /*!< SCU SFSPB_2: ZIF Mask                   */

