roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSPC_7  -------------------------------- */
#define SCU_SFSPC_7_MODE_Pos                  0                                                       /*!< SCU SFSPC_7: MODE Position              */
#define SCU_SFSPC_7_MODE_Msk                  (0x07UL << SCU_SFSPC_7_MODE_Pos)                        /*!< SCU SFSPC_7: MODE Mask                  */
#define SCU_SFSPC_7_EPD_Pos                   3                                                       /*!< SCU SFSPC_7: EPD Position               */
#define SCU_SFSPC_7_EPD_Msk                   (0x01UL << SCU_SFSPC_7_EPD_Pos)                         /*!< SCU SFSPC_7: EPD Mask                   */
#define SCU_SFSPC_7_EPUN_Pos                  4                                                       /*!< SCU SFSPC_7: EPUN Position              */
#define SCU_SFSPC_7_EPUN_Msk                  (0x01UL << SCU_SFSPC_7_EPUN_Pos)                        /*!< SCU SFSPC_7: EPUN Mask                  */
#define SCU_SFSPC_7_EHS_Pos                   5                                                       /*!< SCU SFSPC_7: EHS Position               */
#define SCU_SFSPC_7_EHS_Msk                   (0x01UL << SCU_SFSPC_7_EHS_Pos)                         /*!< SCU SFSPC_7: EHS Mask                   */
#define SCU_SFSPC_7_EZI_Pos                   6                                                       /*!< SCU SFSPC_7: EZI Position               */
#define SCU_SFSPC_7_EZI_Msk                   (0x01UL << SCU_SFSPC_7_EZI_Pos)                         /*!< SCU SFSPC_7: EZI Mask                   */
#define SCU_SFSPC_7_ZIF_Pos                   7                                                       /*!< SCU SFSPC_7: ZIF Position               */
#define SCU_SFSPC_7_ZIF_Msk                   (0x01UL << SCU_SFSPC_7_ZIF_Pos)                         /*!< SCU SFSPC_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_8  -------------------------------- */
#define SCU_SFSPC_8_MODE_Pos                  0                                                       /*!< SCU SFSPC_8: MODE Position              */
#define SCU_SFSPC_8_MODE_Msk                  (0x07UL << SCU_SFSPC_8_MODE_Pos)                        /*!< SCU SFSPC_8: MODE Mask                  */
#define SCU_SFSPC_8_EPD_Pos                   3                                                       /*!< SCU SFSPC_8: EPD Position               */
#define SCU_SFSPC_8_EPD_Msk                   (0x01UL << SCU_SFSPC_8_EPD_Pos)                         /*!< SCU SFSPC_8: EPD Mask                   */
#define SCU_SFSPC_8_EPUN_Pos                  4                                                       /*!< SCU SFSPC_8: EPUN Position              */
#define SCU_SFSPC_8_EPUN_Msk                  (0x01UL << SCU_SFSPC_8_EPUN_Pos)                        /*!< SCU SFSPC_8: EPUN Mask                  */
#define SCU_SFSPC_8_EHS_Pos                   5                                                       /*!< SCU SFSPC_8: EHS Position               */
#define SCU_SFSPC_8_EHS_Msk                   (0x01UL << SCU_SFSPC_8_EHS_Pos)                         /*!< SCU SFSPC_8: EHS Mask                   */
#define SCU_SFSPC_8_EZI_Pos                   6                                                       /*!< SCU SFSPC_8: EZI Position               */
#define SCU_SFSPC_8_EZI_Msk                   (0x01UL << SCU_SFSPC_8_EZI_Pos)                         /*!< SCU SFSPC_8: EZI Mask                   */
#define SCU_SFSPC_8_ZIF_Pos                   7                                                       /*!< SCU SFSPC_8: ZIF Position               */
#define SCU_SFSPC_8_ZIF_Msk                   (0x01UL << SCU_SFSPC_8_ZIF_Pos)                         /*!< SCU SFSPC_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPC_9  -------------------------------- */
#define SCU_SFSPC_9_MODE_Pos                  0                                                       /*!< SCU SFSPC_9: MODE Position              */
#define SCU_SFSPC_9_MODE_Msk                  (0x07UL << SCU_SFSPC_9_MODE_Pos)                        /*!< SCU SFSPC_9: MODE Mask                  */
#define SCU_SFSPC_9_EPD_Pos                   3                                                       /*!< SCU SFSPC_9: EPD Position               */
#define SCU_SFSPC_9_EPD_Msk                   (0x01UL << SCU_SFSPC_9_EPD_Pos)                         /*!< SCU SFSPC_9: EPD Mask                   */
#define SCU_SFSPC_9_EPUN_Pos                  4                                                       /*!< SCU SFSPC_9: EPUN Position              */
#define SCU_SFSPC_9_EPUN_Msk                  (0x01UL << SCU_SFSPC_9_EPUN_Pos)                        /*!< SCU SFSPC_9: EPUN Mask                  */
#define SCU_SFSPC_9_EHS_Pos                   5                                                       /*!< SCU SFSPC_9: EHS Position               */
#define SCU_SFSPC_9_EHS_Msk                   (0x01UL << SCU_SFSPC_9_EHS_Pos)                         /*!< SCU SFSPC_9: EHS Mask                   */
#define SCU_SFSPC_9_EZI_Pos                   6                                                       /*!< SCU SFSPC_9: EZI Position               */
#define SCU_SFSPC_9_EZI_Msk                   (0x01UL << SCU_SFSPC_9_EZI_Pos)                         /*!< SCU SFSPC_9: EZI Mask                   */
#define SCU_SFSPC_9_ZIF_Pos                   7                                                       /*!< SCU SFSPC_9: ZIF Position               */
#define SCU_SFSPC_9_ZIF_Msk                   (0x01UL << SCU_SFSPC_9_ZIF_Pos)                         /*!< SCU SFSPC_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSPC_10  -------------------------------- */
#define SCU_SFSPC_10_MODE_Pos                 0                                                       /*!< SCU SFSPC_10: MODE Position             */
#define SCU_SFSPC_10_MODE_Msk                 (0x07UL << SCU_SFSPC_10_MODE_Pos)                       /*!< SCU SFSPC_10: MODE Mask                 */
#define SCU_SFSPC_10_EPD_Pos                  3                                                       /*!< SCU SFSPC_10: EPD Position              */
#define SCU_SFSPC_10_EPD_Msk                  (0x01UL << SCU_SFSPC_10_EPD_Pos)                        /*!< SCU SFSPC_10: EPD Mask                  */
#define SCU_SFSPC_10_EPUN_Pos                 4                                                       /*!< SCU SFSPC_10: EPUN Position             */
#define SCU_SFSPC_10_EPUN_Msk                 (0x01UL << SCU_SFSPC_10_EPUN_Pos)                       /*!< SCU SFSPC_10: EPUN Mask                 */
#define SCU_SFSPC_10_EHS_Pos                  5                                                       /*!< SCU SFSPC_10: EHS Position              */
#define SCU_SFSPC_10_EHS_Msk                  (0x01UL << SCU_SFSPC_10_EHS_Pos)                        /*!< SCU SFSPC_10: EHS Mask                  */
#define SCU_SFSPC_10_EZI_Pos                  6                                                       /*!< SCU SFSPC_10: EZI Position              */
#define SCU_SFSPC_10_EZI_Msk                  (0x01UL << SCU_SFSPC_10_EZI_Pos)                        /*!< SCU SFSPC_10: EZI Mask                  */
#define SCU_SFSPC_10_ZIF_Pos                  7                                                       /*!< SCU SFSPC_10: ZIF Position              */
#define SCU_SFSPC_10_ZIF_Msk                  (0x01UL << SCU_SFSPC_10_ZIF_Pos)                        /*!< SCU SFSPC_10: ZIF Mask                  */

/* --------------------------------  SCU_SFSPC_11  -------------------------------- */
#define SCU_SFSPC_11_MODE_Pos                 0                                                       /*!< SCU SFSPC_11: MODE Position             */
#define SCU_SFSPC_11_MODE_Msk                 (0x07UL << SCU_SFSPC_11_MODE_Pos)                       /*!< SCU SFSPC_11: MODE Mask                 */
#define SCU_SFSPC_11_EPD_Pos                  3                                                       /*!< SCU SFSPC_11: EPD Position              */
#define SCU_SFSPC_11_EPD_Msk                  (0x01UL << SCU_SFSPC_11_EPD_Pos)                        /*!< SCU SFSPC_11: EPD Mask                  */
#define SCU_SFSPC_11_EPUN_Pos                 4                                                       /*!< SCU SFSPC_11: EPUN Position             */
#define SCU_SFSPC_11_EPUN_Msk                 (0x01UL << SCU_SFSPC_11_EPUN_Pos)                       /*!< SCU SFSPC_11: EPUN Mask                 */
#define SCU_SFSPC_11_EHS_Pos                  5                                                       /*!< SCU SFSPC_11: EHS Position              */
#define SCU_SFSPC_11_EHS_Msk                  (0x01UL << SCU_SFSPC_11_EHS_Pos)                        /*!< SCU SFSPC_11: EHS Mask                  */
#define SCU_SFSPC_11_EZI_Pos                  6                                                       /*!< SCU SFSPC_11: EZI Position              */
#define SCU_SFSPC_11_EZI_Msk                  (0x01UL << SCU_SFSPC_11_EZI_Pos)                        /*!< SCU SFSPC_11: EZI Mask                  */
#define SCU_SFSPC_11_ZIF_Pos                  7                                                       /*!< SCU SFSPC_11: ZIF Position              */
#define SCU_SFSPC_11_ZIF_Msk                  (0x01UL << SCU_SFSPC_11_ZIF_Pos)                        /*!< SCU SFSPC_11: ZIF Mask                  */

/* --------------------------------  SCU_SFSPC_12  -------------------------------- */
#define SCU_SFSPC_12_MODE_Pos                 0                                                       /*!< SCU SFSPC_12: MODE Position             */
#define SCU_SFSPC_12_MODE_Msk                 (0x07UL << SCU_SFSPC_12_MODE_Pos)                       /*!< SCU SFSPC_12: MODE Mask                 */
#define SCU_SFSPC_12_EPD_Pos                  3                                                       /*!< SCU SFSPC_12: EPD Position              */
#define SCU_SFSPC_12_EPD_Msk                  (0x01UL << SCU_SFSPC_12_EPD_Pos)                        /*!< SCU SFSPC_12: EPD Mask                  */
#define SCU_SFSPC_12_EPUN_Pos                 4                                                       /*!< SCU SFSPC_12: EPUN Position             */
#define SCU_SFSPC_12_EPUN_Msk                 (0x01UL << SCU_SFSPC_12_EPUN_Pos)                       /*!< SCU SFSPC_12: EPUN Mask                 */
#define SCU_SFSPC_12_EHS_Pos                  5                                                       /*!< SCU SFSPC_12: EHS Position              */
#define SCU_SFSPC_12_EHS_Msk                  (0x01UL << SCU_SFSPC_12_EHS_Pos)                        /*!< SCU SFSPC_12: EHS Mask                  */
#define SCU_SFSPC_12_EZI_Pos                  6                                                       /*!< SCU SFSPC_12: EZI Position              */
#define SCU_SFSPC_12_EZI_Msk                  (0x01UL << SCU_SFSPC_12_EZI_Pos)                        /*!< SCU SFSPC_12: EZI Mask                  */
#define SCU_SFSPC_12_ZIF_Pos                  7                                                       /*!< SCU SFSPC_12: ZIF Position              */
#define SCU_SFSPC_12_ZIF_Msk                  (0x01UL << SCU_SFSPC_12_ZIF_Pos)                        /*!< SCU SFSPC_12: ZIF Mask                  */

