roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCU_SFSPC_13  -------------------------------- */
#define SCU_SFSPC_13_MODE_Pos                 0                                                       /*!< SCU SFSPC_13: MODE Position             */
#define SCU_SFSPC_13_MODE_Msk                 (0x07UL << SCU_SFSPC_13_MODE_Pos)                       /*!< SCU SFSPC_13: MODE Mask                 */
#define SCU_SFSPC_13_EPD_Pos                  3                                                       /*!< SCU SFSPC_13: EPD Position              */
#define SCU_SFSPC_13_EPD_Msk                  (0x01UL << SCU_SFSPC_13_EPD_Pos)                        /*!< SCU SFSPC_13: EPD Mask                  */
#define SCU_SFSPC_13_EPUN_Pos                 4                                                       /*!< SCU SFSPC_13: EPUN Position             */
#define SCU_SFSPC_13_EPUN_Msk                 (0x01UL << SCU_SFSPC_13_EPUN_Pos)                       /*!< SCU SFSPC_13: EPUN Mask                 */
#define SCU_SFSPC_13_EHS_Pos                  5                                                       /*!< SCU SFSPC_13: EHS Position              */
#define SCU_SFSPC_13_EHS_Msk                  (0x01UL << SCU_SFSPC_13_EHS_Pos)                        /*!< SCU SFSPC_13: EHS Mask                  */
#define SCU_SFSPC_13_EZI_Pos                  6                                                       /*!< SCU SFSPC_13: EZI Position              */
#define SCU_SFSPC_13_EZI_Msk                  (0x01UL << SCU_SFSPC_13_EZI_Pos)                        /*!< SCU SFSPC_13: EZI Mask                  */
#define SCU_SFSPC_13_ZIF_Pos                  7                                                       /*!< SCU SFSPC_13: ZIF Position              */
#define SCU_SFSPC_13_ZIF_Msk                  (0x01UL << SCU_SFSPC_13_ZIF_Pos)                        /*!< SCU SFSPC_13: ZIF Mask                  */

/* --------------------------------  SCU_SFSPC_14  -------------------------------- */
#define SCU_SFSPC_14_MODE_Pos                 0                                                       /*!< SCU SFSPC_14: MODE Position             */
#define SCU_SFSPC_14_MODE_Msk                 (0x07UL << SCU_SFSPC_14_MODE_Pos)                       /*!< SCU SFSPC_14: MODE Mask                 */
#define SCU_SFSPC_14_EPD_Pos                  3                                                       /*!< SCU SFSPC_14: EPD Position              */
#define SCU_SFSPC_14_EPD_Msk                  (0x01UL << SCU_SFSPC_14_EPD_Pos)                        /*!< SCU SFSPC_14: EPD Mask                  */
#define SCU_SFSPC_14_EPUN_Pos                 4                                                       /*!< SCU SFSPC_14: EPUN Position             */
#define SCU_SFSPC_14_EPUN_Msk                 (0x01UL << SCU_SFSPC_14_EPUN_Pos)                       /*!< SCU SFSPC_14: EPUN Mask                 */
#define SCU_SFSPC_14_EHS_Pos                  5                                                       /*!< SCU SFSPC_14: EHS Position              */
#define SCU_SFSPC_14_EHS_Msk                  (0x01UL << SCU_SFSPC_14_EHS_Pos)                        /*!< SCU SFSPC_14: EHS Mask                  */
#define SCU_SFSPC_14_EZI_Pos                  6                                                       /*!< SCU SFSPC_14: EZI Position              */
#define SCU_SFSPC_14_EZI_Msk                  (0x01UL << SCU_SFSPC_14_EZI_Pos)                        /*!< SCU SFSPC_14: EZI Mask                  */
#define SCU_SFSPC_14_ZIF_Pos                  7                                                       /*!< SCU SFSPC_14: ZIF Position              */
#define SCU_SFSPC_14_ZIF_Msk                  (0x01UL << SCU_SFSPC_14_ZIF_Pos)                        /*!< SCU SFSPC_14: ZIF Mask                  */

/* ---------------------------------  SCU_SFSPD_0  -------------------------------- */
#define SCU_SFSPD_0_MODE_Pos                  0                                                       /*!< SCU SFSPD_0: MODE Position              */
#define SCU_SFSPD_0_MODE_Msk                  (0x07UL << SCU_SFSPD_0_MODE_Pos)                        /*!< SCU SFSPD_0: MODE Mask                  */
#define SCU_SFSPD_0_EPD_Pos                   3                                                       /*!< SCU SFSPD_0: EPD Position               */
#define SCU_SFSPD_0_EPD_Msk                   (0x01UL << SCU_SFSPD_0_EPD_Pos)                         /*!< SCU SFSPD_0: EPD Mask                   */
#define SCU_SFSPD_0_EPUN_Pos                  4                                                       /*!< SCU SFSPD_0: EPUN Position              */
#define SCU_SFSPD_0_EPUN_Msk                  (0x01UL << SCU_SFSPD_0_EPUN_Pos)                        /*!< SCU SFSPD_0: EPUN Mask                  */
#define SCU_SFSPD_0_EHS_Pos                   5                                                       /*!< SCU SFSPD_0: EHS Position               */
#define SCU_SFSPD_0_EHS_Msk                   (0x01UL << SCU_SFSPD_0_EHS_Pos)                         /*!< SCU SFSPD_0: EHS Mask                   */
#define SCU_SFSPD_0_EZI_Pos                   6                                                       /*!< SCU SFSPD_0: EZI Position               */
#define SCU_SFSPD_0_EZI_Msk                   (0x01UL << SCU_SFSPD_0_EZI_Pos)                         /*!< SCU SFSPD_0: EZI Mask                   */
#define SCU_SFSPD_0_ZIF_Pos                   7                                                       /*!< SCU SFSPD_0: ZIF Position               */
#define SCU_SFSPD_0_ZIF_Msk                   (0x01UL << SCU_SFSPD_0_ZIF_Pos)                         /*!< SCU SFSPD_0: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_1  -------------------------------- */
#define SCU_SFSPD_1_MODE_Pos                  0                                                       /*!< SCU SFSPD_1: MODE Position              */
#define SCU_SFSPD_1_MODE_Msk                  (0x07UL << SCU_SFSPD_1_MODE_Pos)                        /*!< SCU SFSPD_1: MODE Mask                  */
#define SCU_SFSPD_1_EPD_Pos                   3                                                       /*!< SCU SFSPD_1: EPD Position               */
#define SCU_SFSPD_1_EPD_Msk                   (0x01UL << SCU_SFSPD_1_EPD_Pos)                         /*!< SCU SFSPD_1: EPD Mask                   */
#define SCU_SFSPD_1_EPUN_Pos                  4                                                       /*!< SCU SFSPD_1: EPUN Position              */
#define SCU_SFSPD_1_EPUN_Msk                  (0x01UL << SCU_SFSPD_1_EPUN_Pos)                        /*!< SCU SFSPD_1: EPUN Mask                  */
#define SCU_SFSPD_1_EHS_Pos                   5                                                       /*!< SCU SFSPD_1: EHS Position               */
#define SCU_SFSPD_1_EHS_Msk                   (0x01UL << SCU_SFSPD_1_EHS_Pos)                         /*!< SCU SFSPD_1: EHS Mask                   */
#define SCU_SFSPD_1_EZI_Pos                   6                                                       /*!< SCU SFSPD_1: EZI Position               */
#define SCU_SFSPD_1_EZI_Msk                   (0x01UL << SCU_SFSPD_1_EZI_Pos)                         /*!< SCU SFSPD_1: EZI Mask                   */
#define SCU_SFSPD_1_ZIF_Pos                   7                                                       /*!< SCU SFSPD_1: ZIF Position               */
#define SCU_SFSPD_1_ZIF_Msk                   (0x01UL << SCU_SFSPD_1_ZIF_Pos)                         /*!< SCU SFSPD_1: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_2  -------------------------------- */
#define SCU_SFSPD_2_MODE_Pos                  0                                                       /*!< SCU SFSPD_2: MODE Position              */
#define SCU_SFSPD_2_MODE_Msk                  (0x07UL << SCU_SFSPD_2_MODE_Pos)                        /*!< SCU SFSPD_2: MODE Mask                  */
#define SCU_SFSPD_2_EPD_Pos                   3                                                       /*!< SCU SFSPD_2: EPD Position               */
#define SCU_SFSPD_2_EPD_Msk                   (0x01UL << SCU_SFSPD_2_EPD_Pos)                         /*!< SCU SFSPD_2: EPD Mask                   */
#define SCU_SFSPD_2_EPUN_Pos                  4                                                       /*!< SCU SFSPD_2: EPUN Position              */
#define SCU_SFSPD_2_EPUN_Msk                  (0x01UL << SCU_SFSPD_2_EPUN_Pos)                        /*!< SCU SFSPD_2: EPUN Mask                  */
#define SCU_SFSPD_2_EHS_Pos                   5                                                       /*!< SCU SFSPD_2: EHS Position               */
#define SCU_SFSPD_2_EHS_Msk                   (0x01UL << SCU_SFSPD_2_EHS_Pos)                         /*!< SCU SFSPD_2: EHS Mask                   */
#define SCU_SFSPD_2_EZI_Pos                   6                                                       /*!< SCU SFSPD_2: EZI Position               */
#define SCU_SFSPD_2_EZI_Msk                   (0x01UL << SCU_SFSPD_2_EZI_Pos)                         /*!< SCU SFSPD_2: EZI Mask                   */
#define SCU_SFSPD_2_ZIF_Pos                   7                                                       /*!< SCU SFSPD_2: ZIF Position               */
#define SCU_SFSPD_2_ZIF_Msk                   (0x01UL << SCU_SFSPD_2_ZIF_Pos)                         /*!< SCU SFSPD_2: ZIF Mask                   */

