roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSPD_3  -------------------------------- */
#define SCU_SFSPD_3_MODE_Pos                  0                                                       /*!< SCU SFSPD_3: MODE Position              */
#define SCU_SFSPD_3_MODE_Msk                  (0x07UL << SCU_SFSPD_3_MODE_Pos)                        /*!< SCU SFSPD_3: MODE Mask                  */
#define SCU_SFSPD_3_EPD_Pos                   3                                                       /*!< SCU SFSPD_3: EPD Position               */
#define SCU_SFSPD_3_EPD_Msk                   (0x01UL << SCU_SFSPD_3_EPD_Pos)                         /*!< SCU SFSPD_3: EPD Mask                   */
#define SCU_SFSPD_3_EPUN_Pos                  4                                                       /*!< SCU SFSPD_3: EPUN Position              */
#define SCU_SFSPD_3_EPUN_Msk                  (0x01UL << SCU_SFSPD_3_EPUN_Pos)                        /*!< SCU SFSPD_3: EPUN Mask                  */
#define SCU_SFSPD_3_EHS_Pos                   5                                                       /*!< SCU SFSPD_3: EHS Position               */
#define SCU_SFSPD_3_EHS_Msk                   (0x01UL << SCU_SFSPD_3_EHS_Pos)                         /*!< SCU SFSPD_3: EHS Mask                   */
#define SCU_SFSPD_3_EZI_Pos                   6                                                       /*!< SCU SFSPD_3: EZI Position               */
#define SCU_SFSPD_3_EZI_Msk                   (0x01UL << SCU_SFSPD_3_EZI_Pos)                         /*!< SCU SFSPD_3: EZI Mask                   */
#define SCU_SFSPD_3_ZIF_Pos                   7                                                       /*!< SCU SFSPD_3: ZIF Position               */
#define SCU_SFSPD_3_ZIF_Msk                   (0x01UL << SCU_SFSPD_3_ZIF_Pos)                         /*!< SCU SFSPD_3: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_4  -------------------------------- */
#define SCU_SFSPD_4_MODE_Pos                  0                                                       /*!< SCU SFSPD_4: MODE Position              */
#define SCU_SFSPD_4_MODE_Msk                  (0x07UL << SCU_SFSPD_4_MODE_Pos)                        /*!< SCU SFSPD_4: MODE Mask                  */
#define SCU_SFSPD_4_EPD_Pos                   3                                                       /*!< SCU SFSPD_4: EPD Position               */
#define SCU_SFSPD_4_EPD_Msk                   (0x01UL << SCU_SFSPD_4_EPD_Pos)                         /*!< SCU SFSPD_4: EPD Mask                   */
#define SCU_SFSPD_4_EPUN_Pos                  4                                                       /*!< SCU SFSPD_4: EPUN Position              */
#define SCU_SFSPD_4_EPUN_Msk                  (0x01UL << SCU_SFSPD_4_EPUN_Pos)                        /*!< SCU SFSPD_4: EPUN Mask                  */
#define SCU_SFSPD_4_EHS_Pos                   5                                                       /*!< SCU SFSPD_4: EHS Position               */
#define SCU_SFSPD_4_EHS_Msk                   (0x01UL << SCU_SFSPD_4_EHS_Pos)                         /*!< SCU SFSPD_4: EHS Mask                   */
#define SCU_SFSPD_4_EZI_Pos                   6                                                       /*!< SCU SFSPD_4: EZI Position               */
#define SCU_SFSPD_4_EZI_Msk                   (0x01UL << SCU_SFSPD_4_EZI_Pos)                         /*!< SCU SFSPD_4: EZI Mask                   */
#define SCU_SFSPD_4_ZIF_Pos                   7                                                       /*!< SCU SFSPD_4: ZIF Position               */
#define SCU_SFSPD_4_ZIF_Msk                   (0x01UL << SCU_SFSPD_4_ZIF_Pos)                         /*!< SCU SFSPD_4: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_5  -------------------------------- */
#define SCU_SFSPD_5_MODE_Pos                  0                                                       /*!< SCU SFSPD_5: MODE Position              */
#define SCU_SFSPD_5_MODE_Msk                  (0x07UL << SCU_SFSPD_5_MODE_Pos)                        /*!< SCU SFSPD_5: MODE Mask                  */
#define SCU_SFSPD_5_EPD_Pos                   3                                                       /*!< SCU SFSPD_5: EPD Position               */
#define SCU_SFSPD_5_EPD_Msk                   (0x01UL << SCU_SFSPD_5_EPD_Pos)                         /*!< SCU SFSPD_5: EPD Mask                   */
#define SCU_SFSPD_5_EPUN_Pos                  4                                                       /*!< SCU SFSPD_5: EPUN Position              */
#define SCU_SFSPD_5_EPUN_Msk                  (0x01UL << SCU_SFSPD_5_EPUN_Pos)                        /*!< SCU SFSPD_5: EPUN Mask                  */
#define SCU_SFSPD_5_EHS_Pos                   5                                                       /*!< SCU SFSPD_5: EHS Position               */
#define SCU_SFSPD_5_EHS_Msk                   (0x01UL << SCU_SFSPD_5_EHS_Pos)                         /*!< SCU SFSPD_5: EHS Mask                   */
#define SCU_SFSPD_5_EZI_Pos                   6                                                       /*!< SCU SFSPD_5: EZI Position               */
#define SCU_SFSPD_5_EZI_Msk                   (0x01UL << SCU_SFSPD_5_EZI_Pos)                         /*!< SCU SFSPD_5: EZI Mask                   */
#define SCU_SFSPD_5_ZIF_Pos                   7                                                       /*!< SCU SFSPD_5: ZIF Position               */
#define SCU_SFSPD_5_ZIF_Msk                   (0x01UL << SCU_SFSPD_5_ZIF_Pos)                         /*!< SCU SFSPD_5: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_6  -------------------------------- */
#define SCU_SFSPD_6_MODE_Pos                  0                                                       /*!< SCU SFSPD_6: MODE Position              */
#define SCU_SFSPD_6_MODE_Msk                  (0x07UL << SCU_SFSPD_6_MODE_Pos)                        /*!< SCU SFSPD_6: MODE Mask                  */
#define SCU_SFSPD_6_EPD_Pos                   3                                                       /*!< SCU SFSPD_6: EPD Position               */
#define SCU_SFSPD_6_EPD_Msk                   (0x01UL << SCU_SFSPD_6_EPD_Pos)                         /*!< SCU SFSPD_6: EPD Mask                   */
#define SCU_SFSPD_6_EPUN_Pos                  4                                                       /*!< SCU SFSPD_6: EPUN Position              */
#define SCU_SFSPD_6_EPUN_Msk                  (0x01UL << SCU_SFSPD_6_EPUN_Pos)                        /*!< SCU SFSPD_6: EPUN Mask                  */
#define SCU_SFSPD_6_EHS_Pos                   5                                                       /*!< SCU SFSPD_6: EHS Position               */
#define SCU_SFSPD_6_EHS_Msk                   (0x01UL << SCU_SFSPD_6_EHS_Pos)                         /*!< SCU SFSPD_6: EHS Mask                   */
#define SCU_SFSPD_6_EZI_Pos                   6                                                       /*!< SCU SFSPD_6: EZI Position               */
#define SCU_SFSPD_6_EZI_Msk                   (0x01UL << SCU_SFSPD_6_EZI_Pos)                         /*!< SCU SFSPD_6: EZI Mask                   */
#define SCU_SFSPD_6_ZIF_Pos                   7                                                       /*!< SCU SFSPD_6: ZIF Position               */
#define SCU_SFSPD_6_ZIF_Msk                   (0x01UL << SCU_SFSPD_6_ZIF_Pos)                         /*!< SCU SFSPD_6: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_7  -------------------------------- */
#define SCU_SFSPD_7_MODE_Pos                  0                                                       /*!< SCU SFSPD_7: MODE Position              */
#define SCU_SFSPD_7_MODE_Msk                  (0x07UL << SCU_SFSPD_7_MODE_Pos)                        /*!< SCU SFSPD_7: MODE Mask                  */
#define SCU_SFSPD_7_EPD_Pos                   3                                                       /*!< SCU SFSPD_7: EPD Position               */
#define SCU_SFSPD_7_EPD_Msk                   (0x01UL << SCU_SFSPD_7_EPD_Pos)                         /*!< SCU SFSPD_7: EPD Mask                   */
#define SCU_SFSPD_7_EPUN_Pos                  4                                                       /*!< SCU SFSPD_7: EPUN Position              */
#define SCU_SFSPD_7_EPUN_Msk                  (0x01UL << SCU_SFSPD_7_EPUN_Pos)                        /*!< SCU SFSPD_7: EPUN Mask                  */
#define SCU_SFSPD_7_EHS_Pos                   5                                                       /*!< SCU SFSPD_7: EHS Position               */
#define SCU_SFSPD_7_EHS_Msk                   (0x01UL << SCU_SFSPD_7_EHS_Pos)                         /*!< SCU SFSPD_7: EHS Mask                   */
#define SCU_SFSPD_7_EZI_Pos                   6                                                       /*!< SCU SFSPD_7: EZI Position               */
#define SCU_SFSPD_7_EZI_Msk                   (0x01UL << SCU_SFSPD_7_EZI_Pos)                         /*!< SCU SFSPD_7: EZI Mask                   */
#define SCU_SFSPD_7_ZIF_Pos                   7                                                       /*!< SCU SFSPD_7: ZIF Position               */
#define SCU_SFSPD_7_ZIF_Msk                   (0x01UL << SCU_SFSPD_7_ZIF_Pos)                         /*!< SCU SFSPD_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_8  -------------------------------- */
#define SCU_SFSPD_8_MODE_Pos                  0                                                       /*!< SCU SFSPD_8: MODE Position              */
#define SCU_SFSPD_8_MODE_Msk                  (0x07UL << SCU_SFSPD_8_MODE_Pos)                        /*!< SCU SFSPD_8: MODE Mask                  */
#define SCU_SFSPD_8_EPD_Pos                   3                                                       /*!< SCU SFSPD_8: EPD Position               */
#define SCU_SFSPD_8_EPD_Msk                   (0x01UL << SCU_SFSPD_8_EPD_Pos)                         /*!< SCU SFSPD_8: EPD Mask                   */
#define SCU_SFSPD_8_EPUN_Pos                  4                                                       /*!< SCU SFSPD_8: EPUN Position              */
#define SCU_SFSPD_8_EPUN_Msk                  (0x01UL << SCU_SFSPD_8_EPUN_Pos)                        /*!< SCU SFSPD_8: EPUN Mask                  */
#define SCU_SFSPD_8_EHS_Pos                   5                                                       /*!< SCU SFSPD_8: EHS Position               */
#define SCU_SFSPD_8_EHS_Msk                   (0x01UL << SCU_SFSPD_8_EHS_Pos)                         /*!< SCU SFSPD_8: EHS Mask                   */
#define SCU_SFSPD_8_EZI_Pos                   6                                                       /*!< SCU SFSPD_8: EZI Position               */
#define SCU_SFSPD_8_EZI_Msk                   (0x01UL << SCU_SFSPD_8_EZI_Pos)                         /*!< SCU SFSPD_8: EZI Mask                   */
#define SCU_SFSPD_8_ZIF_Pos                   7                                                       /*!< SCU SFSPD_8: ZIF Position               */
#define SCU_SFSPD_8_ZIF_Msk                   (0x01UL << SCU_SFSPD_8_ZIF_Pos)                         /*!< SCU SFSPD_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPD_9  -------------------------------- */
#define SCU_SFSPD_9_MODE_Pos                  0                                                       /*!< SCU SFSPD_9: MODE Position              */
#define SCU_SFSPD_9_MODE_Msk                  (0x07UL << SCU_SFSPD_9_MODE_Pos)                        /*!< SCU SFSPD_9: MODE Mask                  */
#define SCU_SFSPD_9_EPD_Pos                   3                                                       /*!< SCU SFSPD_9: EPD Position               */
#define SCU_SFSPD_9_EPD_Msk                   (0x01UL << SCU_SFSPD_9_EPD_Pos)                         /*!< SCU SFSPD_9: EPD Mask                   */
#define SCU_SFSPD_9_EPUN_Pos                  4                                                       /*!< SCU SFSPD_9: EPUN Position              */
#define SCU_SFSPD_9_EPUN_Msk                  (0x01UL << SCU_SFSPD_9_EPUN_Pos)                        /*!< SCU SFSPD_9: EPUN Mask                  */
#define SCU_SFSPD_9_EHS_Pos                   5                                                       /*!< SCU SFSPD_9: EHS Position               */
#define SCU_SFSPD_9_EHS_Msk                   (0x01UL << SCU_SFSPD_9_EHS_Pos)                         /*!< SCU SFSPD_9: EHS Mask                   */
#define SCU_SFSPD_9_EZI_Pos                   6                                                       /*!< SCU SFSPD_9: EZI Position               */
#define SCU_SFSPD_9_EZI_Msk                   (0x01UL << SCU_SFSPD_9_EZI_Pos)                         /*!< SCU SFSPD_9: EZI Mask                   */
#define SCU_SFSPD_9_ZIF_Pos                   7                                                       /*!< SCU SFSPD_9: ZIF Position               */
#define SCU_SFSPD_9_ZIF_Msk                   (0x01UL << SCU_SFSPD_9_ZIF_Pos)                         /*!< SCU SFSPD_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSPD_10  -------------------------------- */
#define SCU_SFSPD_10_MODE_Pos                 0                                                       /*!< SCU SFSPD_10: MODE Position             */
#define SCU_SFSPD_10_MODE_Msk                 (0x07UL << SCU_SFSPD_10_MODE_Pos)                       /*!< SCU SFSPD_10: MODE Mask                 */
#define SCU_SFSPD_10_EPD_Pos                  3                                                       /*!< SCU SFSPD_10: EPD Position              */
#define SCU_SFSPD_10_EPD_Msk                  (0x01UL << SCU_SFSPD_10_EPD_Pos)                        /*!< SCU SFSPD_10: EPD Mask                  */
#define SCU_SFSPD_10_EPUN_Pos                 4                                                       /*!< SCU SFSPD_10: EPUN Position             */
#define SCU_SFSPD_10_EPUN_Msk                 (0x01UL << SCU_SFSPD_10_EPUN_Pos)                       /*!< SCU SFSPD_10: EPUN Mask                 */
#define SCU_SFSPD_10_EHS_Pos                  5                                                       /*!< SCU SFSPD_10: EHS Position              */
#define SCU_SFSPD_10_EHS_Msk                  (0x01UL << SCU_SFSPD_10_EHS_Pos)                        /*!< SCU SFSPD_10: EHS Mask                  */
#define SCU_SFSPD_10_EZI_Pos                  6                                                       /*!< SCU SFSPD_10: EZI Position              */
#define SCU_SFSPD_10_EZI_Msk                  (0x01UL << SCU_SFSPD_10_EZI_Pos)                        /*!< SCU SFSPD_10: EZI Mask                  */
#define SCU_SFSPD_10_ZIF_Pos                  7                                                       /*!< SCU SFSPD_10: ZIF Position              */
#define SCU_SFSPD_10_ZIF_Msk                  (0x01UL << SCU_SFSPD_10_ZIF_Pos)                        /*!< SCU SFSPD_10: ZIF Mask                  */

/* --------------------------------  SCU_SFSPD_11  -------------------------------- */
#define SCU_SFSPD_11_MODE_Pos                 0                                                       /*!< SCU SFSPD_11: MODE Position             */
#define SCU_SFSPD_11_MODE_Msk                 (0x07UL << SCU_SFSPD_11_MODE_Pos)                       /*!< SCU SFSPD_11: MODE Mask                 */
#define SCU_SFSPD_11_EPD_Pos                  3                                                       /*!< SCU SFSPD_11: EPD Position              */
#define SCU_SFSPD_11_EPD_Msk                  (0x01UL << SCU_SFSPD_11_EPD_Pos)                        /*!< SCU SFSPD_11: EPD Mask                  */
#define SCU_SFSPD_11_EPUN_Pos                 4                                                       /*!< SCU SFSPD_11: EPUN Position             */
#define SCU_SFSPD_11_EPUN_Msk                 (0x01UL << SCU_SFSPD_11_EPUN_Pos)                       /*!< SCU SFSPD_11: EPUN Mask                 */
#define SCU_SFSPD_11_EHS_Pos                  5                                                       /*!< SCU SFSPD_11: EHS Position              */
#define SCU_SFSPD_11_EHS_Msk                  (0x01UL << SCU_SFSPD_11_EHS_Pos)                        /*!< SCU SFSPD_11: EHS Mask                  */
#define SCU_SFSPD_11_EZI_Pos                  6                                                       /*!< SCU SFSPD_11: EZI Position              */
#define SCU_SFSPD_11_EZI_Msk                  (0x01UL << SCU_SFSPD_11_EZI_Pos)                        /*!< SCU SFSPD_11: EZI Mask                  */
#define SCU_SFSPD_11_ZIF_Pos                  7                                                       /*!< SCU SFSPD_11: ZIF Position              */
#define SCU_SFSPD_11_ZIF_Msk                  (0x01UL << SCU_SFSPD_11_ZIF_Pos)                        /*!< SCU SFSPD_11: ZIF Mask                  */

/* --------------------------------  SCU_SFSPD_12  -------------------------------- */
#define SCU_SFSPD_12_MODE_Pos                 0                                                       /*!< SCU SFSPD_12: MODE Position             */
#define SCU_SFSPD_12_MODE_Msk                 (0x07UL << SCU_SFSPD_12_MODE_Pos)                       /*!< SCU SFSPD_12: MODE Mask                 */
#define SCU_SFSPD_12_EPD_Pos                  3                                                       /*!< SCU SFSPD_12: EPD Position              */
#define SCU_SFSPD_12_EPD_Msk                  (0x01UL << SCU_SFSPD_12_EPD_Pos)                        /*!< SCU SFSPD_12: EPD Mask                  */
#define SCU_SFSPD_12_EPUN_Pos                 4                                                       /*!< SCU SFSPD_12: EPUN Position             */
#define SCU_SFSPD_12_EPUN_Msk                 (0x01UL << SCU_SFSPD_12_EPUN_Pos)                       /*!< SCU SFSPD_12: EPUN Mask                 */
#define SCU_SFSPD_12_EHS_Pos                  5                                                       /*!< SCU SFSPD_12: EHS Position              */
#define SCU_SFSPD_12_EHS_Msk                  (0x01UL << SCU_SFSPD_12_EHS_Pos)                        /*!< SCU SFSPD_12: EHS Mask                  */
#define SCU_SFSPD_12_EZI_Pos                  6                                                       /*!< SCU SFSPD_12: EZI Position              */
#define SCU_SFSPD_12_EZI_Msk                  (0x01UL << SCU_SFSPD_12_EZI_Pos)                        /*!< SCU SFSPD_12: EZI Mask                  */
#define SCU_SFSPD_12_ZIF_Pos                  7                                                       /*!< SCU SFSPD_12: ZIF Position              */
#define SCU_SFSPD_12_ZIF_Msk                  (0x01UL << SCU_SFSPD_12_ZIF_Pos)                        /*!< SCU SFSPD_12: ZIF Mask                  */

