roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSPE_7  -------------------------------- */
#define SCU_SFSPE_7_MODE_Pos                  0                                                       /*!< SCU SFSPE_7: MODE Position              */
#define SCU_SFSPE_7_MODE_Msk                  (0x07UL << SCU_SFSPE_7_MODE_Pos)                        /*!< SCU SFSPE_7: MODE Mask                  */
#define SCU_SFSPE_7_EPD_Pos                   3                                                       /*!< SCU SFSPE_7: EPD Position               */
#define SCU_SFSPE_7_EPD_Msk                   (0x01UL << SCU_SFSPE_7_EPD_Pos)                         /*!< SCU SFSPE_7: EPD Mask                   */
#define SCU_SFSPE_7_EPUN_Pos                  4                                                       /*!< SCU SFSPE_7: EPUN Position              */
#define SCU_SFSPE_7_EPUN_Msk                  (0x01UL << SCU_SFSPE_7_EPUN_Pos)                        /*!< SCU SFSPE_7: EPUN Mask                  */
#define SCU_SFSPE_7_EHS_Pos                   5                                                       /*!< SCU SFSPE_7: EHS Position               */
#define SCU_SFSPE_7_EHS_Msk                   (0x01UL << SCU_SFSPE_7_EHS_Pos)                         /*!< SCU SFSPE_7: EHS Mask                   */
#define SCU_SFSPE_7_EZI_Pos                   6                                                       /*!< SCU SFSPE_7: EZI Position               */
#define SCU_SFSPE_7_EZI_Msk                   (0x01UL << SCU_SFSPE_7_EZI_Pos)                         /*!< SCU SFSPE_7: EZI Mask                   */
#define SCU_SFSPE_7_ZIF_Pos                   7                                                       /*!< SCU SFSPE_7: ZIF Position               */
#define SCU_SFSPE_7_ZIF_Msk                   (0x01UL << SCU_SFSPE_7_ZIF_Pos)                         /*!< SCU SFSPE_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPE_8  -------------------------------- */
#define SCU_SFSPE_8_MODE_Pos                  0                                                       /*!< SCU SFSPE_8: MODE Position              */
#define SCU_SFSPE_8_MODE_Msk                  (0x07UL << SCU_SFSPE_8_MODE_Pos)                        /*!< SCU SFSPE_8: MODE Mask                  */
#define SCU_SFSPE_8_EPD_Pos                   3                                                       /*!< SCU SFSPE_8: EPD Position               */
#define SCU_SFSPE_8_EPD_Msk                   (0x01UL << SCU_SFSPE_8_EPD_Pos)                         /*!< SCU SFSPE_8: EPD Mask                   */
#define SCU_SFSPE_8_EPUN_Pos                  4                                                       /*!< SCU SFSPE_8: EPUN Position              */
#define SCU_SFSPE_8_EPUN_Msk                  (0x01UL << SCU_SFSPE_8_EPUN_Pos)                        /*!< SCU SFSPE_8: EPUN Mask                  */
#define SCU_SFSPE_8_EHS_Pos                   5                                                       /*!< SCU SFSPE_8: EHS Position               */
#define SCU_SFSPE_8_EHS_Msk                   (0x01UL << SCU_SFSPE_8_EHS_Pos)                         /*!< SCU SFSPE_8: EHS Mask                   */
#define SCU_SFSPE_8_EZI_Pos                   6                                                       /*!< SCU SFSPE_8: EZI Position               */
#define SCU_SFSPE_8_EZI_Msk                   (0x01UL << SCU_SFSPE_8_EZI_Pos)                         /*!< SCU SFSPE_8: EZI Mask                   */
#define SCU_SFSPE_8_ZIF_Pos                   7                                                       /*!< SCU SFSPE_8: ZIF Position               */
#define SCU_SFSPE_8_ZIF_Msk                   (0x01UL << SCU_SFSPE_8_ZIF_Pos)                         /*!< SCU SFSPE_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPE_9  -------------------------------- */
#define SCU_SFSPE_9_MODE_Pos                  0                                                       /*!< SCU SFSPE_9: MODE Position              */
#define SCU_SFSPE_9_MODE_Msk                  (0x07UL << SCU_SFSPE_9_MODE_Pos)                        /*!< SCU SFSPE_9: MODE Mask                  */
#define SCU_SFSPE_9_EPD_Pos                   3                                                       /*!< SCU SFSPE_9: EPD Position               */
#define SCU_SFSPE_9_EPD_Msk                   (0x01UL << SCU_SFSPE_9_EPD_Pos)                         /*!< SCU SFSPE_9: EPD Mask                   */
#define SCU_SFSPE_9_EPUN_Pos                  4                                                       /*!< SCU SFSPE_9: EPUN Position              */
#define SCU_SFSPE_9_EPUN_Msk                  (0x01UL << SCU_SFSPE_9_EPUN_Pos)                        /*!< SCU SFSPE_9: EPUN Mask                  */
#define SCU_SFSPE_9_EHS_Pos                   5                                                       /*!< SCU SFSPE_9: EHS Position               */
#define SCU_SFSPE_9_EHS_Msk                   (0x01UL << SCU_SFSPE_9_EHS_Pos)                         /*!< SCU SFSPE_9: EHS Mask                   */
#define SCU_SFSPE_9_EZI_Pos                   6                                                       /*!< SCU SFSPE_9: EZI Position               */
#define SCU_SFSPE_9_EZI_Msk                   (0x01UL << SCU_SFSPE_9_EZI_Pos)                         /*!< SCU SFSPE_9: EZI Mask                   */
#define SCU_SFSPE_9_ZIF_Pos                   7                                                       /*!< SCU SFSPE_9: ZIF Position               */
#define SCU_SFSPE_9_ZIF_Msk                   (0x01UL << SCU_SFSPE_9_ZIF_Pos)                         /*!< SCU SFSPE_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSPE_10  -------------------------------- */
#define SCU_SFSPE_10_MODE_Pos                 0                                                       /*!< SCU SFSPE_10: MODE Position             */
#define SCU_SFSPE_10_MODE_Msk                 (0x07UL << SCU_SFSPE_10_MODE_Pos)                       /*!< SCU SFSPE_10: MODE Mask                 */
#define SCU_SFSPE_10_EPD_Pos                  3                                                       /*!< SCU SFSPE_10: EPD Position              */
#define SCU_SFSPE_10_EPD_Msk                  (0x01UL << SCU_SFSPE_10_EPD_Pos)                        /*!< SCU SFSPE_10: EPD Mask                  */
#define SCU_SFSPE_10_EPUN_Pos                 4                                                       /*!< SCU SFSPE_10: EPUN Position             */
#define SCU_SFSPE_10_EPUN_Msk                 (0x01UL << SCU_SFSPE_10_EPUN_Pos)                       /*!< SCU SFSPE_10: EPUN Mask                 */
#define SCU_SFSPE_10_EHS_Pos                  5                                                       /*!< SCU SFSPE_10: EHS Position              */
#define SCU_SFSPE_10_EHS_Msk                  (0x01UL << SCU_SFSPE_10_EHS_Pos)                        /*!< SCU SFSPE_10: EHS Mask                  */
#define SCU_SFSPE_10_EZI_Pos                  6                                                       /*!< SCU SFSPE_10: EZI Position              */
#define SCU_SFSPE_10_EZI_Msk                  (0x01UL << SCU_SFSPE_10_EZI_Pos)                        /*!< SCU SFSPE_10: EZI Mask                  */
#define SCU_SFSPE_10_ZIF_Pos                  7                                                       /*!< SCU SFSPE_10: ZIF Position              */
#define SCU_SFSPE_10_ZIF_Msk                  (0x01UL << SCU_SFSPE_10_ZIF_Pos)                        /*!< SCU SFSPE_10: ZIF Mask                  */

