roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCU_SFSPE_11  -------------------------------- */
#define SCU_SFSPE_11_MODE_Pos                 0                                                       /*!< SCU SFSPE_11: MODE Position             */
#define SCU_SFSPE_11_MODE_Msk                 (0x07UL << SCU_SFSPE_11_MODE_Pos)                       /*!< SCU SFSPE_11: MODE Mask                 */
#define SCU_SFSPE_11_EPD_Pos                  3                                                       /*!< SCU SFSPE_11: EPD Position              */
#define SCU_SFSPE_11_EPD_Msk                  (0x01UL << SCU_SFSPE_11_EPD_Pos)                        /*!< SCU SFSPE_11: EPD Mask                  */
#define SCU_SFSPE_11_EPUN_Pos                 4                                                       /*!< SCU SFSPE_11: EPUN Position             */
#define SCU_SFSPE_11_EPUN_Msk                 (0x01UL << SCU_SFSPE_11_EPUN_Pos)                       /*!< SCU SFSPE_11: EPUN Mask                 */
#define SCU_SFSPE_11_EHS_Pos                  5                                                       /*!< SCU SFSPE_11: EHS Position              */
#define SCU_SFSPE_11_EHS_Msk                  (0x01UL << SCU_SFSPE_11_EHS_Pos)                        /*!< SCU SFSPE_11: EHS Mask                  */
#define SCU_SFSPE_11_EZI_Pos                  6                                                       /*!< SCU SFSPE_11: EZI Position              */
#define SCU_SFSPE_11_EZI_Msk                  (0x01UL << SCU_SFSPE_11_EZI_Pos)                        /*!< SCU SFSPE_11: EZI Mask                  */
#define SCU_SFSPE_11_ZIF_Pos                  7                                                       /*!< SCU SFSPE_11: ZIF Position              */
#define SCU_SFSPE_11_ZIF_Msk                  (0x01UL << SCU_SFSPE_11_ZIF_Pos)                        /*!< SCU SFSPE_11: ZIF Mask                  */

/* --------------------------------  SCU_SFSPE_12  -------------------------------- */
#define SCU_SFSPE_12_MODE_Pos                 0                                                       /*!< SCU SFSPE_12: MODE Position             */
#define SCU_SFSPE_12_MODE_Msk                 (0x07UL << SCU_SFSPE_12_MODE_Pos)                       /*!< SCU SFSPE_12: MODE Mask                 */
#define SCU_SFSPE_12_EPD_Pos                  3                                                       /*!< SCU SFSPE_12: EPD Position              */
#define SCU_SFSPE_12_EPD_Msk                  (0x01UL << SCU_SFSPE_12_EPD_Pos)                        /*!< SCU SFSPE_12: EPD Mask                  */
#define SCU_SFSPE_12_EPUN_Pos                 4                                                       /*!< SCU SFSPE_12: EPUN Position             */
#define SCU_SFSPE_12_EPUN_Msk                 (0x01UL << SCU_SFSPE_12_EPUN_Pos)                       /*!< SCU SFSPE_12: EPUN Mask                 */
#define SCU_SFSPE_12_EHS_Pos                  5                                                       /*!< SCU SFSPE_12: EHS Position              */
#define SCU_SFSPE_12_EHS_Msk                  (0x01UL << SCU_SFSPE_12_EHS_Pos)                        /*!< SCU SFSPE_12: EHS Mask                  */
#define SCU_SFSPE_12_EZI_Pos                  6                                                       /*!< SCU SFSPE_12: EZI Position              */
#define SCU_SFSPE_12_EZI_Msk                  (0x01UL << SCU_SFSPE_12_EZI_Pos)                        /*!< SCU SFSPE_12: EZI Mask                  */
#define SCU_SFSPE_12_ZIF_Pos                  7                                                       /*!< SCU SFSPE_12: ZIF Position              */
#define SCU_SFSPE_12_ZIF_Msk                  (0x01UL << SCU_SFSPE_12_ZIF_Pos)                        /*!< SCU SFSPE_12: ZIF Mask                  */

/* --------------------------------  SCU_SFSPE_13  -------------------------------- */
#define SCU_SFSPE_13_MODE_Pos                 0                                                       /*!< SCU SFSPE_13: MODE Position             */
#define SCU_SFSPE_13_MODE_Msk                 (0x07UL << SCU_SFSPE_13_MODE_Pos)                       /*!< SCU SFSPE_13: MODE Mask                 */
#define SCU_SFSPE_13_EPD_Pos                  3                                                       /*!< SCU SFSPE_13: EPD Position              */
#define SCU_SFSPE_13_EPD_Msk                  (0x01UL << SCU_SFSPE_13_EPD_Pos)                        /*!< SCU SFSPE_13: EPD Mask                  */
#define SCU_SFSPE_13_EPUN_Pos                 4                                                       /*!< SCU SFSPE_13: EPUN Position             */
#define SCU_SFSPE_13_EPUN_Msk                 (0x01UL << SCU_SFSPE_13_EPUN_Pos)                       /*!< SCU SFSPE_13: EPUN Mask                 */
#define SCU_SFSPE_13_EHS_Pos                  5                                                       /*!< SCU SFSPE_13: EHS Position              */
#define SCU_SFSPE_13_EHS_Msk                  (0x01UL << SCU_SFSPE_13_EHS_Pos)                        /*!< SCU SFSPE_13: EHS Mask                  */
#define SCU_SFSPE_13_EZI_Pos                  6                                                       /*!< SCU SFSPE_13: EZI Position              */
#define SCU_SFSPE_13_EZI_Msk                  (0x01UL << SCU_SFSPE_13_EZI_Pos)                        /*!< SCU SFSPE_13: EZI Mask                  */
#define SCU_SFSPE_13_ZIF_Pos                  7                                                       /*!< SCU SFSPE_13: ZIF Position              */
#define SCU_SFSPE_13_ZIF_Msk                  (0x01UL << SCU_SFSPE_13_ZIF_Pos)                        /*!< SCU SFSPE_13: ZIF Mask                  */

/* --------------------------------  SCU_SFSPE_14  -------------------------------- */
#define SCU_SFSPE_14_MODE_Pos                 0                                                       /*!< SCU SFSPE_14: MODE Position             */
#define SCU_SFSPE_14_MODE_Msk                 (0x07UL << SCU_SFSPE_14_MODE_Pos)                       /*!< SCU SFSPE_14: MODE Mask                 */
#define SCU_SFSPE_14_EPD_Pos                  3                                                       /*!< SCU SFSPE_14: EPD Position              */
#define SCU_SFSPE_14_EPD_Msk                  (0x01UL << SCU_SFSPE_14_EPD_Pos)                        /*!< SCU SFSPE_14: EPD Mask                  */
#define SCU_SFSPE_14_EPUN_Pos                 4                                                       /*!< SCU SFSPE_14: EPUN Position             */
#define SCU_SFSPE_14_EPUN_Msk                 (0x01UL << SCU_SFSPE_14_EPUN_Pos)                       /*!< SCU SFSPE_14: EPUN Mask                 */
#define SCU_SFSPE_14_EHS_Pos                  5                                                       /*!< SCU SFSPE_14: EHS Position              */
#define SCU_SFSPE_14_EHS_Msk                  (0x01UL << SCU_SFSPE_14_EHS_Pos)                        /*!< SCU SFSPE_14: EHS Mask                  */
#define SCU_SFSPE_14_EZI_Pos                  6                                                       /*!< SCU SFSPE_14: EZI Position              */
#define SCU_SFSPE_14_EZI_Msk                  (0x01UL << SCU_SFSPE_14_EZI_Pos)                        /*!< SCU SFSPE_14: EZI Mask                  */
#define SCU_SFSPE_14_ZIF_Pos                  7                                                       /*!< SCU SFSPE_14: ZIF Position              */
#define SCU_SFSPE_14_ZIF_Msk                  (0x01UL << SCU_SFSPE_14_ZIF_Pos)                        /*!< SCU SFSPE_14: ZIF Mask                  */

/* --------------------------------  SCU_SFSPE_15  -------------------------------- */
#define SCU_SFSPE_15_MODE_Pos                 0                                                       /*!< SCU SFSPE_15: MODE Position             */
#define SCU_SFSPE_15_MODE_Msk                 (0x07UL << SCU_SFSPE_15_MODE_Pos)                       /*!< SCU SFSPE_15: MODE Mask                 */
#define SCU_SFSPE_15_EPD_Pos                  3                                                       /*!< SCU SFSPE_15: EPD Position              */
#define SCU_SFSPE_15_EPD_Msk                  (0x01UL << SCU_SFSPE_15_EPD_Pos)                        /*!< SCU SFSPE_15: EPD Mask                  */
#define SCU_SFSPE_15_EPUN_Pos                 4                                                       /*!< SCU SFSPE_15: EPUN Position             */
#define SCU_SFSPE_15_EPUN_Msk                 (0x01UL << SCU_SFSPE_15_EPUN_Pos)                       /*!< SCU SFSPE_15: EPUN Mask                 */
#define SCU_SFSPE_15_EHS_Pos                  5                                                       /*!< SCU SFSPE_15: EHS Position              */
#define SCU_SFSPE_15_EHS_Msk                  (0x01UL << SCU_SFSPE_15_EHS_Pos)                        /*!< SCU SFSPE_15: EHS Mask                  */
#define SCU_SFSPE_15_EZI_Pos                  6                                                       /*!< SCU SFSPE_15: EZI Position              */
#define SCU_SFSPE_15_EZI_Msk                  (0x01UL << SCU_SFSPE_15_EZI_Pos)                        /*!< SCU SFSPE_15: EZI Mask                  */
#define SCU_SFSPE_15_ZIF_Pos                  7                                                       /*!< SCU SFSPE_15: ZIF Position              */
#define SCU_SFSPE_15_ZIF_Msk                  (0x01UL << SCU_SFSPE_15_ZIF_Pos)                        /*!< SCU SFSPE_15: ZIF Mask                  */

