roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  SCU_SFSPF_7  -------------------------------- */
#define SCU_SFSPF_7_MODE_Pos                  0                                                       /*!< SCU SFSPF_7: MODE Position              */
#define SCU_SFSPF_7_MODE_Msk                  (0x07UL << SCU_SFSPF_7_MODE_Pos)                        /*!< SCU SFSPF_7: MODE Mask                  */
#define SCU_SFSPF_7_EPD_Pos                   3                                                       /*!< SCU SFSPF_7: EPD Position               */
#define SCU_SFSPF_7_EPD_Msk                   (0x01UL << SCU_SFSPF_7_EPD_Pos)                         /*!< SCU SFSPF_7: EPD Mask                   */
#define SCU_SFSPF_7_EPUN_Pos                  4                                                       /*!< SCU SFSPF_7: EPUN Position              */
#define SCU_SFSPF_7_EPUN_Msk                  (0x01UL << SCU_SFSPF_7_EPUN_Pos)                        /*!< SCU SFSPF_7: EPUN Mask                  */
#define SCU_SFSPF_7_EHS_Pos                   5                                                       /*!< SCU SFSPF_7: EHS Position               */
#define SCU_SFSPF_7_EHS_Msk                   (0x01UL << SCU_SFSPF_7_EHS_Pos)                         /*!< SCU SFSPF_7: EHS Mask                   */
#define SCU_SFSPF_7_EZI_Pos                   6                                                       /*!< SCU SFSPF_7: EZI Position               */
#define SCU_SFSPF_7_EZI_Msk                   (0x01UL << SCU_SFSPF_7_EZI_Pos)                         /*!< SCU SFSPF_7: EZI Mask                   */
#define SCU_SFSPF_7_ZIF_Pos                   7                                                       /*!< SCU SFSPF_7: ZIF Position               */
#define SCU_SFSPF_7_ZIF_Msk                   (0x01UL << SCU_SFSPF_7_ZIF_Pos)                         /*!< SCU SFSPF_7: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPF_8  -------------------------------- */
#define SCU_SFSPF_8_MODE_Pos                  0                                                       /*!< SCU SFSPF_8: MODE Position              */
#define SCU_SFSPF_8_MODE_Msk                  (0x07UL << SCU_SFSPF_8_MODE_Pos)                        /*!< SCU SFSPF_8: MODE Mask                  */
#define SCU_SFSPF_8_EPD_Pos                   3                                                       /*!< SCU SFSPF_8: EPD Position               */
#define SCU_SFSPF_8_EPD_Msk                   (0x01UL << SCU_SFSPF_8_EPD_Pos)                         /*!< SCU SFSPF_8: EPD Mask                   */
#define SCU_SFSPF_8_EPUN_Pos                  4                                                       /*!< SCU SFSPF_8: EPUN Position              */
#define SCU_SFSPF_8_EPUN_Msk                  (0x01UL << SCU_SFSPF_8_EPUN_Pos)                        /*!< SCU SFSPF_8: EPUN Mask                  */
#define SCU_SFSPF_8_EHS_Pos                   5                                                       /*!< SCU SFSPF_8: EHS Position               */
#define SCU_SFSPF_8_EHS_Msk                   (0x01UL << SCU_SFSPF_8_EHS_Pos)                         /*!< SCU SFSPF_8: EHS Mask                   */
#define SCU_SFSPF_8_EZI_Pos                   6                                                       /*!< SCU SFSPF_8: EZI Position               */
#define SCU_SFSPF_8_EZI_Msk                   (0x01UL << SCU_SFSPF_8_EZI_Pos)                         /*!< SCU SFSPF_8: EZI Mask                   */
#define SCU_SFSPF_8_ZIF_Pos                   7                                                       /*!< SCU SFSPF_8: ZIF Position               */
#define SCU_SFSPF_8_ZIF_Msk                   (0x01UL << SCU_SFSPF_8_ZIF_Pos)                         /*!< SCU SFSPF_8: ZIF Mask                   */

/* ---------------------------------  SCU_SFSPF_9  -------------------------------- */
#define SCU_SFSPF_9_MODE_Pos                  0                                                       /*!< SCU SFSPF_9: MODE Position              */
#define SCU_SFSPF_9_MODE_Msk                  (0x07UL << SCU_SFSPF_9_MODE_Pos)                        /*!< SCU SFSPF_9: MODE Mask                  */
#define SCU_SFSPF_9_EPD_Pos                   3                                                       /*!< SCU SFSPF_9: EPD Position               */
#define SCU_SFSPF_9_EPD_Msk                   (0x01UL << SCU_SFSPF_9_EPD_Pos)                         /*!< SCU SFSPF_9: EPD Mask                   */
#define SCU_SFSPF_9_EPUN_Pos                  4                                                       /*!< SCU SFSPF_9: EPUN Position              */
#define SCU_SFSPF_9_EPUN_Msk                  (0x01UL << SCU_SFSPF_9_EPUN_Pos)                        /*!< SCU SFSPF_9: EPUN Mask                  */
#define SCU_SFSPF_9_EHS_Pos                   5                                                       /*!< SCU SFSPF_9: EHS Position               */
#define SCU_SFSPF_9_EHS_Msk                   (0x01UL << SCU_SFSPF_9_EHS_Pos)                         /*!< SCU SFSPF_9: EHS Mask                   */
#define SCU_SFSPF_9_EZI_Pos                   6                                                       /*!< SCU SFSPF_9: EZI Position               */
#define SCU_SFSPF_9_EZI_Msk                   (0x01UL << SCU_SFSPF_9_EZI_Pos)                         /*!< SCU SFSPF_9: EZI Mask                   */
#define SCU_SFSPF_9_ZIF_Pos                   7                                                       /*!< SCU SFSPF_9: ZIF Position               */
#define SCU_SFSPF_9_ZIF_Msk                   (0x01UL << SCU_SFSPF_9_ZIF_Pos)                         /*!< SCU SFSPF_9: ZIF Mask                   */

/* --------------------------------  SCU_SFSPF_10  -------------------------------- */
#define SCU_SFSPF_10_MODE_Pos                 0                                                       /*!< SCU SFSPF_10: MODE Position             */
#define SCU_SFSPF_10_MODE_Msk                 (0x07UL << SCU_SFSPF_10_MODE_Pos)                       /*!< SCU SFSPF_10: MODE Mask                 */
#define SCU_SFSPF_10_EPD_Pos                  3                                                       /*!< SCU SFSPF_10: EPD Position              */
#define SCU_SFSPF_10_EPD_Msk                  (0x01UL << SCU_SFSPF_10_EPD_Pos)                        /*!< SCU SFSPF_10: EPD Mask                  */
#define SCU_SFSPF_10_EPUN_Pos                 4                                                       /*!< SCU SFSPF_10: EPUN Position             */
#define SCU_SFSPF_10_EPUN_Msk                 (0x01UL << SCU_SFSPF_10_EPUN_Pos)                       /*!< SCU SFSPF_10: EPUN Mask                 */
#define SCU_SFSPF_10_EHS_Pos                  5                                                       /*!< SCU SFSPF_10: EHS Position              */
#define SCU_SFSPF_10_EHS_Msk                  (0x01UL << SCU_SFSPF_10_EHS_Pos)                        /*!< SCU SFSPF_10: EHS Mask                  */
#define SCU_SFSPF_10_EZI_Pos                  6                                                       /*!< SCU SFSPF_10: EZI Position              */
#define SCU_SFSPF_10_EZI_Msk                  (0x01UL << SCU_SFSPF_10_EZI_Pos)                        /*!< SCU SFSPF_10: EZI Mask                  */
#define SCU_SFSPF_10_ZIF_Pos                  7                                                       /*!< SCU SFSPF_10: ZIF Position              */
#define SCU_SFSPF_10_ZIF_Msk                  (0x01UL << SCU_SFSPF_10_ZIF_Pos)                        /*!< SCU SFSPF_10: ZIF Mask                  */

/* --------------------------------  SCU_SFSPF_11  -------------------------------- */
#define SCU_SFSPF_11_MODE_Pos                 0                                                       /*!< SCU SFSPF_11: MODE Position             */
#define SCU_SFSPF_11_MODE_Msk                 (0x07UL << SCU_SFSPF_11_MODE_Pos)                       /*!< SCU SFSPF_11: MODE Mask                 */
#define SCU_SFSPF_11_EPD_Pos                  3                                                       /*!< SCU SFSPF_11: EPD Position              */
#define SCU_SFSPF_11_EPD_Msk                  (0x01UL << SCU_SFSPF_11_EPD_Pos)                        /*!< SCU SFSPF_11: EPD Mask                  */
#define SCU_SFSPF_11_EPUN_Pos                 4                                                       /*!< SCU SFSPF_11: EPUN Position             */
#define SCU_SFSPF_11_EPUN_Msk                 (0x01UL << SCU_SFSPF_11_EPUN_Pos)                       /*!< SCU SFSPF_11: EPUN Mask                 */
#define SCU_SFSPF_11_EHS_Pos                  5                                                       /*!< SCU SFSPF_11: EHS Position              */
#define SCU_SFSPF_11_EHS_Msk                  (0x01UL << SCU_SFSPF_11_EHS_Pos)                        /*!< SCU SFSPF_11: EHS Mask                  */
#define SCU_SFSPF_11_EZI_Pos                  6                                                       /*!< SCU SFSPF_11: EZI Position              */
#define SCU_SFSPF_11_EZI_Msk                  (0x01UL << SCU_SFSPF_11_EZI_Pos)                        /*!< SCU SFSPF_11: EZI Mask                  */
#define SCU_SFSPF_11_ZIF_Pos                  7                                                       /*!< SCU SFSPF_11: ZIF Position              */
#define SCU_SFSPF_11_ZIF_Msk                  (0x01UL << SCU_SFSPF_11_ZIF_Pos)                        /*!< SCU SFSPF_11: ZIF Mask                  */

/* --------------------------------  SCU_SFSCLK_0  -------------------------------- */
#define SCU_SFSCLK_0_MODE_Pos                 0                                                       /*!< SCU SFSCLK_0: MODE Position             */
#define SCU_SFSCLK_0_MODE_Msk                 (0x07UL << SCU_SFSCLK_0_MODE_Pos)                       /*!< SCU SFSCLK_0: MODE Mask                 */
#define SCU_SFSCLK_0_EPD_Pos                  3                                                       /*!< SCU SFSCLK_0: EPD Position              */
#define SCU_SFSCLK_0_EPD_Msk                  (0x01UL << SCU_SFSCLK_0_EPD_Pos)                        /*!< SCU SFSCLK_0: EPD Mask                  */
#define SCU_SFSCLK_0_EPUN_Pos                 4                                                       /*!< SCU SFSCLK_0: EPUN Position             */
#define SCU_SFSCLK_0_EPUN_Msk                 (0x01UL << SCU_SFSCLK_0_EPUN_Pos)                       /*!< SCU SFSCLK_0: EPUN Mask                 */
#define SCU_SFSCLK_0_EHS_Pos                  5                                                       /*!< SCU SFSCLK_0: EHS Position              */
#define SCU_SFSCLK_0_EHS_Msk                  (0x01UL << SCU_SFSCLK_0_EHS_Pos)                        /*!< SCU SFSCLK_0: EHS Mask                  */
#define SCU_SFSCLK_0_EZI_Pos                  6                                                       /*!< SCU SFSCLK_0: EZI Position              */
#define SCU_SFSCLK_0_EZI_Msk                  (0x01UL << SCU_SFSCLK_0_EZI_Pos)                        /*!< SCU SFSCLK_0: EZI Mask                  */
#define SCU_SFSCLK_0_ZIF_Pos                  7                                                       /*!< SCU SFSCLK_0: ZIF Position              */
#define SCU_SFSCLK_0_ZIF_Msk                  (0x01UL << SCU_SFSCLK_0_ZIF_Pos)                        /*!< SCU SFSCLK_0: ZIF Mask                  */

/* --------------------------------  SCU_SFSCLK_1  -------------------------------- */
#define SCU_SFSCLK_1_MODE_Pos                 0                                                       /*!< SCU SFSCLK_1: MODE Position             */
#define SCU_SFSCLK_1_MODE_Msk                 (0x07UL << SCU_SFSCLK_1_MODE_Pos)                       /*!< SCU SFSCLK_1: MODE Mask                 */
#define SCU_SFSCLK_1_EPD_Pos                  3                                                       /*!< SCU SFSCLK_1: EPD Position              */
#define SCU_SFSCLK_1_EPD_Msk                  (0x01UL << SCU_SFSCLK_1_EPD_Pos)                        /*!< SCU SFSCLK_1: EPD Mask                  */
#define SCU_SFSCLK_1_EPUN_Pos                 4                                                       /*!< SCU SFSCLK_1: EPUN Position             */
#define SCU_SFSCLK_1_EPUN_Msk                 (0x01UL << SCU_SFSCLK_1_EPUN_Pos)                       /*!< SCU SFSCLK_1: EPUN Mask                 */
#define SCU_SFSCLK_1_EHS_Pos                  5                                                       /*!< SCU SFSCLK_1: EHS Position              */
#define SCU_SFSCLK_1_EHS_Msk                  (0x01UL << SCU_SFSCLK_1_EHS_Pos)                        /*!< SCU SFSCLK_1: EHS Mask                  */
#define SCU_SFSCLK_1_EZI_Pos                  6                                                       /*!< SCU SFSCLK_1: EZI Position              */
#define SCU_SFSCLK_1_EZI_Msk                  (0x01UL << SCU_SFSCLK_1_EZI_Pos)                        /*!< SCU SFSCLK_1: EZI Mask                  */
#define SCU_SFSCLK_1_ZIF_Pos                  7                                                       /*!< SCU SFSCLK_1: ZIF Position              */
#define SCU_SFSCLK_1_ZIF_Msk                  (0x01UL << SCU_SFSCLK_1_ZIF_Pos)                        /*!< SCU SFSCLK_1: ZIF Mask                  */

/* --------------------------------  SCU_SFSCLK_2  -------------------------------- */
#define SCU_SFSCLK_2_MODE_Pos                 0                                                       /*!< SCU SFSCLK_2: MODE Position             */
#define SCU_SFSCLK_2_MODE_Msk                 (0x07UL << SCU_SFSCLK_2_MODE_Pos)                       /*!< SCU SFSCLK_2: MODE Mask                 */
#define SCU_SFSCLK_2_EPD_Pos                  3                                                       /*!< SCU SFSCLK_2: EPD Position              */
#define SCU_SFSCLK_2_EPD_Msk                  (0x01UL << SCU_SFSCLK_2_EPD_Pos)                        /*!< SCU SFSCLK_2: EPD Mask                  */
#define SCU_SFSCLK_2_EPUN_Pos                 4                                                       /*!< SCU SFSCLK_2: EPUN Position             */
#define SCU_SFSCLK_2_EPUN_Msk                 (0x01UL << SCU_SFSCLK_2_EPUN_Pos)                       /*!< SCU SFSCLK_2: EPUN Mask                 */
#define SCU_SFSCLK_2_EHS_Pos                  5                                                       /*!< SCU SFSCLK_2: EHS Position              */
#define SCU_SFSCLK_2_EHS_Msk                  (0x01UL << SCU_SFSCLK_2_EHS_Pos)                        /*!< SCU SFSCLK_2: EHS Mask                  */
#define SCU_SFSCLK_2_EZI_Pos                  6                                                       /*!< SCU SFSCLK_2: EZI Position              */
#define SCU_SFSCLK_2_EZI_Msk                  (0x01UL << SCU_SFSCLK_2_EZI_Pos)                        /*!< SCU SFSCLK_2: EZI Mask                  */
#define SCU_SFSCLK_2_ZIF_Pos                  7                                                       /*!< SCU SFSCLK_2: ZIF Position              */
#define SCU_SFSCLK_2_ZIF_Msk                  (0x01UL << SCU_SFSCLK_2_ZIF_Pos)                        /*!< SCU SFSCLK_2: ZIF Mask                  */

