roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  SCU_SFSCLK_3  -------------------------------- */
#define SCU_SFSCLK_3_MODE_Pos                 0                                                       /*!< SCU SFSCLK_3: MODE Position             */
#define SCU_SFSCLK_3_MODE_Msk                 (0x07UL << SCU_SFSCLK_3_MODE_Pos)                       /*!< SCU SFSCLK_3: MODE Mask                 */
#define SCU_SFSCLK_3_EPD_Pos                  3                                                       /*!< SCU SFSCLK_3: EPD Position              */
#define SCU_SFSCLK_3_EPD_Msk                  (0x01UL << SCU_SFSCLK_3_EPD_Pos)                        /*!< SCU SFSCLK_3: EPD Mask                  */
#define SCU_SFSCLK_3_EPUN_Pos                 4                                                       /*!< SCU SFSCLK_3: EPUN Position             */
#define SCU_SFSCLK_3_EPUN_Msk                 (0x01UL << SCU_SFSCLK_3_EPUN_Pos)                       /*!< SCU SFSCLK_3: EPUN Mask                 */
#define SCU_SFSCLK_3_EHS_Pos                  5                                                       /*!< SCU SFSCLK_3: EHS Position              */
#define SCU_SFSCLK_3_EHS_Msk                  (0x01UL << SCU_SFSCLK_3_EHS_Pos)                        /*!< SCU SFSCLK_3: EHS Mask                  */
#define SCU_SFSCLK_3_EZI_Pos                  6                                                       /*!< SCU SFSCLK_3: EZI Position              */
#define SCU_SFSCLK_3_EZI_Msk                  (0x01UL << SCU_SFSCLK_3_EZI_Pos)                        /*!< SCU SFSCLK_3: EZI Mask                  */
#define SCU_SFSCLK_3_ZIF_Pos                  7                                                       /*!< SCU SFSCLK_3: ZIF Position              */
#define SCU_SFSCLK_3_ZIF_Msk                  (0x01UL << SCU_SFSCLK_3_ZIF_Pos)                        /*!< SCU SFSCLK_3: ZIF Mask                  */

/* ---------------------------------  SCU_SFSUSB  --------------------------------- */
#define SCU_SFSUSB_USB_AIM_Pos                0                                                       /*!< SCU SFSUSB: USB_AIM Position            */
#define SCU_SFSUSB_USB_AIM_Msk                (0x01UL << SCU_SFSUSB_USB_AIM_Pos)                      /*!< SCU SFSUSB: USB_AIM Mask                */
#define SCU_SFSUSB_USB_ESEA_Pos               1                                                       /*!< SCU SFSUSB: USB_ESEA Position           */
#define SCU_SFSUSB_USB_ESEA_Msk               (0x01UL << SCU_SFSUSB_USB_ESEA_Pos)                     /*!< SCU SFSUSB: USB_ESEA Mask               */
#define SCU_SFSUSB_USB_EPD_Pos                2                                                       /*!< SCU SFSUSB: USB_EPD Position            */
#define SCU_SFSUSB_USB_EPD_Msk                (0x01UL << SCU_SFSUSB_USB_EPD_Pos)                      /*!< SCU SFSUSB: USB_EPD Mask                */
#define SCU_SFSUSB_USB_EPWR_Pos               4                                                       /*!< SCU SFSUSB: USB_EPWR Position           */
#define SCU_SFSUSB_USB_EPWR_Msk               (0x01UL << SCU_SFSUSB_USB_EPWR_Pos)                     /*!< SCU SFSUSB: USB_EPWR Mask               */
#define SCU_SFSUSB_USB_VBUS_Pos               5                                                       /*!< SCU SFSUSB: USB_VBUS Position           */
#define SCU_SFSUSB_USB_VBUS_Msk               (0x01UL << SCU_SFSUSB_USB_VBUS_Pos)                     /*!< SCU SFSUSB: USB_VBUS Mask               */

/* ---------------------------------  SCU_SFSI2C0  -------------------------------- */
#define SCU_SFSI2C0_SCL_EFP_Pos               0                                                       /*!< SCU SFSI2C0: SCL_EFP Position           */
#define SCU_SFSI2C0_SCL_EFP_Msk               (0x01UL << SCU_SFSI2C0_SCL_EFP_Pos)                     /*!< SCU SFSI2C0: SCL_EFP Mask               */
#define SCU_SFSI2C0_SCL_EHD_Pos               2                                                       /*!< SCU SFSI2C0: SCL_EHD Position           */
#define SCU_SFSI2C0_SCL_EHD_Msk               (0x01UL << SCU_SFSI2C0_SCL_EHD_Pos)                     /*!< SCU SFSI2C0: SCL_EHD Mask               */
#define SCU_SFSI2C0_SCL_EZI_Pos               3                                                       /*!< SCU SFSI2C0: SCL_EZI Position           */
#define SCU_SFSI2C0_SCL_EZI_Msk               (0x01UL << SCU_SFSI2C0_SCL_EZI_Pos)                     /*!< SCU SFSI2C0: SCL_EZI Mask               */
#define SCU_SFSI2C0_SCL_ZIF_Pos               7                                                       /*!< SCU SFSI2C0: SCL_ZIF Position           */
#define SCU_SFSI2C0_SCL_ZIF_Msk               (0x01UL << SCU_SFSI2C0_SCL_ZIF_Pos)                     /*!< SCU SFSI2C0: SCL_ZIF Mask               */
#define SCU_SFSI2C0_SDA_EFP_Pos               8                                                       /*!< SCU SFSI2C0: SDA_EFP Position           */
#define SCU_SFSI2C0_SDA_EFP_Msk               (0x01UL << SCU_SFSI2C0_SDA_EFP_Pos)                     /*!< SCU SFSI2C0: SDA_EFP Mask               */
#define SCU_SFSI2C0_SDA_EHD_Pos               10                                                      /*!< SCU SFSI2C0: SDA_EHD Position           */
#define SCU_SFSI2C0_SDA_EHD_Msk               (0x01UL << SCU_SFSI2C0_SDA_EHD_Pos)                     /*!< SCU SFSI2C0: SDA_EHD Mask               */
#define SCU_SFSI2C0_SDA_EZI_Pos               11                                                      /*!< SCU SFSI2C0: SDA_EZI Position           */
#define SCU_SFSI2C0_SDA_EZI_Msk               (0x01UL << SCU_SFSI2C0_SDA_EZI_Pos)                     /*!< SCU SFSI2C0: SDA_EZI Mask               */
#define SCU_SFSI2C0_SDA_ZIF_Pos               15                                                      /*!< SCU SFSI2C0: SDA_ZIF Position           */
#define SCU_SFSI2C0_SDA_ZIF_Msk               (0x01UL << SCU_SFSI2C0_SDA_ZIF_Pos)                     /*!< SCU SFSI2C0: SDA_ZIF Mask               */

/* ---------------------------------  SCU_ENAIO0  --------------------------------- */
#define SCU_ENAIO0_ADC0_0_Pos                 0                                                       /*!< SCU ENAIO0: ADC0_0 Position             */
#define SCU_ENAIO0_ADC0_0_Msk                 (0x01UL << SCU_ENAIO0_ADC0_0_Pos)                       /*!< SCU ENAIO0: ADC0_0 Mask                 */
#define SCU_ENAIO0_ADC0_1_Pos                 1                                                       /*!< SCU ENAIO0: ADC0_1 Position             */
#define SCU_ENAIO0_ADC0_1_Msk                 (0x01UL << SCU_ENAIO0_ADC0_1_Pos)                       /*!< SCU ENAIO0: ADC0_1 Mask                 */
#define SCU_ENAIO0_ADC0_2_Pos                 2                                                       /*!< SCU ENAIO0: ADC0_2 Position             */
#define SCU_ENAIO0_ADC0_2_Msk                 (0x01UL << SCU_ENAIO0_ADC0_2_Pos)                       /*!< SCU ENAIO0: ADC0_2 Mask                 */
#define SCU_ENAIO0_ADC0_3_Pos                 3                                                       /*!< SCU ENAIO0: ADC0_3 Position             */
#define SCU_ENAIO0_ADC0_3_Msk                 (0x01UL << SCU_ENAIO0_ADC0_3_Pos)                       /*!< SCU ENAIO0: ADC0_3 Mask                 */
#define SCU_ENAIO0_ADC0_4_Pos                 4                                                       /*!< SCU ENAIO0: ADC0_4 Position             */
#define SCU_ENAIO0_ADC0_4_Msk                 (0x01UL << SCU_ENAIO0_ADC0_4_Pos)                       /*!< SCU ENAIO0: ADC0_4 Mask                 */
#define SCU_ENAIO0_ADC0_5_Pos                 5                                                       /*!< SCU ENAIO0: ADC0_5 Position             */
#define SCU_ENAIO0_ADC0_5_Msk                 (0x01UL << SCU_ENAIO0_ADC0_5_Pos)                       /*!< SCU ENAIO0: ADC0_5 Mask                 */
#define SCU_ENAIO0_ADC0_6_Pos                 6                                                       /*!< SCU ENAIO0: ADC0_6 Position             */
#define SCU_ENAIO0_ADC0_6_Msk                 (0x01UL << SCU_ENAIO0_ADC0_6_Pos)                       /*!< SCU ENAIO0: ADC0_6 Mask                 */

/* ---------------------------------  SCU_ENAIO1  --------------------------------- */
#define SCU_ENAIO1_ADC1_0_Pos                 0                                                       /*!< SCU ENAIO1: ADC1_0 Position             */
#define SCU_ENAIO1_ADC1_0_Msk                 (0x01UL << SCU_ENAIO1_ADC1_0_Pos)                       /*!< SCU ENAIO1: ADC1_0 Mask                 */
#define SCU_ENAIO1_ADC1_1_Pos                 1                                                       /*!< SCU ENAIO1: ADC1_1 Position             */
#define SCU_ENAIO1_ADC1_1_Msk                 (0x01UL << SCU_ENAIO1_ADC1_1_Pos)                       /*!< SCU ENAIO1: ADC1_1 Mask                 */
#define SCU_ENAIO1_ADC1_2_Pos                 2                                                       /*!< SCU ENAIO1: ADC1_2 Position             */
#define SCU_ENAIO1_ADC1_2_Msk                 (0x01UL << SCU_ENAIO1_ADC1_2_Pos)                       /*!< SCU ENAIO1: ADC1_2 Mask                 */
#define SCU_ENAIO1_ADC1_3_Pos                 3                                                       /*!< SCU ENAIO1: ADC1_3 Position             */
#define SCU_ENAIO1_ADC1_3_Msk                 (0x01UL << SCU_ENAIO1_ADC1_3_Pos)                       /*!< SCU ENAIO1: ADC1_3 Mask                 */
#define SCU_ENAIO1_ADC1_4_Pos                 4                                                       /*!< SCU ENAIO1: ADC1_4 Position             */
#define SCU_ENAIO1_ADC1_4_Msk                 (0x01UL << SCU_ENAIO1_ADC1_4_Pos)                       /*!< SCU ENAIO1: ADC1_4 Mask                 */
#define SCU_ENAIO1_ADC1_5_Pos                 5                                                       /*!< SCU ENAIO1: ADC1_5 Position             */
#define SCU_ENAIO1_ADC1_5_Msk                 (0x01UL << SCU_ENAIO1_ADC1_5_Pos)                       /*!< SCU ENAIO1: ADC1_5 Mask                 */
#define SCU_ENAIO1_ADC1_6_Pos                 6                                                       /*!< SCU ENAIO1: ADC1_6 Position             */
#define SCU_ENAIO1_ADC1_6_Msk                 (0x01UL << SCU_ENAIO1_ADC1_6_Pos)                       /*!< SCU ENAIO1: ADC1_6 Mask                 */
#define SCU_ENAIO1_ADC1_7_Pos                 7                                                       /*!< SCU ENAIO1: ADC1_7 Position             */
#define SCU_ENAIO1_ADC1_7_Msk                 (0x01UL << SCU_ENAIO1_ADC1_7_Pos)                       /*!< SCU ENAIO1: ADC1_7 Mask                 */

