roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  GPIO_PIN_INT_SIENF  ----------------------------- */
#define GPIO_PIN_INT_SIENF_SETENAF0_Pos       0                                                       /*!< GPIO_PIN_INT SIENF: SETENAF0 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF0_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF0_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF0 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF1_Pos       1                                                       /*!< GPIO_PIN_INT SIENF: SETENAF1 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF1_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF1_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF1 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF2_Pos       2                                                       /*!< GPIO_PIN_INT SIENF: SETENAF2 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF2_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF2_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF2 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF3_Pos       3                                                       /*!< GPIO_PIN_INT SIENF: SETENAF3 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF3_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF3_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF3 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF4_Pos       4                                                       /*!< GPIO_PIN_INT SIENF: SETENAF4 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF4_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF4_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF4 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF5_Pos       5                                                       /*!< GPIO_PIN_INT SIENF: SETENAF5 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF5_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF5_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF5 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF6_Pos       6                                                       /*!< GPIO_PIN_INT SIENF: SETENAF6 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF6_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF6_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF6 Mask       */
#define GPIO_PIN_INT_SIENF_SETENAF7_Pos       7                                                       /*!< GPIO_PIN_INT SIENF: SETENAF7 Position   */
#define GPIO_PIN_INT_SIENF_SETENAF7_Msk       (0x01UL << GPIO_PIN_INT_SIENF_SETENAF7_Pos)             /*!< GPIO_PIN_INT SIENF: SETENAF7 Mask       */

/* -----------------------------  GPIO_PIN_INT_CIENF  ----------------------------- */
#define GPIO_PIN_INT_CIENF_CENAF0_Pos         0                                                       /*!< GPIO_PIN_INT CIENF: CENAF0 Position     */
#define GPIO_PIN_INT_CIENF_CENAF0_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF0_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF0 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF1_Pos         1                                                       /*!< GPIO_PIN_INT CIENF: CENAF1 Position     */
#define GPIO_PIN_INT_CIENF_CENAF1_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF1_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF1 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF2_Pos         2                                                       /*!< GPIO_PIN_INT CIENF: CENAF2 Position     */
#define GPIO_PIN_INT_CIENF_CENAF2_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF2_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF2 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF3_Pos         3                                                       /*!< GPIO_PIN_INT CIENF: CENAF3 Position     */
#define GPIO_PIN_INT_CIENF_CENAF3_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF3_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF3 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF4_Pos         4                                                       /*!< GPIO_PIN_INT CIENF: CENAF4 Position     */
#define GPIO_PIN_INT_CIENF_CENAF4_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF4_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF4 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF5_Pos         5                                                       /*!< GPIO_PIN_INT CIENF: CENAF5 Position     */
#define GPIO_PIN_INT_CIENF_CENAF5_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF5_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF5 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF6_Pos         6                                                       /*!< GPIO_PIN_INT CIENF: CENAF6 Position     */
#define GPIO_PIN_INT_CIENF_CENAF6_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF6_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF6 Mask         */
#define GPIO_PIN_INT_CIENF_CENAF7_Pos         7                                                       /*!< GPIO_PIN_INT CIENF: CENAF7 Position     */
#define GPIO_PIN_INT_CIENF_CENAF7_Msk         (0x01UL << GPIO_PIN_INT_CIENF_CENAF7_Pos)               /*!< GPIO_PIN_INT CIENF: CENAF7 Mask         */

/* ------------------------------  GPIO_PIN_INT_RISE  ----------------------------- */
#define GPIO_PIN_INT_RISE_RDET0_Pos           0                                                       /*!< GPIO_PIN_INT RISE: RDET0 Position       */
#define GPIO_PIN_INT_RISE_RDET0_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET0_Pos)                 /*!< GPIO_PIN_INT RISE: RDET0 Mask           */
#define GPIO_PIN_INT_RISE_RDET1_Pos           1                                                       /*!< GPIO_PIN_INT RISE: RDET1 Position       */
#define GPIO_PIN_INT_RISE_RDET1_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET1_Pos)                 /*!< GPIO_PIN_INT RISE: RDET1 Mask           */
#define GPIO_PIN_INT_RISE_RDET2_Pos           2                                                       /*!< GPIO_PIN_INT RISE: RDET2 Position       */
#define GPIO_PIN_INT_RISE_RDET2_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET2_Pos)                 /*!< GPIO_PIN_INT RISE: RDET2 Mask           */
#define GPIO_PIN_INT_RISE_RDET3_Pos           3                                                       /*!< GPIO_PIN_INT RISE: RDET3 Position       */
#define GPIO_PIN_INT_RISE_RDET3_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET3_Pos)                 /*!< GPIO_PIN_INT RISE: RDET3 Mask           */
#define GPIO_PIN_INT_RISE_RDET4_Pos           4                                                       /*!< GPIO_PIN_INT RISE: RDET4 Position       */
#define GPIO_PIN_INT_RISE_RDET4_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET4_Pos)                 /*!< GPIO_PIN_INT RISE: RDET4 Mask           */
#define GPIO_PIN_INT_RISE_RDET5_Pos           5                                                       /*!< GPIO_PIN_INT RISE: RDET5 Position       */
#define GPIO_PIN_INT_RISE_RDET5_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET5_Pos)                 /*!< GPIO_PIN_INT RISE: RDET5 Mask           */
#define GPIO_PIN_INT_RISE_RDET6_Pos           6                                                       /*!< GPIO_PIN_INT RISE: RDET6 Position       */
#define GPIO_PIN_INT_RISE_RDET6_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET6_Pos)                 /*!< GPIO_PIN_INT RISE: RDET6 Mask           */
#define GPIO_PIN_INT_RISE_RDET7_Pos           7                                                       /*!< GPIO_PIN_INT RISE: RDET7 Position       */
#define GPIO_PIN_INT_RISE_RDET7_Msk           (0x01UL << GPIO_PIN_INT_RISE_RDET7_Pos)                 /*!< GPIO_PIN_INT RISE: RDET7 Mask           */

