roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ------------------------------  GPIO_PIN_INT_FALL  ----------------------------- */
#define GPIO_PIN_INT_FALL_FDET0_Pos           0                                                       /*!< GPIO_PIN_INT FALL: FDET0 Position       */
#define GPIO_PIN_INT_FALL_FDET0_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET0_Pos)                 /*!< GPIO_PIN_INT FALL: FDET0 Mask           */
#define GPIO_PIN_INT_FALL_FDET1_Pos           1                                                       /*!< GPIO_PIN_INT FALL: FDET1 Position       */
#define GPIO_PIN_INT_FALL_FDET1_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET1_Pos)                 /*!< GPIO_PIN_INT FALL: FDET1 Mask           */
#define GPIO_PIN_INT_FALL_FDET2_Pos           2                                                       /*!< GPIO_PIN_INT FALL: FDET2 Position       */
#define GPIO_PIN_INT_FALL_FDET2_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET2_Pos)                 /*!< GPIO_PIN_INT FALL: FDET2 Mask           */
#define GPIO_PIN_INT_FALL_FDET3_Pos           3                                                       /*!< GPIO_PIN_INT FALL: FDET3 Position       */
#define GPIO_PIN_INT_FALL_FDET3_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET3_Pos)                 /*!< GPIO_PIN_INT FALL: FDET3 Mask           */
#define GPIO_PIN_INT_FALL_FDET4_Pos           4                                                       /*!< GPIO_PIN_INT FALL: FDET4 Position       */
#define GPIO_PIN_INT_FALL_FDET4_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET4_Pos)                 /*!< GPIO_PIN_INT FALL: FDET4 Mask           */
#define GPIO_PIN_INT_FALL_FDET5_Pos           5                                                       /*!< GPIO_PIN_INT FALL: FDET5 Position       */
#define GPIO_PIN_INT_FALL_FDET5_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET5_Pos)                 /*!< GPIO_PIN_INT FALL: FDET5 Mask           */
#define GPIO_PIN_INT_FALL_FDET6_Pos           6                                                       /*!< GPIO_PIN_INT FALL: FDET6 Position       */
#define GPIO_PIN_INT_FALL_FDET6_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET6_Pos)                 /*!< GPIO_PIN_INT FALL: FDET6 Mask           */
#define GPIO_PIN_INT_FALL_FDET7_Pos           7                                                       /*!< GPIO_PIN_INT FALL: FDET7 Position       */
#define GPIO_PIN_INT_FALL_FDET7_Msk           (0x01UL << GPIO_PIN_INT_FALL_FDET7_Pos)                 /*!< GPIO_PIN_INT FALL: FDET7 Mask           */

/* ------------------------------  GPIO_PIN_INT_IST  ------------------------------ */
#define GPIO_PIN_INT_IST_PSTAT0_Pos           0                                                       /*!< GPIO_PIN_INT IST: PSTAT0 Position       */
#define GPIO_PIN_INT_IST_PSTAT0_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT0_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT0 Mask           */
#define GPIO_PIN_INT_IST_PSTAT1_Pos           1                                                       /*!< GPIO_PIN_INT IST: PSTAT1 Position       */
#define GPIO_PIN_INT_IST_PSTAT1_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT1_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT1 Mask           */
#define GPIO_PIN_INT_IST_PSTAT2_Pos           2                                                       /*!< GPIO_PIN_INT IST: PSTAT2 Position       */
#define GPIO_PIN_INT_IST_PSTAT2_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT2_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT2 Mask           */
#define GPIO_PIN_INT_IST_PSTAT3_Pos           3                                                       /*!< GPIO_PIN_INT IST: PSTAT3 Position       */
#define GPIO_PIN_INT_IST_PSTAT3_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT3_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT3 Mask           */
#define GPIO_PIN_INT_IST_PSTAT4_Pos           4                                                       /*!< GPIO_PIN_INT IST: PSTAT4 Position       */
#define GPIO_PIN_INT_IST_PSTAT4_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT4_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT4 Mask           */
#define GPIO_PIN_INT_IST_PSTAT5_Pos           5                                                       /*!< GPIO_PIN_INT IST: PSTAT5 Position       */
#define GPIO_PIN_INT_IST_PSTAT5_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT5_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT5 Mask           */
#define GPIO_PIN_INT_IST_PSTAT6_Pos           6                                                       /*!< GPIO_PIN_INT IST: PSTAT6 Position       */
#define GPIO_PIN_INT_IST_PSTAT6_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT6_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT6 Mask           */
#define GPIO_PIN_INT_IST_PSTAT7_Pos           7                                                       /*!< GPIO_PIN_INT IST: PSTAT7 Position       */
#define GPIO_PIN_INT_IST_PSTAT7_Msk           (0x01UL << GPIO_PIN_INT_IST_PSTAT7_Pos)                 /*!< GPIO_PIN_INT IST: PSTAT7 Mask           */


/* ================================================================================ */
/* ================     Group 'GPIO_GROUP_INTn' Position & Mask    ================ */
/* ================================================================================ */


/* ----------------------------  GPIO_GROUP_INTn_CTRL  ---------------------------- */
#define GPIO_GROUP_INTn_CTRL_INT_Pos          0                                                       /*!< GPIO_GROUP_INTn CTRL: INT Position      */
#define GPIO_GROUP_INTn_CTRL_INT_Msk          (0x01UL << GPIO_GROUP_INTn_CTRL_INT_Pos)                /*!< GPIO_GROUP_INTn CTRL: INT Mask          */
#define GPIO_GROUP_INTn_CTRL_COMB_Pos         1                                                       /*!< GPIO_GROUP_INTn CTRL: COMB Position     */
#define GPIO_GROUP_INTn_CTRL_COMB_Msk         (0x01UL << GPIO_GROUP_INTn_CTRL_COMB_Pos)               /*!< GPIO_GROUP_INTn CTRL: COMB Mask         */
#define GPIO_GROUP_INTn_CTRL_TRIG_Pos         2                                                       /*!< GPIO_GROUP_INTn CTRL: TRIG Position     */
#define GPIO_GROUP_INTn_CTRL_TRIG_Msk         (0x01UL << GPIO_GROUP_INTn_CTRL_TRIG_Pos)               /*!< GPIO_GROUP_INTn CTRL: TRIG Mask         */

