roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------  GPIO_GROUP_INTn_PORT_ENA6  ------------------------- */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_0_Pos   0                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_0 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_0_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_0_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_0 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_1_Pos   1                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_1 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_1_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_1_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_1 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_2_Pos   2                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_2 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_2_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_2_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_2 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_3_Pos   3                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_3 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_3_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_3_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_3 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_4_Pos   4                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_4 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_4_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_4_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_4 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_5_Pos   5                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_5 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_5_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_5_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_5 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_6_Pos   6                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_6 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_6_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_6_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_6 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_7_Pos   7                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_7 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_7_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_7_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_7 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_8_Pos   8                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_8 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_8_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_8_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_8 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_9_Pos   9                                                       /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_9 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_9_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_9_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_9 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_10_Pos  10                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_10 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_10_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_10_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_10 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_11_Pos  11                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_11 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_11_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_11_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_11 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_12_Pos  12                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_12 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_12_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_12_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_12 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_13_Pos  13                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_13 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_13_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_13_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_13 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_14_Pos  14                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_14 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_14_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_14_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_14 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_15_Pos  15                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_15 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_15_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_15_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_15 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_16_Pos  16                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_16 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_16_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_16_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_16 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_17_Pos  17                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_17 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_17_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_17_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_17 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_18_Pos  18                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_18 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_18_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_18_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_18 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_19_Pos  19                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_19 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_19_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_19_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_19 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_20_Pos  20                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_20 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_20_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_20_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_20 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_21_Pos  21                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_21 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_21_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_21_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_21 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_22_Pos  22                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_22 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_22_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_22_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_22 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_23_Pos  23                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_23 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_23_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_23_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_23 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_24_Pos  24                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_24 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_24_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_24_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_24 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_25_Pos  25                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_25 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_25_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_25_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_25 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_26_Pos  26                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_26 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_26_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_26_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_26 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_27_Pos  27                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_27 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_27_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_27_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_27 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_28_Pos  28                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_28 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_28_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_28_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_28 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_29_Pos  29                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_29 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_29_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_29_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_29 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_30_Pos  30                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_30 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_30_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_30_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_30 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_31_Pos  31                                                      /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_31 Position */
#define GPIO_GROUP_INTn_PORT_ENA6_ENA_31_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA6_ENA_31_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA6: ENA_31 Mask  */

/* --------------------------  GPIO_GROUP_INTn_PORT_ENA7  ------------------------- */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_0_Pos   0                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_0 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_0_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_0_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_0 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_1_Pos   1                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_1 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_1_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_1_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_1 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_2_Pos   2                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_2 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_2_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_2_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_2 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_3_Pos   3                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_3 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_3_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_3_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_3 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_4_Pos   4                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_4 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_4_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_4_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_4 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_5_Pos   5                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_5 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_5_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_5_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_5 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_6_Pos   6                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_6 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_6_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_6_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_6 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_7_Pos   7                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_7 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_7_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_7_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_7 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_8_Pos   8                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_8 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_8_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_8_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_8 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_9_Pos   9                                                       /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_9 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_9_Msk   (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_9_Pos)         /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_9 Mask   */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_10_Pos  10                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_10 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_10_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_10_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_10 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_11_Pos  11                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_11 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_11_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_11_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_11 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_12_Pos  12                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_12 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_12_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_12_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_12 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_13_Pos  13                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_13 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_13_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_13_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_13 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_14_Pos  14                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_14 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_14_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_14_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_14 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_15_Pos  15                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_15 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_15_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_15_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_15 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_16_Pos  16                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_16 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_16_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_16_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_16 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_17_Pos  17                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_17 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_17_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_17_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_17 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_18_Pos  18                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_18 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_18_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_18_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_18 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_19_Pos  19                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_19 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_19_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_19_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_19 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_20_Pos  20                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_20 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_20_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_20_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_20 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_21_Pos  21                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_21 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_21_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_21_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_21 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_22_Pos  22                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_22 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_22_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_22_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_22 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_23_Pos  23                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_23 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_23_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_23_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_23 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_24_Pos  24                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_24 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_24_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_24_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_24 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_25_Pos  25                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_25 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_25_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_25_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_25 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_26_Pos  26                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_26 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_26_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_26_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_26 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_27_Pos  27                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_27 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_27_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_27_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_27 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_28_Pos  28                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_28 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_28_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_28_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_28 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_29_Pos  29                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_29 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_29_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_29_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_29 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_30_Pos  30                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_30 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_30_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_30_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_30 Mask  */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_31_Pos  31                                                      /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_31 Position */
#define GPIO_GROUP_INTn_PORT_ENA7_ENA_31_Msk  (0x01UL << GPIO_GROUP_INTn_PORT_ENA7_ENA_31_Pos)        /*!< GPIO_GROUP_INTn PORT_ENA7: ENA_31 Mask  */


/* ================================================================================ */
/* ================    struct 'GPIO_GROUP_INT0' Position & Mask    ================ */
/* ================================================================================ */


/* ----------------------------  GPIO_GROUP_INT0_CTRL  ---------------------------- */
#define GPIO_GROUP_INT0_CTRL_INT_Pos          0                                                       /*!< GPIO_GROUP_INT0 CTRL: INT Position      */
#define GPIO_GROUP_INT0_CTRL_INT_Msk          (0x01UL << GPIO_GROUP_INT0_CTRL_INT_Pos)                /*!< GPIO_GROUP_INT0 CTRL: INT Mask          */
#define GPIO_GROUP_INT0_CTRL_COMB_Pos         1                                                       /*!< GPIO_GROUP_INT0 CTRL: COMB Position     */
#define GPIO_GROUP_INT0_CTRL_COMB_Msk         (0x01UL << GPIO_GROUP_INT0_CTRL_COMB_Pos)               /*!< GPIO_GROUP_INT0 CTRL: COMB Mask         */
#define GPIO_GROUP_INT0_CTRL_TRIG_Pos         2                                                       /*!< GPIO_GROUP_INT0 CTRL: TRIG Position     */
#define GPIO_GROUP_INT0_CTRL_TRIG_Msk         (0x01UL << GPIO_GROUP_INT0_CTRL_TRIG_Pos)               /*!< GPIO_GROUP_INT0 CTRL: TRIG Mask         */

