roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------  GPIO_GROUP_INT1_PORT_ENA7  ------------------------- */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_0_Pos   0                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_0 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_0_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_0_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_0 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_1_Pos   1                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_1 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_1_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_1_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_1 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_2_Pos   2                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_2 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_2_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_2_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_2 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_3_Pos   3                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_3 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_3_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_3_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_3 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_4_Pos   4                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_4 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_4_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_4_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_4 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_5_Pos   5                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_5 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_5_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_5_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_5 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_6_Pos   6                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_6 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_6_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_6_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_6 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_7_Pos   7                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_7 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_7_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_7_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_7 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_8_Pos   8                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_8 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_8_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_8_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_8 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_9_Pos   9                                                       /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_9 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_9_Msk   (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_9_Pos)         /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_9 Mask   */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_10_Pos  10                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_10 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_10_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_10_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_10 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_11_Pos  11                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_11 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_11_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_11_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_11 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_12_Pos  12                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_12 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_12_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_12_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_12 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_13_Pos  13                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_13 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_13_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_13_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_13 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_14_Pos  14                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_14 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_14_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_14_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_14 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_15_Pos  15                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_15 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_15_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_15_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_15 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_16_Pos  16                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_16 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_16_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_16_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_16 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_17_Pos  17                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_17 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_17_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_17_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_17 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_18_Pos  18                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_18 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_18_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_18_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_18 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_19_Pos  19                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_19 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_19_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_19_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_19 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_20_Pos  20                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_20 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_20_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_20_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_20 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_21_Pos  21                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_21 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_21_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_21_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_21 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_22_Pos  22                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_22 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_22_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_22_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_22 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_23_Pos  23                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_23 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_23_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_23_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_23 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_24_Pos  24                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_24 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_24_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_24_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_24 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_25_Pos  25                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_25 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_25_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_25_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_25 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_26_Pos  26                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_26 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_26_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_26_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_26 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_27_Pos  27                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_27 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_27_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_27_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_27 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_28_Pos  28                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_28 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_28_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_28_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_28 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_29_Pos  29                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_29 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_29_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_29_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_29 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_30_Pos  30                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_30 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_30_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_30_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_30 Mask  */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_31_Pos  31                                                      /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_31 Position */
#define GPIO_GROUP_INT1_PORT_ENA7_ENA_31_Msk  (0x01UL << GPIO_GROUP_INT1_PORT_ENA7_ENA_31_Pos)        /*!< GPIO_GROUP_INT1 PORT_ENA7: ENA_31 Mask  */


/* ================================================================================ */
/* ================         struct 'MCPWM' Position & Mask         ================ */
/* ================================================================================ */


/* ----------------------------------  MCPWM_CON  --------------------------------- */
#define MCPWM_CON_RUN0_Pos                    0                                                       /*!< MCPWM CON: RUN0 Position                */
#define MCPWM_CON_RUN0_Msk                    (0x01UL << MCPWM_CON_RUN0_Pos)                          /*!< MCPWM CON: RUN0 Mask                    */
#define MCPWM_CON_CENTER0_Pos                 1                                                       /*!< MCPWM CON: CENTER0 Position             */
#define MCPWM_CON_CENTER0_Msk                 (0x01UL << MCPWM_CON_CENTER0_Pos)                       /*!< MCPWM CON: CENTER0 Mask                 */
#define MCPWM_CON_POLA0_Pos                   2                                                       /*!< MCPWM CON: POLA0 Position               */
#define MCPWM_CON_POLA0_Msk                   (0x01UL << MCPWM_CON_POLA0_Pos)                         /*!< MCPWM CON: POLA0 Mask                   */
#define MCPWM_CON_DTE0_Pos                    3                                                       /*!< MCPWM CON: DTE0 Position                */
#define MCPWM_CON_DTE0_Msk                    (0x01UL << MCPWM_CON_DTE0_Pos)                          /*!< MCPWM CON: DTE0 Mask                    */
#define MCPWM_CON_DISUP0_Pos                  4                                                       /*!< MCPWM CON: DISUP0 Position              */
#define MCPWM_CON_DISUP0_Msk                  (0x01UL << MCPWM_CON_DISUP0_Pos)                        /*!< MCPWM CON: DISUP0 Mask                  */
#define MCPWM_CON_RUN1_Pos                    8                                                       /*!< MCPWM CON: RUN1 Position                */
#define MCPWM_CON_RUN1_Msk                    (0x01UL << MCPWM_CON_RUN1_Pos)                          /*!< MCPWM CON: RUN1 Mask                    */
#define MCPWM_CON_CENTER1_Pos                 9                                                       /*!< MCPWM CON: CENTER1 Position             */
#define MCPWM_CON_CENTER1_Msk                 (0x01UL << MCPWM_CON_CENTER1_Pos)                       /*!< MCPWM CON: CENTER1 Mask                 */
#define MCPWM_CON_POLA1_Pos                   10                                                      /*!< MCPWM CON: POLA1 Position               */
#define MCPWM_CON_POLA1_Msk                   (0x01UL << MCPWM_CON_POLA1_Pos)                         /*!< MCPWM CON: POLA1 Mask                   */
#define MCPWM_CON_DTE1_Pos                    11                                                      /*!< MCPWM CON: DTE1 Position                */
#define MCPWM_CON_DTE1_Msk                    (0x01UL << MCPWM_CON_DTE1_Pos)                          /*!< MCPWM CON: DTE1 Mask                    */
#define MCPWM_CON_DISUP1_Pos                  12                                                      /*!< MCPWM CON: DISUP1 Position              */
#define MCPWM_CON_DISUP1_Msk                  (0x01UL << MCPWM_CON_DISUP1_Pos)                        /*!< MCPWM CON: DISUP1 Mask                  */
#define MCPWM_CON_RUN2_Pos                    16                                                      /*!< MCPWM CON: RUN2 Position                */
#define MCPWM_CON_RUN2_Msk                    (0x01UL << MCPWM_CON_RUN2_Pos)                          /*!< MCPWM CON: RUN2 Mask                    */
#define MCPWM_CON_CENTER2_Pos                 17                                                      /*!< MCPWM CON: CENTER2 Position             */
#define MCPWM_CON_CENTER2_Msk                 (0x01UL << MCPWM_CON_CENTER2_Pos)                       /*!< MCPWM CON: CENTER2 Mask                 */
#define MCPWM_CON_POLA2_Pos                   18                                                      /*!< MCPWM CON: POLA2 Position               */
#define MCPWM_CON_POLA2_Msk                   (0x01UL << MCPWM_CON_POLA2_Pos)                         /*!< MCPWM CON: POLA2 Mask                   */
#define MCPWM_CON_DTE2_Pos                    19                                                      /*!< MCPWM CON: DTE2 Position                */
#define MCPWM_CON_DTE2_Msk                    (0x01UL << MCPWM_CON_DTE2_Pos)                          /*!< MCPWM CON: DTE2 Mask                    */
#define MCPWM_CON_DISUP2_Pos                  20                                                      /*!< MCPWM CON: DISUP2 Position              */
#define MCPWM_CON_DISUP2_Msk                  (0x01UL << MCPWM_CON_DISUP2_Pos)                        /*!< MCPWM CON: DISUP2 Mask                  */
#define MCPWM_CON_INVBDC_Pos                  29                                                      /*!< MCPWM CON: INVBDC Position              */
#define MCPWM_CON_INVBDC_Msk                  (0x01UL << MCPWM_CON_INVBDC_Pos)                        /*!< MCPWM CON: INVBDC Mask                  */
#define MCPWM_CON_ACMODE_Pos                  30                                                      /*!< MCPWM CON: ACMODE Position              */
#define MCPWM_CON_ACMODE_Msk                  (0x01UL << MCPWM_CON_ACMODE_Pos)                        /*!< MCPWM CON: ACMODE Mask                  */
#define MCPWM_CON_DCMODE_Pos                  31                                                      /*!< MCPWM CON: DCMODE Position              */
#define MCPWM_CON_DCMODE_Msk                  (0x01UL << MCPWM_CON_DCMODE_Pos)                        /*!< MCPWM CON: DCMODE Mask                  */

/* --------------------------------  MCPWM_CON_SET  ------------------------------- */
#define MCPWM_CON_SET_RUN0_SET_Pos            0                                                       /*!< MCPWM CON_SET: RUN0_SET Position        */
#define MCPWM_CON_SET_RUN0_SET_Msk            (0x01UL << MCPWM_CON_SET_RUN0_SET_Pos)                  /*!< MCPWM CON_SET: RUN0_SET Mask            */
#define MCPWM_CON_SET_CENTER0_SET_Pos         1                                                       /*!< MCPWM CON_SET: CENTER0_SET Position     */
#define MCPWM_CON_SET_CENTER0_SET_Msk         (0x01UL << MCPWM_CON_SET_CENTER0_SET_Pos)               /*!< MCPWM CON_SET: CENTER0_SET Mask         */
#define MCPWM_CON_SET_POLA0_SET_Pos           2                                                       /*!< MCPWM CON_SET: POLA0_SET Position       */
#define MCPWM_CON_SET_POLA0_SET_Msk           (0x01UL << MCPWM_CON_SET_POLA0_SET_Pos)                 /*!< MCPWM CON_SET: POLA0_SET Mask           */
#define MCPWM_CON_SET_DTE0_SET_Pos            3                                                       /*!< MCPWM CON_SET: DTE0_SET Position        */
#define MCPWM_CON_SET_DTE0_SET_Msk            (0x01UL << MCPWM_CON_SET_DTE0_SET_Pos)                  /*!< MCPWM CON_SET: DTE0_SET Mask            */
#define MCPWM_CON_SET_DISUP0_SET_Pos          4                                                       /*!< MCPWM CON_SET: DISUP0_SET Position      */
#define MCPWM_CON_SET_DISUP0_SET_Msk          (0x01UL << MCPWM_CON_SET_DISUP0_SET_Pos)                /*!< MCPWM CON_SET: DISUP0_SET Mask          */
#define MCPWM_CON_SET_RUN1_SET_Pos            8                                                       /*!< MCPWM CON_SET: RUN1_SET Position        */
#define MCPWM_CON_SET_RUN1_SET_Msk            (0x01UL << MCPWM_CON_SET_RUN1_SET_Pos)                  /*!< MCPWM CON_SET: RUN1_SET Mask            */
#define MCPWM_CON_SET_CENTER1_SET_Pos         9                                                       /*!< MCPWM CON_SET: CENTER1_SET Position     */
#define MCPWM_CON_SET_CENTER1_SET_Msk         (0x01UL << MCPWM_CON_SET_CENTER1_SET_Pos)               /*!< MCPWM CON_SET: CENTER1_SET Mask         */
#define MCPWM_CON_SET_POLA1_SET_Pos           10                                                      /*!< MCPWM CON_SET: POLA1_SET Position       */
#define MCPWM_CON_SET_POLA1_SET_Msk           (0x01UL << MCPWM_CON_SET_POLA1_SET_Pos)                 /*!< MCPWM CON_SET: POLA1_SET Mask           */
#define MCPWM_CON_SET_DTE1_SET_Pos            11                                                      /*!< MCPWM CON_SET: DTE1_SET Position        */
#define MCPWM_CON_SET_DTE1_SET_Msk            (0x01UL << MCPWM_CON_SET_DTE1_SET_Pos)                  /*!< MCPWM CON_SET: DTE1_SET Mask            */
#define MCPWM_CON_SET_DISUP1_SET_Pos          12                                                      /*!< MCPWM CON_SET: DISUP1_SET Position      */
#define MCPWM_CON_SET_DISUP1_SET_Msk          (0x01UL << MCPWM_CON_SET_DISUP1_SET_Pos)                /*!< MCPWM CON_SET: DISUP1_SET Mask          */
#define MCPWM_CON_SET_RUN2_SET_Pos            16                                                      /*!< MCPWM CON_SET: RUN2_SET Position        */
#define MCPWM_CON_SET_RUN2_SET_Msk            (0x01UL << MCPWM_CON_SET_RUN2_SET_Pos)                  /*!< MCPWM CON_SET: RUN2_SET Mask            */
#define MCPWM_CON_SET_CENTER2_SET_Pos         17                                                      /*!< MCPWM CON_SET: CENTER2_SET Position     */
#define MCPWM_CON_SET_CENTER2_SET_Msk         (0x01UL << MCPWM_CON_SET_CENTER2_SET_Pos)               /*!< MCPWM CON_SET: CENTER2_SET Mask         */
#define MCPWM_CON_SET_POLA2_SET_Pos           18                                                      /*!< MCPWM CON_SET: POLA2_SET Position       */
#define MCPWM_CON_SET_POLA2_SET_Msk           (0x01UL << MCPWM_CON_SET_POLA2_SET_Pos)                 /*!< MCPWM CON_SET: POLA2_SET Mask           */
#define MCPWM_CON_SET_DTE2_SET_Pos            19                                                      /*!< MCPWM CON_SET: DTE2_SET Position        */
#define MCPWM_CON_SET_DTE2_SET_Msk            (0x01UL << MCPWM_CON_SET_DTE2_SET_Pos)                  /*!< MCPWM CON_SET: DTE2_SET Mask            */
#define MCPWM_CON_SET_DISUP2_SET_Pos          20                                                      /*!< MCPWM CON_SET: DISUP2_SET Position      */
#define MCPWM_CON_SET_DISUP2_SET_Msk          (0x01UL << MCPWM_CON_SET_DISUP2_SET_Pos)                /*!< MCPWM CON_SET: DISUP2_SET Mask          */
#define MCPWM_CON_SET_INVBDC_SET_Pos          29                                                      /*!< MCPWM CON_SET: INVBDC_SET Position      */
#define MCPWM_CON_SET_INVBDC_SET_Msk          (0x01UL << MCPWM_CON_SET_INVBDC_SET_Pos)                /*!< MCPWM CON_SET: INVBDC_SET Mask          */
#define MCPWM_CON_SET_ACMODE_SET_Pos          30                                                      /*!< MCPWM CON_SET: ACMODE_SET Position      */
#define MCPWM_CON_SET_ACMODE_SET_Msk          (0x01UL << MCPWM_CON_SET_ACMODE_SET_Pos)                /*!< MCPWM CON_SET: ACMODE_SET Mask          */
#define MCPWM_CON_SET_DCMODE_SET_Pos          31                                                      /*!< MCPWM CON_SET: DCMODE_SET Position      */
#define MCPWM_CON_SET_DCMODE_SET_Msk          (0x01UL << MCPWM_CON_SET_DCMODE_SET_Pos)                /*!< MCPWM CON_SET: DCMODE_SET Mask          */

