roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ------------------------------  MCPWM_CAPCON_CLR  ------------------------------ */
#define MCPWM_CAPCON_CLR_CAP0MCI0_RE_CLR_Pos  0                                                       /*!< MCPWM CAPCON_CLR: CAP0MCI0_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP0MCI0_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP0MCI0_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP0MCI0_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP0MCI0_FE_CLR_Pos  1                                                       /*!< MCPWM CAPCON_CLR: CAP0MCI0_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP0MCI0_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP0MCI0_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP0MCI0_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP0MCI1_RE_CLR_Pos  2                                                       /*!< MCPWM CAPCON_CLR: CAP0MCI1_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP0MCI1_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP0MCI1_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP0MCI1_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP0MCI1_FE_CLR_Pos  3                                                       /*!< MCPWM CAPCON_CLR: CAP0MCI1_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP0MCI1_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP0MCI1_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP0MCI1_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP0MCI2_RE_CLR_Pos  4                                                       /*!< MCPWM CAPCON_CLR: CAP0MCI2_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP0MCI2_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP0MCI2_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP0MCI2_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP0MCI2_FE_CLR_Pos  5                                                       /*!< MCPWM CAPCON_CLR: CAP0MCI2_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP0MCI2_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP0MCI2_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP0MCI2_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP1MCI0_RE_CLR_Pos  6                                                       /*!< MCPWM CAPCON_CLR: CAP1MCI0_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP1MCI0_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP1MCI0_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP1MCI0_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP1MCI0_FE_CLR_Pos  7                                                       /*!< MCPWM CAPCON_CLR: CAP1MCI0_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP1MCI0_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP1MCI0_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP1MCI0_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP1MCI1_RE_CLR_Pos  8                                                       /*!< MCPWM CAPCON_CLR: CAP1MCI1_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP1MCI1_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP1MCI1_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP1MCI1_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP1MCI1_FE_CLR_Pos  9                                                       /*!< MCPWM CAPCON_CLR: CAP1MCI1_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP1MCI1_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP1MCI1_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP1MCI1_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP1MCI2_RE_CLR_Pos  10                                                      /*!< MCPWM CAPCON_CLR: CAP1MCI2_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP1MCI2_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP1MCI2_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP1MCI2_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP1MCI2_FE_CLR_Pos  11                                                      /*!< MCPWM CAPCON_CLR: CAP1MCI2_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP1MCI2_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP1MCI2_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP1MCI2_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP2MCI0_RE_CLR_Pos  12                                                      /*!< MCPWM CAPCON_CLR: CAP2MCI0_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP2MCI0_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP2MCI0_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP2MCI0_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP2MCI0_FE_CLR_Pos  13                                                      /*!< MCPWM CAPCON_CLR: CAP2MCI0_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP2MCI0_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP2MCI0_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP2MCI0_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP2MCI1_RE_CLR_Pos  14                                                      /*!< MCPWM CAPCON_CLR: CAP2MCI1_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP2MCI1_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP2MCI1_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP2MCI1_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP2MCI1_FE_CLR_Pos  15                                                      /*!< MCPWM CAPCON_CLR: CAP2MCI1_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP2MCI1_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP2MCI1_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP2MCI1_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP2MCI2_RE_CLR_Pos  16                                                      /*!< MCPWM CAPCON_CLR: CAP2MCI2_RE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP2MCI2_RE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP2MCI2_RE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP2MCI2_RE_CLR Mask  */
#define MCPWM_CAPCON_CLR_CAP2MCI2_FE_CLR_Pos  17                                                      /*!< MCPWM CAPCON_CLR: CAP2MCI2_FE_CLR Position */
#define MCPWM_CAPCON_CLR_CAP2MCI2_FE_CLR_Msk  (0x01UL << MCPWM_CAPCON_CLR_CAP2MCI2_FE_CLR_Pos)        /*!< MCPWM CAPCON_CLR: CAP2MCI2_FE_CLR Mask  */
#define MCPWM_CAPCON_CLR_RT0_CLR_Pos          18                                                      /*!< MCPWM CAPCON_CLR: RT0_CLR Position      */
#define MCPWM_CAPCON_CLR_RT0_CLR_Msk          (0x01UL << MCPWM_CAPCON_CLR_RT0_CLR_Pos)                /*!< MCPWM CAPCON_CLR: RT0_CLR Mask          */
#define MCPWM_CAPCON_CLR_RT1_CLR_Pos          19                                                      /*!< MCPWM CAPCON_CLR: RT1_CLR Position      */
#define MCPWM_CAPCON_CLR_RT1_CLR_Msk          (0x01UL << MCPWM_CAPCON_CLR_RT1_CLR_Pos)                /*!< MCPWM CAPCON_CLR: RT1_CLR Mask          */
#define MCPWM_CAPCON_CLR_RT2_CLR_Pos          20                                                      /*!< MCPWM CAPCON_CLR: RT2_CLR Position      */
#define MCPWM_CAPCON_CLR_RT2_CLR_Msk          (0x01UL << MCPWM_CAPCON_CLR_RT2_CLR_Pos)                /*!< MCPWM CAPCON_CLR: RT2_CLR Mask          */

