roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  MCPWM_INTEN  -------------------------------- */
#define MCPWM_INTEN_ILIM0_Pos                 0                                                       /*!< MCPWM INTEN: ILIM0 Position             */
#define MCPWM_INTEN_ILIM0_Msk                 (0x01UL << MCPWM_INTEN_ILIM0_Pos)                       /*!< MCPWM INTEN: ILIM0 Mask                 */
#define MCPWM_INTEN_IMAT0_Pos                 1                                                       /*!< MCPWM INTEN: IMAT0 Position             */
#define MCPWM_INTEN_IMAT0_Msk                 (0x01UL << MCPWM_INTEN_IMAT0_Pos)                       /*!< MCPWM INTEN: IMAT0 Mask                 */
#define MCPWM_INTEN_ICAP0_Pos                 2                                                       /*!< MCPWM INTEN: ICAP0 Position             */
#define MCPWM_INTEN_ICAP0_Msk                 (0x01UL << MCPWM_INTEN_ICAP0_Pos)                       /*!< MCPWM INTEN: ICAP0 Mask                 */
#define MCPWM_INTEN_ILIM1_Pos                 4                                                       /*!< MCPWM INTEN: ILIM1 Position             */
#define MCPWM_INTEN_ILIM1_Msk                 (0x01UL << MCPWM_INTEN_ILIM1_Pos)                       /*!< MCPWM INTEN: ILIM1 Mask                 */
#define MCPWM_INTEN_IMAT1_Pos                 5                                                       /*!< MCPWM INTEN: IMAT1 Position             */
#define MCPWM_INTEN_IMAT1_Msk                 (0x01UL << MCPWM_INTEN_IMAT1_Pos)                       /*!< MCPWM INTEN: IMAT1 Mask                 */
#define MCPWM_INTEN_ICAP1_Pos                 6                                                       /*!< MCPWM INTEN: ICAP1 Position             */
#define MCPWM_INTEN_ICAP1_Msk                 (0x01UL << MCPWM_INTEN_ICAP1_Pos)                       /*!< MCPWM INTEN: ICAP1 Mask                 */
#define MCPWM_INTEN_ILIM2_Pos                 8                                                       /*!< MCPWM INTEN: ILIM2 Position             */
#define MCPWM_INTEN_ILIM2_Msk                 (0x01UL << MCPWM_INTEN_ILIM2_Pos)                       /*!< MCPWM INTEN: ILIM2 Mask                 */
#define MCPWM_INTEN_IMAT2_Pos                 9                                                       /*!< MCPWM INTEN: IMAT2 Position             */
#define MCPWM_INTEN_IMAT2_Msk                 (0x01UL << MCPWM_INTEN_IMAT2_Pos)                       /*!< MCPWM INTEN: IMAT2 Mask                 */
#define MCPWM_INTEN_ICAP2_Pos                 10                                                      /*!< MCPWM INTEN: ICAP2 Position             */
#define MCPWM_INTEN_ICAP2_Msk                 (0x01UL << MCPWM_INTEN_ICAP2_Pos)                       /*!< MCPWM INTEN: ICAP2 Mask                 */
#define MCPWM_INTEN_ABORT_Pos                 15                                                      /*!< MCPWM INTEN: ABORT Position             */
#define MCPWM_INTEN_ABORT_Msk                 (0x01UL << MCPWM_INTEN_ABORT_Pos)                       /*!< MCPWM INTEN: ABORT Mask                 */

/* -------------------------------  MCPWM_INTEN_SET  ------------------------------ */
#define MCPWM_INTEN_SET_ILIM0_SET_Pos         0                                                       /*!< MCPWM INTEN_SET: ILIM0_SET Position     */
#define MCPWM_INTEN_SET_ILIM0_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ILIM0_SET_Pos)               /*!< MCPWM INTEN_SET: ILIM0_SET Mask         */
#define MCPWM_INTEN_SET_IMAT0_SET_Pos         1                                                       /*!< MCPWM INTEN_SET: IMAT0_SET Position     */
#define MCPWM_INTEN_SET_IMAT0_SET_Msk         (0x01UL << MCPWM_INTEN_SET_IMAT0_SET_Pos)               /*!< MCPWM INTEN_SET: IMAT0_SET Mask         */
#define MCPWM_INTEN_SET_ICAP0_SET_Pos         2                                                       /*!< MCPWM INTEN_SET: ICAP0_SET Position     */
#define MCPWM_INTEN_SET_ICAP0_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ICAP0_SET_Pos)               /*!< MCPWM INTEN_SET: ICAP0_SET Mask         */
#define MCPWM_INTEN_SET_ILIM1_SET_Pos         4                                                       /*!< MCPWM INTEN_SET: ILIM1_SET Position     */
#define MCPWM_INTEN_SET_ILIM1_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ILIM1_SET_Pos)               /*!< MCPWM INTEN_SET: ILIM1_SET Mask         */
#define MCPWM_INTEN_SET_IMAT1_SET_Pos         5                                                       /*!< MCPWM INTEN_SET: IMAT1_SET Position     */
#define MCPWM_INTEN_SET_IMAT1_SET_Msk         (0x01UL << MCPWM_INTEN_SET_IMAT1_SET_Pos)               /*!< MCPWM INTEN_SET: IMAT1_SET Mask         */
#define MCPWM_INTEN_SET_ICAP1_SET_Pos         6                                                       /*!< MCPWM INTEN_SET: ICAP1_SET Position     */
#define MCPWM_INTEN_SET_ICAP1_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ICAP1_SET_Pos)               /*!< MCPWM INTEN_SET: ICAP1_SET Mask         */
#define MCPWM_INTEN_SET_ILIM2_SET_Pos         9                                                       /*!< MCPWM INTEN_SET: ILIM2_SET Position     */
#define MCPWM_INTEN_SET_ILIM2_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ILIM2_SET_Pos)               /*!< MCPWM INTEN_SET: ILIM2_SET Mask         */
#define MCPWM_INTEN_SET_IMAT2_SET_Pos         10                                                      /*!< MCPWM INTEN_SET: IMAT2_SET Position     */
#define MCPWM_INTEN_SET_IMAT2_SET_Msk         (0x01UL << MCPWM_INTEN_SET_IMAT2_SET_Pos)               /*!< MCPWM INTEN_SET: IMAT2_SET Mask         */
#define MCPWM_INTEN_SET_ICAP2_SET_Pos         11                                                      /*!< MCPWM INTEN_SET: ICAP2_SET Position     */
#define MCPWM_INTEN_SET_ICAP2_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ICAP2_SET_Pos)               /*!< MCPWM INTEN_SET: ICAP2_SET Mask         */
#define MCPWM_INTEN_SET_ABORT_SET_Pos         15                                                      /*!< MCPWM INTEN_SET: ABORT_SET Position     */
#define MCPWM_INTEN_SET_ABORT_SET_Msk         (0x01UL << MCPWM_INTEN_SET_ABORT_SET_Pos)               /*!< MCPWM INTEN_SET: ABORT_SET Mask         */

/* -------------------------------  MCPWM_INTEN_CLR  ------------------------------ */
#define MCPWM_INTEN_CLR_ILIM0_CLR_Pos         0                                                       /*!< MCPWM INTEN_CLR: ILIM0_CLR Position     */
#define MCPWM_INTEN_CLR_ILIM0_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ILIM0_CLR_Pos)               /*!< MCPWM INTEN_CLR: ILIM0_CLR Mask         */
#define MCPWM_INTEN_CLR_IMAT0_CLR_Pos         1                                                       /*!< MCPWM INTEN_CLR: IMAT0_CLR Position     */
#define MCPWM_INTEN_CLR_IMAT0_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_IMAT0_CLR_Pos)               /*!< MCPWM INTEN_CLR: IMAT0_CLR Mask         */
#define MCPWM_INTEN_CLR_ICAP0_CLR_Pos         2                                                       /*!< MCPWM INTEN_CLR: ICAP0_CLR Position     */
#define MCPWM_INTEN_CLR_ICAP0_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ICAP0_CLR_Pos)               /*!< MCPWM INTEN_CLR: ICAP0_CLR Mask         */
#define MCPWM_INTEN_CLR_ILIM1_CLR_Pos         4                                                       /*!< MCPWM INTEN_CLR: ILIM1_CLR Position     */
#define MCPWM_INTEN_CLR_ILIM1_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ILIM1_CLR_Pos)               /*!< MCPWM INTEN_CLR: ILIM1_CLR Mask         */
#define MCPWM_INTEN_CLR_IMAT1_CLR_Pos         5                                                       /*!< MCPWM INTEN_CLR: IMAT1_CLR Position     */
#define MCPWM_INTEN_CLR_IMAT1_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_IMAT1_CLR_Pos)               /*!< MCPWM INTEN_CLR: IMAT1_CLR Mask         */
#define MCPWM_INTEN_CLR_ICAP1_CLR_Pos         6                                                       /*!< MCPWM INTEN_CLR: ICAP1_CLR Position     */
#define MCPWM_INTEN_CLR_ICAP1_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ICAP1_CLR_Pos)               /*!< MCPWM INTEN_CLR: ICAP1_CLR Mask         */
#define MCPWM_INTEN_CLR_ILIM2_CLR_Pos         8                                                       /*!< MCPWM INTEN_CLR: ILIM2_CLR Position     */
#define MCPWM_INTEN_CLR_ILIM2_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ILIM2_CLR_Pos)               /*!< MCPWM INTEN_CLR: ILIM2_CLR Mask         */
#define MCPWM_INTEN_CLR_IMAT2_CLR_Pos         9                                                       /*!< MCPWM INTEN_CLR: IMAT2_CLR Position     */
#define MCPWM_INTEN_CLR_IMAT2_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_IMAT2_CLR_Pos)               /*!< MCPWM INTEN_CLR: IMAT2_CLR Mask         */
#define MCPWM_INTEN_CLR_ICAP2_CLR_Pos         10                                                      /*!< MCPWM INTEN_CLR: ICAP2_CLR Position     */
#define MCPWM_INTEN_CLR_ICAP2_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ICAP2_CLR_Pos)               /*!< MCPWM INTEN_CLR: ICAP2_CLR Mask         */
#define MCPWM_INTEN_CLR_ABORT_CLR_Pos         15                                                      /*!< MCPWM INTEN_CLR: ABORT_CLR Position     */
#define MCPWM_INTEN_CLR_ABORT_CLR_Msk         (0x01UL << MCPWM_INTEN_CLR_ABORT_CLR_Pos)               /*!< MCPWM INTEN_CLR: ABORT_CLR Mask         */

/* --------------------------------  MCPWM_CNTCON  -------------------------------- */
#define MCPWM_CNTCON_TC0MCI0_RE_Pos           0                                                       /*!< MCPWM CNTCON: TC0MCI0_RE Position       */
#define MCPWM_CNTCON_TC0MCI0_RE_Msk           (0x01UL << MCPWM_CNTCON_TC0MCI0_RE_Pos)                 /*!< MCPWM CNTCON: TC0MCI0_RE Mask           */
#define MCPWM_CNTCON_TC0MCI0_FE_Pos           1                                                       /*!< MCPWM CNTCON: TC0MCI0_FE Position       */
#define MCPWM_CNTCON_TC0MCI0_FE_Msk           (0x01UL << MCPWM_CNTCON_TC0MCI0_FE_Pos)                 /*!< MCPWM CNTCON: TC0MCI0_FE Mask           */
#define MCPWM_CNTCON_TC0MCI1_RE_Pos           2                                                       /*!< MCPWM CNTCON: TC0MCI1_RE Position       */
#define MCPWM_CNTCON_TC0MCI1_RE_Msk           (0x01UL << MCPWM_CNTCON_TC0MCI1_RE_Pos)                 /*!< MCPWM CNTCON: TC0MCI1_RE Mask           */
#define MCPWM_CNTCON_TC0MCI1_FE_Pos           3                                                       /*!< MCPWM CNTCON: TC0MCI1_FE Position       */
#define MCPWM_CNTCON_TC0MCI1_FE_Msk           (0x01UL << MCPWM_CNTCON_TC0MCI1_FE_Pos)                 /*!< MCPWM CNTCON: TC0MCI1_FE Mask           */
#define MCPWM_CNTCON_TC0MCI2_RE_Pos           4                                                       /*!< MCPWM CNTCON: TC0MCI2_RE Position       */
#define MCPWM_CNTCON_TC0MCI2_RE_Msk           (0x01UL << MCPWM_CNTCON_TC0MCI2_RE_Pos)                 /*!< MCPWM CNTCON: TC0MCI2_RE Mask           */
#define MCPWM_CNTCON_TC0MCI2_FE_Pos           5                                                       /*!< MCPWM CNTCON: TC0MCI2_FE Position       */
#define MCPWM_CNTCON_TC0MCI2_FE_Msk           (0x01UL << MCPWM_CNTCON_TC0MCI2_FE_Pos)                 /*!< MCPWM CNTCON: TC0MCI2_FE Mask           */
#define MCPWM_CNTCON_TC1MCI0_RE_Pos           6                                                       /*!< MCPWM CNTCON: TC1MCI0_RE Position       */
#define MCPWM_CNTCON_TC1MCI0_RE_Msk           (0x01UL << MCPWM_CNTCON_TC1MCI0_RE_Pos)                 /*!< MCPWM CNTCON: TC1MCI0_RE Mask           */
#define MCPWM_CNTCON_TC1MCI0_FE_Pos           7                                                       /*!< MCPWM CNTCON: TC1MCI0_FE Position       */
#define MCPWM_CNTCON_TC1MCI0_FE_Msk           (0x01UL << MCPWM_CNTCON_TC1MCI0_FE_Pos)                 /*!< MCPWM CNTCON: TC1MCI0_FE Mask           */
#define MCPWM_CNTCON_TC1MCI1_RE_Pos           8                                                       /*!< MCPWM CNTCON: TC1MCI1_RE Position       */
#define MCPWM_CNTCON_TC1MCI1_RE_Msk           (0x01UL << MCPWM_CNTCON_TC1MCI1_RE_Pos)                 /*!< MCPWM CNTCON: TC1MCI1_RE Mask           */
#define MCPWM_CNTCON_TC1MCI1_FE_Pos           9                                                       /*!< MCPWM CNTCON: TC1MCI1_FE Position       */
#define MCPWM_CNTCON_TC1MCI1_FE_Msk           (0x01UL << MCPWM_CNTCON_TC1MCI1_FE_Pos)                 /*!< MCPWM CNTCON: TC1MCI1_FE Mask           */
#define MCPWM_CNTCON_TC1MCI2_RE_Pos           10                                                      /*!< MCPWM CNTCON: TC1MCI2_RE Position       */
#define MCPWM_CNTCON_TC1MCI2_RE_Msk           (0x01UL << MCPWM_CNTCON_TC1MCI2_RE_Pos)                 /*!< MCPWM CNTCON: TC1MCI2_RE Mask           */
#define MCPWM_CNTCON_TC1MCI2_FE_Pos           11                                                      /*!< MCPWM CNTCON: TC1MCI2_FE Position       */
#define MCPWM_CNTCON_TC1MCI2_FE_Msk           (0x01UL << MCPWM_CNTCON_TC1MCI2_FE_Pos)                 /*!< MCPWM CNTCON: TC1MCI2_FE Mask           */
#define MCPWM_CNTCON_TC2MCI0_RE_Pos           12                                                      /*!< MCPWM CNTCON: TC2MCI0_RE Position       */
#define MCPWM_CNTCON_TC2MCI0_RE_Msk           (0x01UL << MCPWM_CNTCON_TC2MCI0_RE_Pos)                 /*!< MCPWM CNTCON: TC2MCI0_RE Mask           */
#define MCPWM_CNTCON_TC2MCI0_FE_Pos           13                                                      /*!< MCPWM CNTCON: TC2MCI0_FE Position       */
#define MCPWM_CNTCON_TC2MCI0_FE_Msk           (0x01UL << MCPWM_CNTCON_TC2MCI0_FE_Pos)                 /*!< MCPWM CNTCON: TC2MCI0_FE Mask           */
#define MCPWM_CNTCON_TC2MCI1_RE_Pos           14                                                      /*!< MCPWM CNTCON: TC2MCI1_RE Position       */
#define MCPWM_CNTCON_TC2MCI1_RE_Msk           (0x01UL << MCPWM_CNTCON_TC2MCI1_RE_Pos)                 /*!< MCPWM CNTCON: TC2MCI1_RE Mask           */
#define MCPWM_CNTCON_TC2MCI1_FE_Pos           15                                                      /*!< MCPWM CNTCON: TC2MCI1_FE Position       */
#define MCPWM_CNTCON_TC2MCI1_FE_Msk           (0x01UL << MCPWM_CNTCON_TC2MCI1_FE_Pos)                 /*!< MCPWM CNTCON: TC2MCI1_FE Mask           */
#define MCPWM_CNTCON_TC2MCI2_RE_Pos           16                                                      /*!< MCPWM CNTCON: TC2MCI2_RE Position       */
#define MCPWM_CNTCON_TC2MCI2_RE_Msk           (0x01UL << MCPWM_CNTCON_TC2MCI2_RE_Pos)                 /*!< MCPWM CNTCON: TC2MCI2_RE Mask           */
#define MCPWM_CNTCON_TC2MCI2_FE_Pos           17                                                      /*!< MCPWM CNTCON: TC2MCI2_FE Position       */
#define MCPWM_CNTCON_TC2MCI2_FE_Msk           (0x01UL << MCPWM_CNTCON_TC2MCI2_FE_Pos)                 /*!< MCPWM CNTCON: TC2MCI2_FE Mask           */
#define MCPWM_CNTCON_CNTR0_Pos                29                                                      /*!< MCPWM CNTCON: CNTR0 Position            */
#define MCPWM_CNTCON_CNTR0_Msk                (0x01UL << MCPWM_CNTCON_CNTR0_Pos)                      /*!< MCPWM CNTCON: CNTR0 Mask                */
#define MCPWM_CNTCON_CNTR1_Pos                30                                                      /*!< MCPWM CNTCON: CNTR1 Position            */
#define MCPWM_CNTCON_CNTR1_Msk                (0x01UL << MCPWM_CNTCON_CNTR1_Pos)                      /*!< MCPWM CNTCON: CNTR1 Mask                */
#define MCPWM_CNTCON_CNTR2_Pos                31                                                      /*!< MCPWM CNTCON: CNTR2 Position            */
#define MCPWM_CNTCON_CNTR2_Msk                (0x01UL << MCPWM_CNTCON_CNTR2_Pos)                      /*!< MCPWM CNTCON: CNTR2 Mask                */

/* ------------------------------  MCPWM_CNTCON_SET  ------------------------------ */
#define MCPWM_CNTCON_SET_TC0MCI0_RE_SET_Pos   0                                                       /*!< MCPWM CNTCON_SET: TC0MCI0_RE_SET Position */
#define MCPWM_CNTCON_SET_TC0MCI0_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC0MCI0_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC0MCI0_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC0MCI0_FE_SET_Pos   1                                                       /*!< MCPWM CNTCON_SET: TC0MCI0_FE_SET Position */
#define MCPWM_CNTCON_SET_TC0MCI0_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC0MCI0_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC0MCI0_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC0MCI1_RE_SET_Pos   2                                                       /*!< MCPWM CNTCON_SET: TC0MCI1_RE_SET Position */
#define MCPWM_CNTCON_SET_TC0MCI1_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC0MCI1_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC0MCI1_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC0MCI1_FE_SET_Pos   3                                                       /*!< MCPWM CNTCON_SET: TC0MCI1_FE_SET Position */
#define MCPWM_CNTCON_SET_TC0MCI1_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC0MCI1_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC0MCI1_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC0MCI2_RE_SET_Pos   4                                                       /*!< MCPWM CNTCON_SET: TC0MCI2_RE_SET Position */
#define MCPWM_CNTCON_SET_TC0MCI2_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC0MCI2_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC0MCI2_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC0MCI2_FE_SET_Pos   5                                                       /*!< MCPWM CNTCON_SET: TC0MCI2_FE_SET Position */
#define MCPWM_CNTCON_SET_TC0MCI2_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC0MCI2_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC0MCI2_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC1MCI0_RE_SET_Pos   6                                                       /*!< MCPWM CNTCON_SET: TC1MCI0_RE_SET Position */
#define MCPWM_CNTCON_SET_TC1MCI0_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC1MCI0_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC1MCI0_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC1MCI0_FE_SET_Pos   7                                                       /*!< MCPWM CNTCON_SET: TC1MCI0_FE_SET Position */
#define MCPWM_CNTCON_SET_TC1MCI0_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC1MCI0_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC1MCI0_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC1MCI1_RE_SET_Pos   8                                                       /*!< MCPWM CNTCON_SET: TC1MCI1_RE_SET Position */
#define MCPWM_CNTCON_SET_TC1MCI1_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC1MCI1_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC1MCI1_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC1MCI1_FE_SET_Pos   9                                                       /*!< MCPWM CNTCON_SET: TC1MCI1_FE_SET Position */
#define MCPWM_CNTCON_SET_TC1MCI1_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC1MCI1_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC1MCI1_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC1MCI2_RE_SET_Pos   10                                                      /*!< MCPWM CNTCON_SET: TC1MCI2_RE_SET Position */
#define MCPWM_CNTCON_SET_TC1MCI2_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC1MCI2_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC1MCI2_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC1MCI2_FE_SET_Pos   11                                                      /*!< MCPWM CNTCON_SET: TC1MCI2_FE_SET Position */
#define MCPWM_CNTCON_SET_TC1MCI2_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC1MCI2_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC1MCI2_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC2MCI0_RE_SET_Pos   12                                                      /*!< MCPWM CNTCON_SET: TC2MCI0_RE_SET Position */
#define MCPWM_CNTCON_SET_TC2MCI0_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC2MCI0_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC2MCI0_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC2MCI0_FE_SET_Pos   13                                                      /*!< MCPWM CNTCON_SET: TC2MCI0_FE_SET Position */
#define MCPWM_CNTCON_SET_TC2MCI0_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC2MCI0_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC2MCI0_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC2MCI1_RE_SET_Pos   14                                                      /*!< MCPWM CNTCON_SET: TC2MCI1_RE_SET Position */
#define MCPWM_CNTCON_SET_TC2MCI1_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC2MCI1_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC2MCI1_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC2MCI1_FE_SET_Pos   15                                                      /*!< MCPWM CNTCON_SET: TC2MCI1_FE_SET Position */
#define MCPWM_CNTCON_SET_TC2MCI1_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC2MCI1_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC2MCI1_FE_SET Mask   */
#define MCPWM_CNTCON_SET_TC2MCI2_RE_SET_Pos   16                                                      /*!< MCPWM CNTCON_SET: TC2MCI2_RE_SET Position */
#define MCPWM_CNTCON_SET_TC2MCI2_RE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC2MCI2_RE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC2MCI2_RE_SET Mask   */
#define MCPWM_CNTCON_SET_TC2MCI2_FE_SET_Pos   17                                                      /*!< MCPWM CNTCON_SET: TC2MCI2_FE_SET Position */
#define MCPWM_CNTCON_SET_TC2MCI2_FE_SET_Msk   (0x01UL << MCPWM_CNTCON_SET_TC2MCI2_FE_SET_Pos)         /*!< MCPWM CNTCON_SET: TC2MCI2_FE_SET Mask   */
#define MCPWM_CNTCON_SET_CNTR0_SET_Pos        29                                                      /*!< MCPWM CNTCON_SET: CNTR0_SET Position    */
#define MCPWM_CNTCON_SET_CNTR0_SET_Msk        (0x01UL << MCPWM_CNTCON_SET_CNTR0_SET_Pos)              /*!< MCPWM CNTCON_SET: CNTR0_SET Mask        */
#define MCPWM_CNTCON_SET_CNTR1_SET_Pos        30                                                      /*!< MCPWM CNTCON_SET: CNTR1_SET Position    */
#define MCPWM_CNTCON_SET_CNTR1_SET_Msk        (0x01UL << MCPWM_CNTCON_SET_CNTR1_SET_Pos)              /*!< MCPWM CNTCON_SET: CNTR1_SET Mask        */
#define MCPWM_CNTCON_SET_CNTR2_SET_Pos        31                                                      /*!< MCPWM CNTCON_SET: CNTR2_SET Position    */
#define MCPWM_CNTCON_SET_CNTR2_SET_Msk        (0x01UL << MCPWM_CNTCON_SET_CNTR2_SET_Pos)              /*!< MCPWM CNTCON_SET: CNTR2_SET Mask        */

