roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  MCPWM_INTF_SET  ------------------------------- */
#define MCPWM_INTF_SET_ILIM0_F_SET_Pos        0                                                       /*!< MCPWM INTF_SET: ILIM0_F_SET Position    */
#define MCPWM_INTF_SET_ILIM0_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ILIM0_F_SET_Pos)              /*!< MCPWM INTF_SET: ILIM0_F_SET Mask        */
#define MCPWM_INTF_SET_IMAT0_F_SET_Pos        1                                                       /*!< MCPWM INTF_SET: IMAT0_F_SET Position    */
#define MCPWM_INTF_SET_IMAT0_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_IMAT0_F_SET_Pos)              /*!< MCPWM INTF_SET: IMAT0_F_SET Mask        */
#define MCPWM_INTF_SET_ICAP0_F_SET_Pos        2                                                       /*!< MCPWM INTF_SET: ICAP0_F_SET Position    */
#define MCPWM_INTF_SET_ICAP0_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ICAP0_F_SET_Pos)              /*!< MCPWM INTF_SET: ICAP0_F_SET Mask        */
#define MCPWM_INTF_SET_ILIM1_F_SET_Pos        4                                                       /*!< MCPWM INTF_SET: ILIM1_F_SET Position    */
#define MCPWM_INTF_SET_ILIM1_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ILIM1_F_SET_Pos)              /*!< MCPWM INTF_SET: ILIM1_F_SET Mask        */
#define MCPWM_INTF_SET_IMAT1_F_SET_Pos        5                                                       /*!< MCPWM INTF_SET: IMAT1_F_SET Position    */
#define MCPWM_INTF_SET_IMAT1_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_IMAT1_F_SET_Pos)              /*!< MCPWM INTF_SET: IMAT1_F_SET Mask        */
#define MCPWM_INTF_SET_ICAP1_F_SET_Pos        6                                                       /*!< MCPWM INTF_SET: ICAP1_F_SET Position    */
#define MCPWM_INTF_SET_ICAP1_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ICAP1_F_SET_Pos)              /*!< MCPWM INTF_SET: ICAP1_F_SET Mask        */
#define MCPWM_INTF_SET_ILIM2_F_SET_Pos        8                                                       /*!< MCPWM INTF_SET: ILIM2_F_SET Position    */
#define MCPWM_INTF_SET_ILIM2_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ILIM2_F_SET_Pos)              /*!< MCPWM INTF_SET: ILIM2_F_SET Mask        */
#define MCPWM_INTF_SET_IMAT2_F_SET_Pos        9                                                       /*!< MCPWM INTF_SET: IMAT2_F_SET Position    */
#define MCPWM_INTF_SET_IMAT2_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_IMAT2_F_SET_Pos)              /*!< MCPWM INTF_SET: IMAT2_F_SET Mask        */
#define MCPWM_INTF_SET_ICAP2_F_SET_Pos        10                                                      /*!< MCPWM INTF_SET: ICAP2_F_SET Position    */
#define MCPWM_INTF_SET_ICAP2_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ICAP2_F_SET_Pos)              /*!< MCPWM INTF_SET: ICAP2_F_SET Mask        */
#define MCPWM_INTF_SET_ABORT_F_SET_Pos        15                                                      /*!< MCPWM INTF_SET: ABORT_F_SET Position    */
#define MCPWM_INTF_SET_ABORT_F_SET_Msk        (0x01UL << MCPWM_INTF_SET_ABORT_F_SET_Pos)              /*!< MCPWM INTF_SET: ABORT_F_SET Mask        */

/* -------------------------------  MCPWM_INTF_CLR  ------------------------------- */
#define MCPWM_INTF_CLR_ILIM0_F_CLR_Pos        0                                                       /*!< MCPWM INTF_CLR: ILIM0_F_CLR Position    */
#define MCPWM_INTF_CLR_ILIM0_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ILIM0_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ILIM0_F_CLR Mask        */
#define MCPWM_INTF_CLR_IMAT0_F_CLR_Pos        1                                                       /*!< MCPWM INTF_CLR: IMAT0_F_CLR Position    */
#define MCPWM_INTF_CLR_IMAT0_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_IMAT0_F_CLR_Pos)              /*!< MCPWM INTF_CLR: IMAT0_F_CLR Mask        */
#define MCPWM_INTF_CLR_ICAP0_F_CLR_Pos        2                                                       /*!< MCPWM INTF_CLR: ICAP0_F_CLR Position    */
#define MCPWM_INTF_CLR_ICAP0_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ICAP0_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ICAP0_F_CLR Mask        */
#define MCPWM_INTF_CLR_ILIM1_F_CLR_Pos        4                                                       /*!< MCPWM INTF_CLR: ILIM1_F_CLR Position    */
#define MCPWM_INTF_CLR_ILIM1_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ILIM1_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ILIM1_F_CLR Mask        */
#define MCPWM_INTF_CLR_IMAT1_F_CLR_Pos        5                                                       /*!< MCPWM INTF_CLR: IMAT1_F_CLR Position    */
#define MCPWM_INTF_CLR_IMAT1_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_IMAT1_F_CLR_Pos)              /*!< MCPWM INTF_CLR: IMAT1_F_CLR Mask        */
#define MCPWM_INTF_CLR_ICAP1_F_CLR_Pos        6                                                       /*!< MCPWM INTF_CLR: ICAP1_F_CLR Position    */
#define MCPWM_INTF_CLR_ICAP1_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ICAP1_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ICAP1_F_CLR Mask        */
#define MCPWM_INTF_CLR_ILIM2_F_CLR_Pos        8                                                       /*!< MCPWM INTF_CLR: ILIM2_F_CLR Position    */
#define MCPWM_INTF_CLR_ILIM2_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ILIM2_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ILIM2_F_CLR Mask        */
#define MCPWM_INTF_CLR_IMAT2_F_CLR_Pos        9                                                       /*!< MCPWM INTF_CLR: IMAT2_F_CLR Position    */
#define MCPWM_INTF_CLR_IMAT2_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_IMAT2_F_CLR_Pos)              /*!< MCPWM INTF_CLR: IMAT2_F_CLR Mask        */
#define MCPWM_INTF_CLR_ICAP2_F_CLR_Pos        10                                                      /*!< MCPWM INTF_CLR: ICAP2_F_CLR Position    */
#define MCPWM_INTF_CLR_ICAP2_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ICAP2_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ICAP2_F_CLR Mask        */
#define MCPWM_INTF_CLR_ABORT_F_CLR_Pos        15                                                      /*!< MCPWM INTF_CLR: ABORT_F_CLR Position    */
#define MCPWM_INTF_CLR_ABORT_F_CLR_Msk        (0x01UL << MCPWM_INTF_CLR_ABORT_F_CLR_Pos)              /*!< MCPWM INTF_CLR: ABORT_F_CLR Mask        */

/* --------------------------------  MCPWM_CAP_CLR  ------------------------------- */
#define MCPWM_CAP_CLR_CAP_CLR0_Pos            0                                                       /*!< MCPWM CAP_CLR: CAP_CLR0 Position        */
#define MCPWM_CAP_CLR_CAP_CLR0_Msk            (0x01UL << MCPWM_CAP_CLR_CAP_CLR0_Pos)                  /*!< MCPWM CAP_CLR: CAP_CLR0 Mask            */
#define MCPWM_CAP_CLR_CAP_CLR1_Pos            1                                                       /*!< MCPWM CAP_CLR: CAP_CLR1 Position        */
#define MCPWM_CAP_CLR_CAP_CLR1_Msk            (0x01UL << MCPWM_CAP_CLR_CAP_CLR1_Pos)                  /*!< MCPWM CAP_CLR: CAP_CLR1 Mask            */
#define MCPWM_CAP_CLR_CAP_CLR2_Pos            2                                                       /*!< MCPWM CAP_CLR: CAP_CLR2 Position        */
#define MCPWM_CAP_CLR_CAP_CLR2_Msk            (0x01UL << MCPWM_CAP_CLR_CAP_CLR2_Pos)                  /*!< MCPWM CAP_CLR: CAP_CLR2 Mask            */


/* ================================================================================ */
/* ================          Group 'I2Cn' Position & Mask          ================ */
/* ================================================================================ */


/* ---------------------------------  I2Cn_CONSET  -------------------------------- */
#define I2Cn_CONSET_AA_Pos                    2                                                       /*!< I2Cn CONSET: AA Position                */
#define I2Cn_CONSET_AA_Msk                    (0x01UL << I2Cn_CONSET_AA_Pos)                          /*!< I2Cn CONSET: AA Mask                    */
#define I2Cn_CONSET_SI_Pos                    3                                                       /*!< I2Cn CONSET: SI Position                */
#define I2Cn_CONSET_SI_Msk                    (0x01UL << I2Cn_CONSET_SI_Pos)                          /*!< I2Cn CONSET: SI Mask                    */
#define I2Cn_CONSET_STO_Pos                   4                                                       /*!< I2Cn CONSET: STO Position               */
#define I2Cn_CONSET_STO_Msk                   (0x01UL << I2Cn_CONSET_STO_Pos)                         /*!< I2Cn CONSET: STO Mask                   */
#define I2Cn_CONSET_STA_Pos                   5                                                       /*!< I2Cn CONSET: STA Position               */
#define I2Cn_CONSET_STA_Msk                   (0x01UL << I2Cn_CONSET_STA_Pos)                         /*!< I2Cn CONSET: STA Mask                   */
#define I2Cn_CONSET_I2EN_Pos                  6                                                       /*!< I2Cn CONSET: I2EN Position              */
#define I2Cn_CONSET_I2EN_Msk                  (0x01UL << I2Cn_CONSET_I2EN_Pos)                        /*!< I2Cn CONSET: I2EN Mask                  */

/* ----------------------------------  I2Cn_STAT  --------------------------------- */
#define I2Cn_STAT_Status_Pos                  3                                                       /*!< I2Cn STAT: Status Position              */
#define I2Cn_STAT_Status_Msk                  (0x1fUL << I2Cn_STAT_Status_Pos)                        /*!< I2Cn STAT: Status Mask                  */

