roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  I2Cn_DAT  ---------------------------------- */
#define I2Cn_DAT_Data_Pos                     0                                                       /*!< I2Cn DAT: Data Position                 */
#define I2Cn_DAT_Data_Msk                     (0x000000ffUL << I2Cn_DAT_Data_Pos)                     /*!< I2Cn DAT: Data Mask                     */

/* ----------------------------------  I2Cn_ADR0  --------------------------------- */
#define I2Cn_ADR0_GC_Pos                      0                                                       /*!< I2Cn ADR0: GC Position                  */
#define I2Cn_ADR0_GC_Msk                      (0x01UL << I2Cn_ADR0_GC_Pos)                            /*!< I2Cn ADR0: GC Mask                      */
#define I2Cn_ADR0_Address_Pos                 1                                                       /*!< I2Cn ADR0: Address Position             */
#define I2Cn_ADR0_Address_Msk                 (0x7fUL << I2Cn_ADR0_Address_Pos)                       /*!< I2Cn ADR0: Address Mask                 */

/* ----------------------------------  I2Cn_SCLH  --------------------------------- */
#define I2Cn_SCLH_SCLH_Pos                    0                                                       /*!< I2Cn SCLH: SCLH Position                */
#define I2Cn_SCLH_SCLH_Msk                    (0x0000ffffUL << I2Cn_SCLH_SCLH_Pos)                    /*!< I2Cn SCLH: SCLH Mask                    */

/* ----------------------------------  I2Cn_SCLL  --------------------------------- */
#define I2Cn_SCLL_SCLL_Pos                    0                                                       /*!< I2Cn SCLL: SCLL Position                */
#define I2Cn_SCLL_SCLL_Msk                    (0x0000ffffUL << I2Cn_SCLL_SCLL_Pos)                    /*!< I2Cn SCLL: SCLL Mask                    */

/* ---------------------------------  I2Cn_CONCLR  -------------------------------- */
#define I2Cn_CONCLR_AAC_Pos                   2                                                       /*!< I2Cn CONCLR: AAC Position               */
#define I2Cn_CONCLR_AAC_Msk                   (0x01UL << I2Cn_CONCLR_AAC_Pos)                         /*!< I2Cn CONCLR: AAC Mask                   */
#define I2Cn_CONCLR_SIC_Pos                   3                                                       /*!< I2Cn CONCLR: SIC Position               */
#define I2Cn_CONCLR_SIC_Msk                   (0x01UL << I2Cn_CONCLR_SIC_Pos)                         /*!< I2Cn CONCLR: SIC Mask                   */
#define I2Cn_CONCLR_STAC_Pos                  5                                                       /*!< I2Cn CONCLR: STAC Position              */
#define I2Cn_CONCLR_STAC_Msk                  (0x01UL << I2Cn_CONCLR_STAC_Pos)                        /*!< I2Cn CONCLR: STAC Mask                  */
#define I2Cn_CONCLR_I2ENC_Pos                 6                                                       /*!< I2Cn CONCLR: I2ENC Position             */
#define I2Cn_CONCLR_I2ENC_Msk                 (0x01UL << I2Cn_CONCLR_I2ENC_Pos)                       /*!< I2Cn CONCLR: I2ENC Mask                 */

/* ---------------------------------  I2Cn_MMCTRL  -------------------------------- */
#define I2Cn_MMCTRL_MM_ENA_Pos                0                                                       /*!< I2Cn MMCTRL: MM_ENA Position            */
#define I2Cn_MMCTRL_MM_ENA_Msk                (0x01UL << I2Cn_MMCTRL_MM_ENA_Pos)                      /*!< I2Cn MMCTRL: MM_ENA Mask                */
#define I2Cn_MMCTRL_ENA_SCL_Pos               1                                                       /*!< I2Cn MMCTRL: ENA_SCL Position           */
#define I2Cn_MMCTRL_ENA_SCL_Msk               (0x01UL << I2Cn_MMCTRL_ENA_SCL_Pos)                     /*!< I2Cn MMCTRL: ENA_SCL Mask               */
#define I2Cn_MMCTRL_MATCH_ALL_Pos             2                                                       /*!< I2Cn MMCTRL: MATCH_ALL Position         */
#define I2Cn_MMCTRL_MATCH_ALL_Msk             (0x01UL << I2Cn_MMCTRL_MATCH_ALL_Pos)                   /*!< I2Cn MMCTRL: MATCH_ALL Mask             */

/* ----------------------------------  I2Cn_ADR1  --------------------------------- */
#define I2Cn_ADR1_GC_Pos                      0                                                       /*!< I2Cn ADR1: GC Position                  */
#define I2Cn_ADR1_GC_Msk                      (0x01UL << I2Cn_ADR1_GC_Pos)                            /*!< I2Cn ADR1: GC Mask                      */
#define I2Cn_ADR1_Address_Pos                 1                                                       /*!< I2Cn ADR1: Address Position             */
#define I2Cn_ADR1_Address_Msk                 (0x7fUL << I2Cn_ADR1_Address_Pos)                       /*!< I2Cn ADR1: Address Mask                 */

/* ----------------------------------  I2Cn_ADR2  --------------------------------- */
#define I2Cn_ADR2_GC_Pos                      0                                                       /*!< I2Cn ADR2: GC Position                  */
#define I2Cn_ADR2_GC_Msk                      (0x01UL << I2Cn_ADR2_GC_Pos)                            /*!< I2Cn ADR2: GC Mask                      */
#define I2Cn_ADR2_Address_Pos                 1                                                       /*!< I2Cn ADR2: Address Position             */
#define I2Cn_ADR2_Address_Msk                 (0x7fUL << I2Cn_ADR2_Address_Pos)                       /*!< I2Cn ADR2: Address Mask                 */

/* ----------------------------------  I2Cn_ADR3  --------------------------------- */
#define I2Cn_ADR3_GC_Pos                      0                                                       /*!< I2Cn ADR3: GC Position                  */
#define I2Cn_ADR3_GC_Msk                      (0x01UL << I2Cn_ADR3_GC_Pos)                            /*!< I2Cn ADR3: GC Mask                      */
#define I2Cn_ADR3_Address_Pos                 1                                                       /*!< I2Cn ADR3: Address Position             */
#define I2Cn_ADR3_Address_Msk                 (0x7fUL << I2Cn_ADR3_Address_Pos)                       /*!< I2Cn ADR3: Address Mask                 */

