roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  I2C0_ADR2  --------------------------------- */
#define I2C0_ADR2_GC_Pos                      0                                                       /*!< I2C0 ADR2: GC Position                  */
#define I2C0_ADR2_GC_Msk                      (0x01UL << I2C0_ADR2_GC_Pos)                            /*!< I2C0 ADR2: GC Mask                      */
#define I2C0_ADR2_Address_Pos                 1                                                       /*!< I2C0 ADR2: Address Position             */
#define I2C0_ADR2_Address_Msk                 (0x7fUL << I2C0_ADR2_Address_Pos)                       /*!< I2C0 ADR2: Address Mask                 */

/* ----------------------------------  I2C0_ADR3  --------------------------------- */
#define I2C0_ADR3_GC_Pos                      0                                                       /*!< I2C0 ADR3: GC Position                  */
#define I2C0_ADR3_GC_Msk                      (0x01UL << I2C0_ADR3_GC_Pos)                            /*!< I2C0 ADR3: GC Mask                      */
#define I2C0_ADR3_Address_Pos                 1                                                       /*!< I2C0 ADR3: Address Position             */
#define I2C0_ADR3_Address_Msk                 (0x7fUL << I2C0_ADR3_Address_Pos)                       /*!< I2C0 ADR3: Address Mask                 */

/* ------------------------------  I2C0_DATA_BUFFER  ------------------------------ */
#define I2C0_DATA_BUFFER_Data_Pos             0                                                       /*!< I2C0 DATA_BUFFER: Data Position         */
#define I2C0_DATA_BUFFER_Data_Msk             (0x000000ffUL << I2C0_DATA_BUFFER_Data_Pos)             /*!< I2C0 DATA_BUFFER: Data Mask             */

/* ---------------------------------  I2C0_MASK0  --------------------------------- */
#define I2C0_MASK0_MASK_Pos                   1                                                       /*!< I2C0 MASK0: MASK Position               */
#define I2C0_MASK0_MASK_Msk                   (0x7fUL << I2C0_MASK0_MASK_Pos)                         /*!< I2C0 MASK0: MASK Mask                   */

/* ---------------------------------  I2C0_MASK1  --------------------------------- */
#define I2C0_MASK1_MASK_Pos                   1                                                       /*!< I2C0 MASK1: MASK Position               */
#define I2C0_MASK1_MASK_Msk                   (0x7fUL << I2C0_MASK1_MASK_Pos)                         /*!< I2C0 MASK1: MASK Mask                   */

/* ---------------------------------  I2C0_MASK2  --------------------------------- */
#define I2C0_MASK2_MASK_Pos                   1                                                       /*!< I2C0 MASK2: MASK Position               */
#define I2C0_MASK2_MASK_Msk                   (0x7fUL << I2C0_MASK2_MASK_Pos)                         /*!< I2C0 MASK2: MASK Mask                   */

/* ---------------------------------  I2C0_MASK3  --------------------------------- */
#define I2C0_MASK3_MASK_Pos                   1                                                       /*!< I2C0 MASK3: MASK Position               */
#define I2C0_MASK3_MASK_Msk                   (0x7fUL << I2C0_MASK3_MASK_Pos)                         /*!< I2C0 MASK3: MASK Mask                   */


/* ================================================================================ */
/* ================          struct 'I2C1' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  I2C1_CONSET  -------------------------------- */
#define I2C1_CONSET_AA_Pos                    2                                                       /*!< I2C1 CONSET: AA Position                */
#define I2C1_CONSET_AA_Msk                    (0x01UL << I2C1_CONSET_AA_Pos)                          /*!< I2C1 CONSET: AA Mask                    */
#define I2C1_CONSET_SI_Pos                    3                                                       /*!< I2C1 CONSET: SI Position                */
#define I2C1_CONSET_SI_Msk                    (0x01UL << I2C1_CONSET_SI_Pos)                          /*!< I2C1 CONSET: SI Mask                    */
#define I2C1_CONSET_STO_Pos                   4                                                       /*!< I2C1 CONSET: STO Position               */
#define I2C1_CONSET_STO_Msk                   (0x01UL << I2C1_CONSET_STO_Pos)                         /*!< I2C1 CONSET: STO Mask                   */
#define I2C1_CONSET_STA_Pos                   5                                                       /*!< I2C1 CONSET: STA Position               */
#define I2C1_CONSET_STA_Msk                   (0x01UL << I2C1_CONSET_STA_Pos)                         /*!< I2C1 CONSET: STA Mask                   */
#define I2C1_CONSET_I2EN_Pos                  6                                                       /*!< I2C1 CONSET: I2EN Position              */
#define I2C1_CONSET_I2EN_Msk                  (0x01UL << I2C1_CONSET_I2EN_Pos)                        /*!< I2C1 CONSET: I2EN Mask                  */

/* ----------------------------------  I2C1_STAT  --------------------------------- */
#define I2C1_STAT_Status_Pos                  3                                                       /*!< I2C1 STAT: Status Position              */
#define I2C1_STAT_Status_Msk                  (0x1fUL << I2C1_STAT_Status_Pos)                        /*!< I2C1 STAT: Status Mask                  */

/* ----------------------------------  I2C1_DAT  ---------------------------------- */
#define I2C1_DAT_Data_Pos                     0                                                       /*!< I2C1 DAT: Data Position                 */
#define I2C1_DAT_Data_Msk                     (0x000000ffUL << I2C1_DAT_Data_Pos)                     /*!< I2C1 DAT: Data Mask                     */

