roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  I2C1_ADR0  --------------------------------- */
#define I2C1_ADR0_GC_Pos                      0                                                       /*!< I2C1 ADR0: GC Position                  */
#define I2C1_ADR0_GC_Msk                      (0x01UL << I2C1_ADR0_GC_Pos)                            /*!< I2C1 ADR0: GC Mask                      */
#define I2C1_ADR0_Address_Pos                 1                                                       /*!< I2C1 ADR0: Address Position             */
#define I2C1_ADR0_Address_Msk                 (0x7fUL << I2C1_ADR0_Address_Pos)                       /*!< I2C1 ADR0: Address Mask                 */

/* ----------------------------------  I2C1_SCLH  --------------------------------- */
#define I2C1_SCLH_SCLH_Pos                    0                                                       /*!< I2C1 SCLH: SCLH Position                */
#define I2C1_SCLH_SCLH_Msk                    (0x0000ffffUL << I2C1_SCLH_SCLH_Pos)                    /*!< I2C1 SCLH: SCLH Mask                    */

/* ----------------------------------  I2C1_SCLL  --------------------------------- */
#define I2C1_SCLL_SCLL_Pos                    0                                                       /*!< I2C1 SCLL: SCLL Position                */
#define I2C1_SCLL_SCLL_Msk                    (0x0000ffffUL << I2C1_SCLL_SCLL_Pos)                    /*!< I2C1 SCLL: SCLL Mask                    */

/* ---------------------------------  I2C1_CONCLR  -------------------------------- */
#define I2C1_CONCLR_AAC_Pos                   2                                                       /*!< I2C1 CONCLR: AAC Position               */
#define I2C1_CONCLR_AAC_Msk                   (0x01UL << I2C1_CONCLR_AAC_Pos)                         /*!< I2C1 CONCLR: AAC Mask                   */
#define I2C1_CONCLR_SIC_Pos                   3                                                       /*!< I2C1 CONCLR: SIC Position               */
#define I2C1_CONCLR_SIC_Msk                   (0x01UL << I2C1_CONCLR_SIC_Pos)                         /*!< I2C1 CONCLR: SIC Mask                   */
#define I2C1_CONCLR_STAC_Pos                  5                                                       /*!< I2C1 CONCLR: STAC Position              */
#define I2C1_CONCLR_STAC_Msk                  (0x01UL << I2C1_CONCLR_STAC_Pos)                        /*!< I2C1 CONCLR: STAC Mask                  */
#define I2C1_CONCLR_I2ENC_Pos                 6                                                       /*!< I2C1 CONCLR: I2ENC Position             */
#define I2C1_CONCLR_I2ENC_Msk                 (0x01UL << I2C1_CONCLR_I2ENC_Pos)                       /*!< I2C1 CONCLR: I2ENC Mask                 */

/* ---------------------------------  I2C1_MMCTRL  -------------------------------- */
#define I2C1_MMCTRL_MM_ENA_Pos                0                                                       /*!< I2C1 MMCTRL: MM_ENA Position            */
#define I2C1_MMCTRL_MM_ENA_Msk                (0x01UL << I2C1_MMCTRL_MM_ENA_Pos)                      /*!< I2C1 MMCTRL: MM_ENA Mask                */
#define I2C1_MMCTRL_ENA_SCL_Pos               1                                                       /*!< I2C1 MMCTRL: ENA_SCL Position           */
#define I2C1_MMCTRL_ENA_SCL_Msk               (0x01UL << I2C1_MMCTRL_ENA_SCL_Pos)                     /*!< I2C1 MMCTRL: ENA_SCL Mask               */
#define I2C1_MMCTRL_MATCH_ALL_Pos             2                                                       /*!< I2C1 MMCTRL: MATCH_ALL Position         */
#define I2C1_MMCTRL_MATCH_ALL_Msk             (0x01UL << I2C1_MMCTRL_MATCH_ALL_Pos)                   /*!< I2C1 MMCTRL: MATCH_ALL Mask             */

/* ----------------------------------  I2C1_ADR1  --------------------------------- */
#define I2C1_ADR1_GC_Pos                      0                                                       /*!< I2C1 ADR1: GC Position                  */
#define I2C1_ADR1_GC_Msk                      (0x01UL << I2C1_ADR1_GC_Pos)                            /*!< I2C1 ADR1: GC Mask                      */
#define I2C1_ADR1_Address_Pos                 1                                                       /*!< I2C1 ADR1: Address Position             */
#define I2C1_ADR1_Address_Msk                 (0x7fUL << I2C1_ADR1_Address_Pos)                       /*!< I2C1 ADR1: Address Mask                 */

/* ----------------------------------  I2C1_ADR2  --------------------------------- */
#define I2C1_ADR2_GC_Pos                      0                                                       /*!< I2C1 ADR2: GC Position                  */
#define I2C1_ADR2_GC_Msk                      (0x01UL << I2C1_ADR2_GC_Pos)                            /*!< I2C1 ADR2: GC Mask                      */
#define I2C1_ADR2_Address_Pos                 1                                                       /*!< I2C1 ADR2: Address Position             */
#define I2C1_ADR2_Address_Msk                 (0x7fUL << I2C1_ADR2_Address_Pos)                       /*!< I2C1 ADR2: Address Mask                 */

/* ----------------------------------  I2C1_ADR3  --------------------------------- */
#define I2C1_ADR3_GC_Pos                      0                                                       /*!< I2C1 ADR3: GC Position                  */
#define I2C1_ADR3_GC_Msk                      (0x01UL << I2C1_ADR3_GC_Pos)                            /*!< I2C1 ADR3: GC Mask                      */
#define I2C1_ADR3_Address_Pos                 1                                                       /*!< I2C1 ADR3: Address Position             */
#define I2C1_ADR3_Address_Msk                 (0x7fUL << I2C1_ADR3_Address_Pos)                       /*!< I2C1 ADR3: Address Mask                 */

/* ------------------------------  I2C1_DATA_BUFFER  ------------------------------ */
#define I2C1_DATA_BUFFER_Data_Pos             0                                                       /*!< I2C1 DATA_BUFFER: Data Position         */
#define I2C1_DATA_BUFFER_Data_Msk             (0x000000ffUL << I2C1_DATA_BUFFER_Data_Pos)             /*!< I2C1 DATA_BUFFER: Data Mask             */

/* ---------------------------------  I2C1_MASK0  --------------------------------- */
#define I2C1_MASK0_MASK_Pos                   1                                                       /*!< I2C1 MASK0: MASK Position               */
#define I2C1_MASK0_MASK_Msk                   (0x7fUL << I2C1_MASK0_MASK_Pos)                         /*!< I2C1 MASK0: MASK Mask                   */

/* ---------------------------------  I2C1_MASK1  --------------------------------- */
#define I2C1_MASK1_MASK_Pos                   1                                                       /*!< I2C1 MASK1: MASK Position               */
#define I2C1_MASK1_MASK_Msk                   (0x7fUL << I2C1_MASK1_MASK_Pos)                         /*!< I2C1 MASK1: MASK Mask                   */

