roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  I2C1_MASK2  --------------------------------- */
#define I2C1_MASK2_MASK_Pos                   1                                                       /*!< I2C1 MASK2: MASK Position               */
#define I2C1_MASK2_MASK_Msk                   (0x7fUL << I2C1_MASK2_MASK_Pos)                         /*!< I2C1 MASK2: MASK Mask                   */

/* ---------------------------------  I2C1_MASK3  --------------------------------- */
#define I2C1_MASK3_MASK_Pos                   1                                                       /*!< I2C1 MASK3: MASK Position               */
#define I2C1_MASK3_MASK_Msk                   (0x7fUL << I2C1_MASK3_MASK_Pos)                         /*!< I2C1 MASK3: MASK Mask                   */


/* ================================================================================ */
/* ================          Group 'I2Sn' Position & Mask          ================ */
/* ================================================================================ */


/* ----------------------------------  I2Sn_DAO  ---------------------------------- */
#define I2Sn_DAO_WORDWIDTH_Pos                0                                                       /*!< I2Sn DAO: WORDWIDTH Position            */
#define I2Sn_DAO_WORDWIDTH_Msk                (0x03UL << I2Sn_DAO_WORDWIDTH_Pos)                      /*!< I2Sn DAO: WORDWIDTH Mask                */
#define I2Sn_DAO_MONO_Pos                     2                                                       /*!< I2Sn DAO: MONO Position                 */
#define I2Sn_DAO_MONO_Msk                     (0x01UL << I2Sn_DAO_MONO_Pos)                           /*!< I2Sn DAO: MONO Mask                     */
#define I2Sn_DAO_STOP_Pos                     3                                                       /*!< I2Sn DAO: STOP Position                 */
#define I2Sn_DAO_STOP_Msk                     (0x01UL << I2Sn_DAO_STOP_Pos)                           /*!< I2Sn DAO: STOP Mask                     */
#define I2Sn_DAO_RESET_Pos                    4                                                       /*!< I2Sn DAO: RESET Position                */
#define I2Sn_DAO_RESET_Msk                    (0x01UL << I2Sn_DAO_RESET_Pos)                          /*!< I2Sn DAO: RESET Mask                    */
#define I2Sn_DAO_WS_SEL_Pos                   5                                                       /*!< I2Sn DAO: WS_SEL Position               */
#define I2Sn_DAO_WS_SEL_Msk                   (0x01UL << I2Sn_DAO_WS_SEL_Pos)                         /*!< I2Sn DAO: WS_SEL Mask                   */
#define I2Sn_DAO_WS_HALFPERIOD_Pos            6                                                       /*!< I2Sn DAO: WS_HALFPERIOD Position        */
#define I2Sn_DAO_WS_HALFPERIOD_Msk            (0x000001ffUL << I2Sn_DAO_WS_HALFPERIOD_Pos)            /*!< I2Sn DAO: WS_HALFPERIOD Mask            */
#define I2Sn_DAO_MUTE_Pos                     15                                                      /*!< I2Sn DAO: MUTE Position                 */
#define I2Sn_DAO_MUTE_Msk                     (0x01UL << I2Sn_DAO_MUTE_Pos)                           /*!< I2Sn DAO: MUTE Mask                     */

/* ----------------------------------  I2Sn_DAI  ---------------------------------- */
#define I2Sn_DAI_WORDWIDTH_Pos                0                                                       /*!< I2Sn DAI: WORDWIDTH Position            */
#define I2Sn_DAI_WORDWIDTH_Msk                (0x03UL << I2Sn_DAI_WORDWIDTH_Pos)                      /*!< I2Sn DAI: WORDWIDTH Mask                */
#define I2Sn_DAI_MONO_Pos                     2                                                       /*!< I2Sn DAI: MONO Position                 */
#define I2Sn_DAI_MONO_Msk                     (0x01UL << I2Sn_DAI_MONO_Pos)                           /*!< I2Sn DAI: MONO Mask                     */
#define I2Sn_DAI_STOP_Pos                     3                                                       /*!< I2Sn DAI: STOP Position                 */
#define I2Sn_DAI_STOP_Msk                     (0x01UL << I2Sn_DAI_STOP_Pos)                           /*!< I2Sn DAI: STOP Mask                     */
#define I2Sn_DAI_RESET_Pos                    4                                                       /*!< I2Sn DAI: RESET Position                */
#define I2Sn_DAI_RESET_Msk                    (0x01UL << I2Sn_DAI_RESET_Pos)                          /*!< I2Sn DAI: RESET Mask                    */
#define I2Sn_DAI_WS_SEL_Pos                   5                                                       /*!< I2Sn DAI: WS_SEL Position               */
#define I2Sn_DAI_WS_SEL_Msk                   (0x01UL << I2Sn_DAI_WS_SEL_Pos)                         /*!< I2Sn DAI: WS_SEL Mask                   */
#define I2Sn_DAI_WS_HALFPERIOD_Pos            6                                                       /*!< I2Sn DAI: WS_HALFPERIOD Position        */
#define I2Sn_DAI_WS_HALFPERIOD_Msk            (0x000001ffUL << I2Sn_DAI_WS_HALFPERIOD_Pos)            /*!< I2Sn DAI: WS_HALFPERIOD Mask            */

/* ---------------------------------  I2Sn_TXFIFO  -------------------------------- */
#define I2Sn_TXFIFO_I2STXFIFO_Pos             0                                                       /*!< I2Sn TXFIFO: I2STXFIFO Position         */
#define I2Sn_TXFIFO_I2STXFIFO_Msk             (0xffffffffUL << I2Sn_TXFIFO_I2STXFIFO_Pos)             /*!< I2Sn TXFIFO: I2STXFIFO Mask             */

/* ---------------------------------  I2Sn_RXFIFO  -------------------------------- */
#define I2Sn_RXFIFO_I2SRXFIFO_Pos             0                                                       /*!< I2Sn RXFIFO: I2SRXFIFO Position         */
#define I2Sn_RXFIFO_I2SRXFIFO_Msk             (0xffffffffUL << I2Sn_RXFIFO_I2SRXFIFO_Pos)             /*!< I2Sn RXFIFO: I2SRXFIFO Mask             */

/* ---------------------------------  I2Sn_STATE  --------------------------------- */
#define I2Sn_STATE_IRQ_Pos                    0                                                       /*!< I2Sn STATE: IRQ Position                */
#define I2Sn_STATE_IRQ_Msk                    (0x01UL << I2Sn_STATE_IRQ_Pos)                          /*!< I2Sn STATE: IRQ Mask                    */
#define I2Sn_STATE_DMAREQ1_Pos                1                                                       /*!< I2Sn STATE: DMAREQ1 Position            */
#define I2Sn_STATE_DMAREQ1_Msk                (0x01UL << I2Sn_STATE_DMAREQ1_Pos)                      /*!< I2Sn STATE: DMAREQ1 Mask                */
#define I2Sn_STATE_DMAREQ2_Pos                2                                                       /*!< I2Sn STATE: DMAREQ2 Position            */
#define I2Sn_STATE_DMAREQ2_Msk                (0x01UL << I2Sn_STATE_DMAREQ2_Pos)                      /*!< I2Sn STATE: DMAREQ2 Mask                */
#define I2Sn_STATE_RX_LEVEL_Pos               8                                                       /*!< I2Sn STATE: RX_LEVEL Position           */
#define I2Sn_STATE_RX_LEVEL_Msk               (0x0fUL << I2Sn_STATE_RX_LEVEL_Pos)                     /*!< I2Sn STATE: RX_LEVEL Mask               */
#define I2Sn_STATE_TX_LEVEL_Pos               16                                                      /*!< I2Sn STATE: TX_LEVEL Position           */
#define I2Sn_STATE_TX_LEVEL_Msk               (0x0fUL << I2Sn_STATE_TX_LEVEL_Pos)                     /*!< I2Sn STATE: TX_LEVEL Mask               */

/* ----------------------------------  I2Sn_DMA1  --------------------------------- */
#define I2Sn_DMA1_RX_DMA1_ENABLE_Pos          0                                                       /*!< I2Sn DMA1: RX_DMA1_ENABLE Position      */
#define I2Sn_DMA1_RX_DMA1_ENABLE_Msk          (0x01UL << I2Sn_DMA1_RX_DMA1_ENABLE_Pos)                /*!< I2Sn DMA1: RX_DMA1_ENABLE Mask          */
#define I2Sn_DMA1_TX_DMA1_ENABLE_Pos          1                                                       /*!< I2Sn DMA1: TX_DMA1_ENABLE Position      */
#define I2Sn_DMA1_TX_DMA1_ENABLE_Msk          (0x01UL << I2Sn_DMA1_TX_DMA1_ENABLE_Pos)                /*!< I2Sn DMA1: TX_DMA1_ENABLE Mask          */
#define I2Sn_DMA1_RX_DEPTH_DMA1_Pos           8                                                       /*!< I2Sn DMA1: RX_DEPTH_DMA1 Position       */
#define I2Sn_DMA1_RX_DEPTH_DMA1_Msk           (0x0fUL << I2Sn_DMA1_RX_DEPTH_DMA1_Pos)                 /*!< I2Sn DMA1: RX_DEPTH_DMA1 Mask           */
#define I2Sn_DMA1_TX_DEPTH_DMA1_Pos           16                                                      /*!< I2Sn DMA1: TX_DEPTH_DMA1 Position       */
#define I2Sn_DMA1_TX_DEPTH_DMA1_Msk           (0x0fUL << I2Sn_DMA1_TX_DEPTH_DMA1_Pos)                 /*!< I2Sn DMA1: TX_DEPTH_DMA1 Mask           */

