roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  I2S0_TXFIFO  -------------------------------- */
#define I2S0_TXFIFO_I2STXFIFO_Pos             0                                                       /*!< I2S0 TXFIFO: I2STXFIFO Position         */
#define I2S0_TXFIFO_I2STXFIFO_Msk             (0xffffffffUL << I2S0_TXFIFO_I2STXFIFO_Pos)             /*!< I2S0 TXFIFO: I2STXFIFO Mask             */

/* ---------------------------------  I2S0_RXFIFO  -------------------------------- */
#define I2S0_RXFIFO_I2SRXFIFO_Pos             0                                                       /*!< I2S0 RXFIFO: I2SRXFIFO Position         */
#define I2S0_RXFIFO_I2SRXFIFO_Msk             (0xffffffffUL << I2S0_RXFIFO_I2SRXFIFO_Pos)             /*!< I2S0 RXFIFO: I2SRXFIFO Mask             */

/* ---------------------------------  I2S0_STATE  --------------------------------- */
#define I2S0_STATE_IRQ_Pos                    0                                                       /*!< I2S0 STATE: IRQ Position                */
#define I2S0_STATE_IRQ_Msk                    (0x01UL << I2S0_STATE_IRQ_Pos)                          /*!< I2S0 STATE: IRQ Mask                    */
#define I2S0_STATE_DMAREQ1_Pos                1                                                       /*!< I2S0 STATE: DMAREQ1 Position            */
#define I2S0_STATE_DMAREQ1_Msk                (0x01UL << I2S0_STATE_DMAREQ1_Pos)                      /*!< I2S0 STATE: DMAREQ1 Mask                */
#define I2S0_STATE_DMAREQ2_Pos                2                                                       /*!< I2S0 STATE: DMAREQ2 Position            */
#define I2S0_STATE_DMAREQ2_Msk                (0x01UL << I2S0_STATE_DMAREQ2_Pos)                      /*!< I2S0 STATE: DMAREQ2 Mask                */
#define I2S0_STATE_RX_LEVEL_Pos               8                                                       /*!< I2S0 STATE: RX_LEVEL Position           */
#define I2S0_STATE_RX_LEVEL_Msk               (0x0fUL << I2S0_STATE_RX_LEVEL_Pos)                     /*!< I2S0 STATE: RX_LEVEL Mask               */
#define I2S0_STATE_TX_LEVEL_Pos               16                                                      /*!< I2S0 STATE: TX_LEVEL Position           */
#define I2S0_STATE_TX_LEVEL_Msk               (0x0fUL << I2S0_STATE_TX_LEVEL_Pos)                     /*!< I2S0 STATE: TX_LEVEL Mask               */

/* ----------------------------------  I2S0_DMA1  --------------------------------- */
#define I2S0_DMA1_RX_DMA1_ENABLE_Pos          0                                                       /*!< I2S0 DMA1: RX_DMA1_ENABLE Position      */
#define I2S0_DMA1_RX_DMA1_ENABLE_Msk          (0x01UL << I2S0_DMA1_RX_DMA1_ENABLE_Pos)                /*!< I2S0 DMA1: RX_DMA1_ENABLE Mask          */
#define I2S0_DMA1_TX_DMA1_ENABLE_Pos          1                                                       /*!< I2S0 DMA1: TX_DMA1_ENABLE Position      */
#define I2S0_DMA1_TX_DMA1_ENABLE_Msk          (0x01UL << I2S0_DMA1_TX_DMA1_ENABLE_Pos)                /*!< I2S0 DMA1: TX_DMA1_ENABLE Mask          */
#define I2S0_DMA1_RX_DEPTH_DMA1_Pos           8                                                       /*!< I2S0 DMA1: RX_DEPTH_DMA1 Position       */
#define I2S0_DMA1_RX_DEPTH_DMA1_Msk           (0x0fUL << I2S0_DMA1_RX_DEPTH_DMA1_Pos)                 /*!< I2S0 DMA1: RX_DEPTH_DMA1 Mask           */
#define I2S0_DMA1_TX_DEPTH_DMA1_Pos           16                                                      /*!< I2S0 DMA1: TX_DEPTH_DMA1 Position       */
#define I2S0_DMA1_TX_DEPTH_DMA1_Msk           (0x0fUL << I2S0_DMA1_TX_DEPTH_DMA1_Pos)                 /*!< I2S0 DMA1: TX_DEPTH_DMA1 Mask           */

/* ----------------------------------  I2S0_DMA2  --------------------------------- */
#define I2S0_DMA2_RX_DMA2_ENABLE_Pos          0                                                       /*!< I2S0 DMA2: RX_DMA2_ENABLE Position      */
#define I2S0_DMA2_RX_DMA2_ENABLE_Msk          (0x01UL << I2S0_DMA2_RX_DMA2_ENABLE_Pos)                /*!< I2S0 DMA2: RX_DMA2_ENABLE Mask          */
#define I2S0_DMA2_TX_DMA2_ENABLE_Pos          1                                                       /*!< I2S0 DMA2: TX_DMA2_ENABLE Position      */
#define I2S0_DMA2_TX_DMA2_ENABLE_Msk          (0x01UL << I2S0_DMA2_TX_DMA2_ENABLE_Pos)                /*!< I2S0 DMA2: TX_DMA2_ENABLE Mask          */
#define I2S0_DMA2_RX_DEPTH_DMA2_Pos           8                                                       /*!< I2S0 DMA2: RX_DEPTH_DMA2 Position       */
#define I2S0_DMA2_RX_DEPTH_DMA2_Msk           (0x0fUL << I2S0_DMA2_RX_DEPTH_DMA2_Pos)                 /*!< I2S0 DMA2: RX_DEPTH_DMA2 Mask           */
#define I2S0_DMA2_TX_DEPTH_DMA2_Pos           16                                                      /*!< I2S0 DMA2: TX_DEPTH_DMA2 Position       */
#define I2S0_DMA2_TX_DEPTH_DMA2_Msk           (0x0fUL << I2S0_DMA2_TX_DEPTH_DMA2_Pos)                 /*!< I2S0 DMA2: TX_DEPTH_DMA2 Mask           */

/* ----------------------------------  I2S0_IRQ  ---------------------------------- */
#define I2S0_IRQ_RX_IRQ_ENABLE_Pos            0                                                       /*!< I2S0 IRQ: RX_IRQ_ENABLE Position        */
#define I2S0_IRQ_RX_IRQ_ENABLE_Msk            (0x01UL << I2S0_IRQ_RX_IRQ_ENABLE_Pos)                  /*!< I2S0 IRQ: RX_IRQ_ENABLE Mask            */
#define I2S0_IRQ_TX_IRQ_ENABLE_Pos            1                                                       /*!< I2S0 IRQ: TX_IRQ_ENABLE Position        */
#define I2S0_IRQ_TX_IRQ_ENABLE_Msk            (0x01UL << I2S0_IRQ_TX_IRQ_ENABLE_Pos)                  /*!< I2S0 IRQ: TX_IRQ_ENABLE Mask            */
#define I2S0_IRQ_RX_DEPTH_IRQ_Pos             8                                                       /*!< I2S0 IRQ: RX_DEPTH_IRQ Position         */
#define I2S0_IRQ_RX_DEPTH_IRQ_Msk             (0x0fUL << I2S0_IRQ_RX_DEPTH_IRQ_Pos)                   /*!< I2S0 IRQ: RX_DEPTH_IRQ Mask             */
#define I2S0_IRQ_TX_DEPTH_IRQ_Pos             16                                                      /*!< I2S0 IRQ: TX_DEPTH_IRQ Position         */
#define I2S0_IRQ_TX_DEPTH_IRQ_Msk             (0x0fUL << I2S0_IRQ_TX_DEPTH_IRQ_Pos)                   /*!< I2S0 IRQ: TX_DEPTH_IRQ Mask             */

/* ---------------------------------  I2S0_TXRATE  -------------------------------- */
#define I2S0_TXRATE_Y_DIVIDER_Pos             0                                                       /*!< I2S0 TXRATE: Y_DIVIDER Position         */
#define I2S0_TXRATE_Y_DIVIDER_Msk             (0x000000ffUL << I2S0_TXRATE_Y_DIVIDER_Pos)             /*!< I2S0 TXRATE: Y_DIVIDER Mask             */
#define I2S0_TXRATE_X_DIVIDER_Pos             8                                                       /*!< I2S0 TXRATE: X_DIVIDER Position         */
#define I2S0_TXRATE_X_DIVIDER_Msk             (0x000000ffUL << I2S0_TXRATE_X_DIVIDER_Pos)             /*!< I2S0 TXRATE: X_DIVIDER Mask             */

/* ---------------------------------  I2S0_RXRATE  -------------------------------- */
#define I2S0_RXRATE_Y_DIVIDER_Pos             0                                                       /*!< I2S0 RXRATE: Y_DIVIDER Position         */
#define I2S0_RXRATE_Y_DIVIDER_Msk             (0x000000ffUL << I2S0_RXRATE_Y_DIVIDER_Pos)             /*!< I2S0 RXRATE: Y_DIVIDER Mask             */
#define I2S0_RXRATE_X_DIVIDER_Pos             8                                                       /*!< I2S0 RXRATE: X_DIVIDER Position         */
#define I2S0_RXRATE_X_DIVIDER_Msk             (0x000000ffUL << I2S0_RXRATE_X_DIVIDER_Pos)             /*!< I2S0 RXRATE: X_DIVIDER Mask             */

/* -------------------------------  I2S0_TXBITRATE  ------------------------------- */
#define I2S0_TXBITRATE_TX_BITRATE_Pos         0                                                       /*!< I2S0 TXBITRATE: TX_BITRATE Position     */
#define I2S0_TXBITRATE_TX_BITRATE_Msk         (0x3fUL << I2S0_TXBITRATE_TX_BITRATE_Pos)               /*!< I2S0 TXBITRATE: TX_BITRATE Mask         */

/* -------------------------------  I2S0_RXBITRATE  ------------------------------- */
#define I2S0_RXBITRATE_RX_BITRATE_Pos         0                                                       /*!< I2S0 RXBITRATE: RX_BITRATE Position     */
#define I2S0_RXBITRATE_RX_BITRATE_Msk         (0x3fUL << I2S0_RXBITRATE_RX_BITRATE_Pos)               /*!< I2S0 RXBITRATE: RX_BITRATE Mask         */

/* ---------------------------------  I2S0_TXMODE  -------------------------------- */
#define I2S0_TXMODE_TXCLKSEL_Pos              0                                                       /*!< I2S0 TXMODE: TXCLKSEL Position          */
#define I2S0_TXMODE_TXCLKSEL_Msk              (0x03UL << I2S0_TXMODE_TXCLKSEL_Pos)                    /*!< I2S0 TXMODE: TXCLKSEL Mask              */
#define I2S0_TXMODE_TX4PIN_Pos                2                                                       /*!< I2S0 TXMODE: TX4PIN Position            */
#define I2S0_TXMODE_TX4PIN_Msk                (0x01UL << I2S0_TXMODE_TX4PIN_Pos)                      /*!< I2S0 TXMODE: TX4PIN Mask                */
#define I2S0_TXMODE_TXMCENA_Pos               3                                                       /*!< I2S0 TXMODE: TXMCENA Position           */
#define I2S0_TXMODE_TXMCENA_Msk               (0x01UL << I2S0_TXMODE_TXMCENA_Pos)                     /*!< I2S0 TXMODE: TXMCENA Mask               */

