roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  I2S1_STATE  --------------------------------- */
#define I2S1_STATE_IRQ_Pos                    0                                                       /*!< I2S1 STATE: IRQ Position                */
#define I2S1_STATE_IRQ_Msk                    (0x01UL << I2S1_STATE_IRQ_Pos)                          /*!< I2S1 STATE: IRQ Mask                    */
#define I2S1_STATE_DMAREQ1_Pos                1                                                       /*!< I2S1 STATE: DMAREQ1 Position            */
#define I2S1_STATE_DMAREQ1_Msk                (0x01UL << I2S1_STATE_DMAREQ1_Pos)                      /*!< I2S1 STATE: DMAREQ1 Mask                */
#define I2S1_STATE_DMAREQ2_Pos                2                                                       /*!< I2S1 STATE: DMAREQ2 Position            */
#define I2S1_STATE_DMAREQ2_Msk                (0x01UL << I2S1_STATE_DMAREQ2_Pos)                      /*!< I2S1 STATE: DMAREQ2 Mask                */
#define I2S1_STATE_RX_LEVEL_Pos               8                                                       /*!< I2S1 STATE: RX_LEVEL Position           */
#define I2S1_STATE_RX_LEVEL_Msk               (0x0fUL << I2S1_STATE_RX_LEVEL_Pos)                     /*!< I2S1 STATE: RX_LEVEL Mask               */
#define I2S1_STATE_TX_LEVEL_Pos               16                                                      /*!< I2S1 STATE: TX_LEVEL Position           */
#define I2S1_STATE_TX_LEVEL_Msk               (0x0fUL << I2S1_STATE_TX_LEVEL_Pos)                     /*!< I2S1 STATE: TX_LEVEL Mask               */

/* ----------------------------------  I2S1_DMA1  --------------------------------- */
#define I2S1_DMA1_RX_DMA1_ENABLE_Pos          0                                                       /*!< I2S1 DMA1: RX_DMA1_ENABLE Position      */
#define I2S1_DMA1_RX_DMA1_ENABLE_Msk          (0x01UL << I2S1_DMA1_RX_DMA1_ENABLE_Pos)                /*!< I2S1 DMA1: RX_DMA1_ENABLE Mask          */
#define I2S1_DMA1_TX_DMA1_ENABLE_Pos          1                                                       /*!< I2S1 DMA1: TX_DMA1_ENABLE Position      */
#define I2S1_DMA1_TX_DMA1_ENABLE_Msk          (0x01UL << I2S1_DMA1_TX_DMA1_ENABLE_Pos)                /*!< I2S1 DMA1: TX_DMA1_ENABLE Mask          */
#define I2S1_DMA1_RX_DEPTH_DMA1_Pos           8                                                       /*!< I2S1 DMA1: RX_DEPTH_DMA1 Position       */
#define I2S1_DMA1_RX_DEPTH_DMA1_Msk           (0x0fUL << I2S1_DMA1_RX_DEPTH_DMA1_Pos)                 /*!< I2S1 DMA1: RX_DEPTH_DMA1 Mask           */
#define I2S1_DMA1_TX_DEPTH_DMA1_Pos           16                                                      /*!< I2S1 DMA1: TX_DEPTH_DMA1 Position       */
#define I2S1_DMA1_TX_DEPTH_DMA1_Msk           (0x0fUL << I2S1_DMA1_TX_DEPTH_DMA1_Pos)                 /*!< I2S1 DMA1: TX_DEPTH_DMA1 Mask           */

/* ----------------------------------  I2S1_DMA2  --------------------------------- */
#define I2S1_DMA2_RX_DMA2_ENABLE_Pos          0                                                       /*!< I2S1 DMA2: RX_DMA2_ENABLE Position      */
#define I2S1_DMA2_RX_DMA2_ENABLE_Msk          (0x01UL << I2S1_DMA2_RX_DMA2_ENABLE_Pos)                /*!< I2S1 DMA2: RX_DMA2_ENABLE Mask          */
#define I2S1_DMA2_TX_DMA2_ENABLE_Pos          1                                                       /*!< I2S1 DMA2: TX_DMA2_ENABLE Position      */
#define I2S1_DMA2_TX_DMA2_ENABLE_Msk          (0x01UL << I2S1_DMA2_TX_DMA2_ENABLE_Pos)                /*!< I2S1 DMA2: TX_DMA2_ENABLE Mask          */
#define I2S1_DMA2_RX_DEPTH_DMA2_Pos           8                                                       /*!< I2S1 DMA2: RX_DEPTH_DMA2 Position       */
#define I2S1_DMA2_RX_DEPTH_DMA2_Msk           (0x0fUL << I2S1_DMA2_RX_DEPTH_DMA2_Pos)                 /*!< I2S1 DMA2: RX_DEPTH_DMA2 Mask           */
#define I2S1_DMA2_TX_DEPTH_DMA2_Pos           16                                                      /*!< I2S1 DMA2: TX_DEPTH_DMA2 Position       */
#define I2S1_DMA2_TX_DEPTH_DMA2_Msk           (0x0fUL << I2S1_DMA2_TX_DEPTH_DMA2_Pos)                 /*!< I2S1 DMA2: TX_DEPTH_DMA2 Mask           */

/* ----------------------------------  I2S1_IRQ  ---------------------------------- */
#define I2S1_IRQ_RX_IRQ_ENABLE_Pos            0                                                       /*!< I2S1 IRQ: RX_IRQ_ENABLE Position        */
#define I2S1_IRQ_RX_IRQ_ENABLE_Msk            (0x01UL << I2S1_IRQ_RX_IRQ_ENABLE_Pos)                  /*!< I2S1 IRQ: RX_IRQ_ENABLE Mask            */
#define I2S1_IRQ_TX_IRQ_ENABLE_Pos            1                                                       /*!< I2S1 IRQ: TX_IRQ_ENABLE Position        */
#define I2S1_IRQ_TX_IRQ_ENABLE_Msk            (0x01UL << I2S1_IRQ_TX_IRQ_ENABLE_Pos)                  /*!< I2S1 IRQ: TX_IRQ_ENABLE Mask            */
#define I2S1_IRQ_RX_DEPTH_IRQ_Pos             8                                                       /*!< I2S1 IRQ: RX_DEPTH_IRQ Position         */
#define I2S1_IRQ_RX_DEPTH_IRQ_Msk             (0x0fUL << I2S1_IRQ_RX_DEPTH_IRQ_Pos)                   /*!< I2S1 IRQ: RX_DEPTH_IRQ Mask             */
#define I2S1_IRQ_TX_DEPTH_IRQ_Pos             16                                                      /*!< I2S1 IRQ: TX_DEPTH_IRQ Position         */
#define I2S1_IRQ_TX_DEPTH_IRQ_Msk             (0x0fUL << I2S1_IRQ_TX_DEPTH_IRQ_Pos)                   /*!< I2S1 IRQ: TX_DEPTH_IRQ Mask             */

/* ---------------------------------  I2S1_TXRATE  -------------------------------- */
#define I2S1_TXRATE_Y_DIVIDER_Pos             0                                                       /*!< I2S1 TXRATE: Y_DIVIDER Position         */
#define I2S1_TXRATE_Y_DIVIDER_Msk             (0x000000ffUL << I2S1_TXRATE_Y_DIVIDER_Pos)             /*!< I2S1 TXRATE: Y_DIVIDER Mask             */
#define I2S1_TXRATE_X_DIVIDER_Pos             8                                                       /*!< I2S1 TXRATE: X_DIVIDER Position         */
#define I2S1_TXRATE_X_DIVIDER_Msk             (0x000000ffUL << I2S1_TXRATE_X_DIVIDER_Pos)             /*!< I2S1 TXRATE: X_DIVIDER Mask             */

/* ---------------------------------  I2S1_RXRATE  -------------------------------- */
#define I2S1_RXRATE_Y_DIVIDER_Pos             0                                                       /*!< I2S1 RXRATE: Y_DIVIDER Position         */
#define I2S1_RXRATE_Y_DIVIDER_Msk             (0x000000ffUL << I2S1_RXRATE_Y_DIVIDER_Pos)             /*!< I2S1 RXRATE: Y_DIVIDER Mask             */
#define I2S1_RXRATE_X_DIVIDER_Pos             8                                                       /*!< I2S1 RXRATE: X_DIVIDER Position         */
#define I2S1_RXRATE_X_DIVIDER_Msk             (0x000000ffUL << I2S1_RXRATE_X_DIVIDER_Pos)             /*!< I2S1 RXRATE: X_DIVIDER Mask             */

/* -------------------------------  I2S1_TXBITRATE  ------------------------------- */
#define I2S1_TXBITRATE_TX_BITRATE_Pos         0                                                       /*!< I2S1 TXBITRATE: TX_BITRATE Position     */
#define I2S1_TXBITRATE_TX_BITRATE_Msk         (0x3fUL << I2S1_TXBITRATE_TX_BITRATE_Pos)               /*!< I2S1 TXBITRATE: TX_BITRATE Mask         */

