roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  I2S1_RXBITRATE  ------------------------------- */
#define I2S1_RXBITRATE_RX_BITRATE_Pos         0                                                       /*!< I2S1 RXBITRATE: RX_BITRATE Position     */
#define I2S1_RXBITRATE_RX_BITRATE_Msk         (0x3fUL << I2S1_RXBITRATE_RX_BITRATE_Pos)               /*!< I2S1 RXBITRATE: RX_BITRATE Mask         */

/* ---------------------------------  I2S1_TXMODE  -------------------------------- */
#define I2S1_TXMODE_TXCLKSEL_Pos              0                                                       /*!< I2S1 TXMODE: TXCLKSEL Position          */
#define I2S1_TXMODE_TXCLKSEL_Msk              (0x03UL << I2S1_TXMODE_TXCLKSEL_Pos)                    /*!< I2S1 TXMODE: TXCLKSEL Mask              */
#define I2S1_TXMODE_TX4PIN_Pos                2                                                       /*!< I2S1 TXMODE: TX4PIN Position            */
#define I2S1_TXMODE_TX4PIN_Msk                (0x01UL << I2S1_TXMODE_TX4PIN_Pos)                      /*!< I2S1 TXMODE: TX4PIN Mask                */
#define I2S1_TXMODE_TXMCENA_Pos               3                                                       /*!< I2S1 TXMODE: TXMCENA Position           */
#define I2S1_TXMODE_TXMCENA_Msk               (0x01UL << I2S1_TXMODE_TXMCENA_Pos)                     /*!< I2S1 TXMODE: TXMCENA Mask               */

/* ---------------------------------  I2S1_RXMODE  -------------------------------- */
#define I2S1_RXMODE_RXCLKSEL_Pos              0                                                       /*!< I2S1 RXMODE: RXCLKSEL Position          */
#define I2S1_RXMODE_RXCLKSEL_Msk              (0x03UL << I2S1_RXMODE_RXCLKSEL_Pos)                    /*!< I2S1 RXMODE: RXCLKSEL Mask              */
#define I2S1_RXMODE_RX4PIN_Pos                2                                                       /*!< I2S1 RXMODE: RX4PIN Position            */
#define I2S1_RXMODE_RX4PIN_Msk                (0x01UL << I2S1_RXMODE_RX4PIN_Pos)                      /*!< I2S1 RXMODE: RX4PIN Mask                */
#define I2S1_RXMODE_RXMCENA_Pos               3                                                       /*!< I2S1 RXMODE: RXMCENA Position           */
#define I2S1_RXMODE_RXMCENA_Msk               (0x01UL << I2S1_RXMODE_RXMCENA_Pos)                     /*!< I2S1 RXMODE: RXMCENA Mask               */


/* ================================================================================ */
/* ================         Group 'C_CANn' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  C_CANn_CNTL  -------------------------------- */
#define C_CANn_CNTL_INIT_Pos                  0                                                       /*!< C_CANn CNTL: INIT Position              */
#define C_CANn_CNTL_INIT_Msk                  (0x01UL << C_CANn_CNTL_INIT_Pos)                        /*!< C_CANn CNTL: INIT Mask                  */
#define C_CANn_CNTL_IE_Pos                    1                                                       /*!< C_CANn CNTL: IE Position                */
#define C_CANn_CNTL_IE_Msk                    (0x01UL << C_CANn_CNTL_IE_Pos)                          /*!< C_CANn CNTL: IE Mask                    */
#define C_CANn_CNTL_SIE_Pos                   2                                                       /*!< C_CANn CNTL: SIE Position               */
#define C_CANn_CNTL_SIE_Msk                   (0x01UL << C_CANn_CNTL_SIE_Pos)                         /*!< C_CANn CNTL: SIE Mask                   */
#define C_CANn_CNTL_EIE_Pos                   3                                                       /*!< C_CANn CNTL: EIE Position               */
#define C_CANn_CNTL_EIE_Msk                   (0x01UL << C_CANn_CNTL_EIE_Pos)                         /*!< C_CANn CNTL: EIE Mask                   */
#define C_CANn_CNTL_DAR_Pos                   5                                                       /*!< C_CANn CNTL: DAR Position               */
#define C_CANn_CNTL_DAR_Msk                   (0x01UL << C_CANn_CNTL_DAR_Pos)                         /*!< C_CANn CNTL: DAR Mask                   */
#define C_CANn_CNTL_CCE_Pos                   6                                                       /*!< C_CANn CNTL: CCE Position               */
#define C_CANn_CNTL_CCE_Msk                   (0x01UL << C_CANn_CNTL_CCE_Pos)                         /*!< C_CANn CNTL: CCE Mask                   */
#define C_CANn_CNTL_TEST_Pos                  7                                                       /*!< C_CANn CNTL: TEST Position              */
#define C_CANn_CNTL_TEST_Msk                  (0x01UL << C_CANn_CNTL_TEST_Pos)                        /*!< C_CANn CNTL: TEST Mask                  */

/* ---------------------------------  C_CANn_STAT  -------------------------------- */
#define C_CANn_STAT_LEC_Pos                   0                                                       /*!< C_CANn STAT: LEC Position               */
#define C_CANn_STAT_LEC_Msk                   (0x07UL << C_CANn_STAT_LEC_Pos)                         /*!< C_CANn STAT: LEC Mask                   */
#define C_CANn_STAT_TXOK_Pos                  3                                                       /*!< C_CANn STAT: TXOK Position              */
#define C_CANn_STAT_TXOK_Msk                  (0x01UL << C_CANn_STAT_TXOK_Pos)                        /*!< C_CANn STAT: TXOK Mask                  */
#define C_CANn_STAT_RXOK_Pos                  4                                                       /*!< C_CANn STAT: RXOK Position              */
#define C_CANn_STAT_RXOK_Msk                  (0x01UL << C_CANn_STAT_RXOK_Pos)                        /*!< C_CANn STAT: RXOK Mask                  */
#define C_CANn_STAT_EPASS_Pos                 5                                                       /*!< C_CANn STAT: EPASS Position             */
#define C_CANn_STAT_EPASS_Msk                 (0x01UL << C_CANn_STAT_EPASS_Pos)                       /*!< C_CANn STAT: EPASS Mask                 */
#define C_CANn_STAT_EWARN_Pos                 6                                                       /*!< C_CANn STAT: EWARN Position             */
#define C_CANn_STAT_EWARN_Msk                 (0x01UL << C_CANn_STAT_EWARN_Pos)                       /*!< C_CANn STAT: EWARN Mask                 */
#define C_CANn_STAT_BOFF_Pos                  7                                                       /*!< C_CANn STAT: BOFF Position              */
#define C_CANn_STAT_BOFF_Msk                  (0x01UL << C_CANn_STAT_BOFF_Pos)                        /*!< C_CANn STAT: BOFF Mask                  */

