roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  C_CANn_IR2  --------------------------------- */
#define C_CANn_IR2_INTPND32_17_Pos            0                                                       /*!< C_CANn IR2: INTPND32_17 Position        */
#define C_CANn_IR2_INTPND32_17_Msk            (0x0000ffffUL << C_CANn_IR2_INTPND32_17_Pos)            /*!< C_CANn IR2: INTPND32_17 Mask            */

/* --------------------------------  C_CANn_MSGV1  -------------------------------- */
#define C_CANn_MSGV1_MSGVAL16_1_Pos           0                                                       /*!< C_CANn MSGV1: MSGVAL16_1 Position       */
#define C_CANn_MSGV1_MSGVAL16_1_Msk           (0x0000ffffUL << C_CANn_MSGV1_MSGVAL16_1_Pos)           /*!< C_CANn MSGV1: MSGVAL16_1 Mask           */

/* --------------------------------  C_CANn_MSGV2  -------------------------------- */
#define C_CANn_MSGV2_MSGVAL32_17_Pos          0                                                       /*!< C_CANn MSGV2: MSGVAL32_17 Position      */
#define C_CANn_MSGV2_MSGVAL32_17_Msk          (0x0000ffffUL << C_CANn_MSGV2_MSGVAL32_17_Pos)          /*!< C_CANn MSGV2: MSGVAL32_17 Mask          */

/* --------------------------------  C_CANn_CLKDIV  ------------------------------- */
#define C_CANn_CLKDIV_CLKDIVVAL_Pos           0                                                       /*!< C_CANn CLKDIV: CLKDIVVAL Position       */
#define C_CANn_CLKDIV_CLKDIVVAL_Msk           (0x0fUL << C_CANn_CLKDIV_CLKDIVVAL_Pos)                 /*!< C_CANn CLKDIV: CLKDIVVAL Mask           */


/* ================================================================================ */
/* ================         struct 'C_CAN1' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  C_CAN1_CNTL  -------------------------------- */
#define C_CAN1_CNTL_INIT_Pos                  0                                                       /*!< C_CAN1 CNTL: INIT Position              */
#define C_CAN1_CNTL_INIT_Msk                  (0x01UL << C_CAN1_CNTL_INIT_Pos)                        /*!< C_CAN1 CNTL: INIT Mask                  */
#define C_CAN1_CNTL_IE_Pos                    1                                                       /*!< C_CAN1 CNTL: IE Position                */
#define C_CAN1_CNTL_IE_Msk                    (0x01UL << C_CAN1_CNTL_IE_Pos)                          /*!< C_CAN1 CNTL: IE Mask                    */
#define C_CAN1_CNTL_SIE_Pos                   2                                                       /*!< C_CAN1 CNTL: SIE Position               */
#define C_CAN1_CNTL_SIE_Msk                   (0x01UL << C_CAN1_CNTL_SIE_Pos)                         /*!< C_CAN1 CNTL: SIE Mask                   */
#define C_CAN1_CNTL_EIE_Pos                   3                                                       /*!< C_CAN1 CNTL: EIE Position               */
#define C_CAN1_CNTL_EIE_Msk                   (0x01UL << C_CAN1_CNTL_EIE_Pos)                         /*!< C_CAN1 CNTL: EIE Mask                   */
#define C_CAN1_CNTL_DAR_Pos                   5                                                       /*!< C_CAN1 CNTL: DAR Position               */
#define C_CAN1_CNTL_DAR_Msk                   (0x01UL << C_CAN1_CNTL_DAR_Pos)                         /*!< C_CAN1 CNTL: DAR Mask                   */
#define C_CAN1_CNTL_CCE_Pos                   6                                                       /*!< C_CAN1 CNTL: CCE Position               */
#define C_CAN1_CNTL_CCE_Msk                   (0x01UL << C_CAN1_CNTL_CCE_Pos)                         /*!< C_CAN1 CNTL: CCE Mask                   */
#define C_CAN1_CNTL_TEST_Pos                  7                                                       /*!< C_CAN1 CNTL: TEST Position              */
#define C_CAN1_CNTL_TEST_Msk                  (0x01UL << C_CAN1_CNTL_TEST_Pos)                        /*!< C_CAN1 CNTL: TEST Mask                  */

/* ---------------------------------  C_CAN1_STAT  -------------------------------- */
#define C_CAN1_STAT_LEC_Pos                   0                                                       /*!< C_CAN1 STAT: LEC Position               */
#define C_CAN1_STAT_LEC_Msk                   (0x07UL << C_CAN1_STAT_LEC_Pos)                         /*!< C_CAN1 STAT: LEC Mask                   */
#define C_CAN1_STAT_TXOK_Pos                  3                                                       /*!< C_CAN1 STAT: TXOK Position              */
#define C_CAN1_STAT_TXOK_Msk                  (0x01UL << C_CAN1_STAT_TXOK_Pos)                        /*!< C_CAN1 STAT: TXOK Mask                  */
#define C_CAN1_STAT_RXOK_Pos                  4                                                       /*!< C_CAN1 STAT: RXOK Position              */
#define C_CAN1_STAT_RXOK_Msk                  (0x01UL << C_CAN1_STAT_RXOK_Pos)                        /*!< C_CAN1 STAT: RXOK Mask                  */
#define C_CAN1_STAT_EPASS_Pos                 5                                                       /*!< C_CAN1 STAT: EPASS Position             */
#define C_CAN1_STAT_EPASS_Msk                 (0x01UL << C_CAN1_STAT_EPASS_Pos)                       /*!< C_CAN1 STAT: EPASS Mask                 */
#define C_CAN1_STAT_EWARN_Pos                 6                                                       /*!< C_CAN1 STAT: EWARN Position             */
#define C_CAN1_STAT_EWARN_Msk                 (0x01UL << C_CAN1_STAT_EWARN_Pos)                       /*!< C_CAN1 STAT: EWARN Mask                 */
#define C_CAN1_STAT_BOFF_Pos                  7                                                       /*!< C_CAN1 STAT: BOFF Position              */
#define C_CAN1_STAT_BOFF_Msk                  (0x01UL << C_CAN1_STAT_BOFF_Pos)                        /*!< C_CAN1 STAT: BOFF Mask                  */

/* ----------------------------------  C_CAN1_EC  --------------------------------- */
#define C_CAN1_EC_TEC_7_0_Pos                 0                                                       /*!< C_CAN1 EC: TEC_7_0 Position             */
#define C_CAN1_EC_TEC_7_0_Msk                 (0x000000ffUL << C_CAN1_EC_TEC_7_0_Pos)                 /*!< C_CAN1 EC: TEC_7_0 Mask                 */
#define C_CAN1_EC_REC_6_0_Pos                 8                                                       /*!< C_CAN1 EC: REC_6_0 Position             */
#define C_CAN1_EC_REC_6_0_Msk                 (0x7fUL << C_CAN1_EC_REC_6_0_Pos)                       /*!< C_CAN1 EC: REC_6_0 Mask                 */
#define C_CAN1_EC_RP_Pos                      15                                                      /*!< C_CAN1 EC: RP Position                  */
#define C_CAN1_EC_RP_Msk                      (0x01UL << C_CAN1_EC_RP_Pos)                            /*!< C_CAN1 EC: RP Mask                      */

/* ----------------------------------  C_CAN1_BT  --------------------------------- */
#define C_CAN1_BT_BRP_Pos                     0                                                       /*!< C_CAN1 BT: BRP Position                 */
#define C_CAN1_BT_BRP_Msk                     (0x3fUL << C_CAN1_BT_BRP_Pos)                           /*!< C_CAN1 BT: BRP Mask                     */
#define C_CAN1_BT_SJW_Pos                     6                                                       /*!< C_CAN1 BT: SJW Position                 */
#define C_CAN1_BT_SJW_Msk                     (0x03UL << C_CAN1_BT_SJW_Pos)                           /*!< C_CAN1 BT: SJW Mask                     */
#define C_CAN1_BT_TSEG1_Pos                   8                                                       /*!< C_CAN1 BT: TSEG1 Position               */
#define C_CAN1_BT_TSEG1_Msk                   (0x0fUL << C_CAN1_BT_TSEG1_Pos)                         /*!< C_CAN1 BT: TSEG1 Mask                   */
#define C_CAN1_BT_TSEG2_Pos                   12                                                      /*!< C_CAN1 BT: TSEG2 Position               */
#define C_CAN1_BT_TSEG2_Msk                   (0x07UL << C_CAN1_BT_TSEG2_Pos)                         /*!< C_CAN1 BT: TSEG2 Mask                   */

/* ---------------------------------  C_CAN1_INT  --------------------------------- */
#define C_CAN1_INT_INTID15_0_Pos              0                                                       /*!< C_CAN1 INT: INTID15_0 Position          */
#define C_CAN1_INT_INTID15_0_Msk              (0x0000ffffUL << C_CAN1_INT_INTID15_0_Pos)              /*!< C_CAN1 INT: INTID15_0 Mask              */

/* ---------------------------------  C_CAN1_TEST  -------------------------------- */
#define C_CAN1_TEST_BASIC_Pos                 2                                                       /*!< C_CAN1 TEST: BASIC Position             */
#define C_CAN1_TEST_BASIC_Msk                 (0x01UL << C_CAN1_TEST_BASIC_Pos)                       /*!< C_CAN1 TEST: BASIC Mask                 */
#define C_CAN1_TEST_SILENT_Pos                3                                                       /*!< C_CAN1 TEST: SILENT Position            */
#define C_CAN1_TEST_SILENT_Msk                (0x01UL << C_CAN1_TEST_SILENT_Pos)                      /*!< C_CAN1 TEST: SILENT Mask                */
#define C_CAN1_TEST_LBACK_Pos                 4                                                       /*!< C_CAN1 TEST: LBACK Position             */
#define C_CAN1_TEST_LBACK_Msk                 (0x01UL << C_CAN1_TEST_LBACK_Pos)                       /*!< C_CAN1 TEST: LBACK Mask                 */
#define C_CAN1_TEST_TX1_0_Pos                 5                                                       /*!< C_CAN1 TEST: TX1_0 Position             */
#define C_CAN1_TEST_TX1_0_Msk                 (0x03UL << C_CAN1_TEST_TX1_0_Pos)                       /*!< C_CAN1 TEST: TX1_0 Mask                 */
#define C_CAN1_TEST_RX_Pos                    7                                                       /*!< C_CAN1 TEST: RX Position                */
#define C_CAN1_TEST_RX_Msk                    (0x01UL << C_CAN1_TEST_RX_Pos)                          /*!< C_CAN1 TEST: RX Mask                    */

/* ---------------------------------  C_CAN1_BRPE  -------------------------------- */
#define C_CAN1_BRPE_BRPE_Pos                  0                                                       /*!< C_CAN1 BRPE: BRPE Position              */
#define C_CAN1_BRPE_BRPE_Msk                  (0x0fUL << C_CAN1_BRPE_BRPE_Pos)                        /*!< C_CAN1 BRPE: BRPE Mask                  */

/* ------------------------------  C_CAN1_IF1_CMDREQ  ----------------------------- */
#define C_CAN1_IF1_CMDREQ_MESSNUM_Pos         0                                                       /*!< C_CAN1 IF1_CMDREQ: MESSNUM Position     */
#define C_CAN1_IF1_CMDREQ_MESSNUM_Msk         (0x3fUL << C_CAN1_IF1_CMDREQ_MESSNUM_Pos)               /*!< C_CAN1 IF1_CMDREQ: MESSNUM Mask         */
#define C_CAN1_IF1_CMDREQ_BUSY_Pos            15                                                      /*!< C_CAN1 IF1_CMDREQ: BUSY Position        */
#define C_CAN1_IF1_CMDREQ_BUSY_Msk            (0x01UL << C_CAN1_IF1_CMDREQ_BUSY_Pos)                  /*!< C_CAN1 IF1_CMDREQ: BUSY Mask            */

/* -----------------------------  C_CAN1_IF1_CMDMSK_W  ---------------------------- */
#define C_CAN1_IF1_CMDMSK_W_DATA_B_Pos        0                                                       /*!< C_CAN1 IF1_CMDMSK_W: DATA_B Position    */
#define C_CAN1_IF1_CMDMSK_W_DATA_B_Msk        (0x01UL << C_CAN1_IF1_CMDMSK_W_DATA_B_Pos)              /*!< C_CAN1 IF1_CMDMSK_W: DATA_B Mask        */
#define C_CAN1_IF1_CMDMSK_W_DATA_A_Pos        1                                                       /*!< C_CAN1 IF1_CMDMSK_W: DATA_A Position    */
#define C_CAN1_IF1_CMDMSK_W_DATA_A_Msk        (0x01UL << C_CAN1_IF1_CMDMSK_W_DATA_A_Pos)              /*!< C_CAN1 IF1_CMDMSK_W: DATA_A Mask        */
#define C_CAN1_IF1_CMDMSK_W_TXRQST_Pos        2                                                       /*!< C_CAN1 IF1_CMDMSK_W: TXRQST Position    */
#define C_CAN1_IF1_CMDMSK_W_TXRQST_Msk        (0x01UL << C_CAN1_IF1_CMDMSK_W_TXRQST_Pos)              /*!< C_CAN1 IF1_CMDMSK_W: TXRQST Mask        */
#define C_CAN1_IF1_CMDMSK_W_CLRINTPND_Pos     3                                                       /*!< C_CAN1 IF1_CMDMSK_W: CLRINTPND Position */
#define C_CAN1_IF1_CMDMSK_W_CLRINTPND_Msk     (0x01UL << C_CAN1_IF1_CMDMSK_W_CLRINTPND_Pos)           /*!< C_CAN1 IF1_CMDMSK_W: CLRINTPND Mask     */
#define C_CAN1_IF1_CMDMSK_W_CTRL_Pos          4                                                       /*!< C_CAN1 IF1_CMDMSK_W: CTRL Position      */
#define C_CAN1_IF1_CMDMSK_W_CTRL_Msk          (0x01UL << C_CAN1_IF1_CMDMSK_W_CTRL_Pos)                /*!< C_CAN1 IF1_CMDMSK_W: CTRL Mask          */
#define C_CAN1_IF1_CMDMSK_W_ARB_Pos           5                                                       /*!< C_CAN1 IF1_CMDMSK_W: ARB Position       */
#define C_CAN1_IF1_CMDMSK_W_ARB_Msk           (0x01UL << C_CAN1_IF1_CMDMSK_W_ARB_Pos)                 /*!< C_CAN1 IF1_CMDMSK_W: ARB Mask           */
#define C_CAN1_IF1_CMDMSK_W_MASK_Pos          6                                                       /*!< C_CAN1 IF1_CMDMSK_W: MASK Position      */
#define C_CAN1_IF1_CMDMSK_W_MASK_Msk          (0x01UL << C_CAN1_IF1_CMDMSK_W_MASK_Pos)                /*!< C_CAN1 IF1_CMDMSK_W: MASK Mask          */
#define C_CAN1_IF1_CMDMSK_W_WR_RD_Pos         7                                                       /*!< C_CAN1 IF1_CMDMSK_W: WR_RD Position     */
#define C_CAN1_IF1_CMDMSK_W_WR_RD_Msk         (0x01UL << C_CAN1_IF1_CMDMSK_W_WR_RD_Pos)               /*!< C_CAN1 IF1_CMDMSK_W: WR_RD Mask         */

