roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  C_CAN1_TXREQ1  ------------------------------- */
#define C_CAN1_TXREQ1_TXRQST16_1_Pos          0                                                       /*!< C_CAN1 TXREQ1: TXRQST16_1 Position      */
#define C_CAN1_TXREQ1_TXRQST16_1_Msk          (0x0000ffffUL << C_CAN1_TXREQ1_TXRQST16_1_Pos)          /*!< C_CAN1 TXREQ1: TXRQST16_1 Mask          */

/* --------------------------------  C_CAN1_TXREQ2  ------------------------------- */
#define C_CAN1_TXREQ2_TXRQST32_17_Pos         0                                                       /*!< C_CAN1 TXREQ2: TXRQST32_17 Position     */
#define C_CAN1_TXREQ2_TXRQST32_17_Msk         (0x0000ffffUL << C_CAN1_TXREQ2_TXRQST32_17_Pos)         /*!< C_CAN1 TXREQ2: TXRQST32_17 Mask         */

/* ---------------------------------  C_CAN1_ND1  --------------------------------- */
#define C_CAN1_ND1_NEWDAT16_1_Pos             0                                                       /*!< C_CAN1 ND1: NEWDAT16_1 Position         */
#define C_CAN1_ND1_NEWDAT16_1_Msk             (0x0000ffffUL << C_CAN1_ND1_NEWDAT16_1_Pos)             /*!< C_CAN1 ND1: NEWDAT16_1 Mask             */

/* ---------------------------------  C_CAN1_ND2  --------------------------------- */
#define C_CAN1_ND2_NEWDAT32_17_Pos            0                                                       /*!< C_CAN1 ND2: NEWDAT32_17 Position        */
#define C_CAN1_ND2_NEWDAT32_17_Msk            (0x0000ffffUL << C_CAN1_ND2_NEWDAT32_17_Pos)            /*!< C_CAN1 ND2: NEWDAT32_17 Mask            */

/* ---------------------------------  C_CAN1_IR1  --------------------------------- */
#define C_CAN1_IR1_INTPND16_1_Pos             0                                                       /*!< C_CAN1 IR1: INTPND16_1 Position         */
#define C_CAN1_IR1_INTPND16_1_Msk             (0x0000ffffUL << C_CAN1_IR1_INTPND16_1_Pos)             /*!< C_CAN1 IR1: INTPND16_1 Mask             */

/* ---------------------------------  C_CAN1_IR2  --------------------------------- */
#define C_CAN1_IR2_INTPND32_17_Pos            0                                                       /*!< C_CAN1 IR2: INTPND32_17 Position        */
#define C_CAN1_IR2_INTPND32_17_Msk            (0x0000ffffUL << C_CAN1_IR2_INTPND32_17_Pos)            /*!< C_CAN1 IR2: INTPND32_17 Mask            */

/* --------------------------------  C_CAN1_MSGV1  -------------------------------- */
#define C_CAN1_MSGV1_MSGVAL16_1_Pos           0                                                       /*!< C_CAN1 MSGV1: MSGVAL16_1 Position       */
#define C_CAN1_MSGV1_MSGVAL16_1_Msk           (0x0000ffffUL << C_CAN1_MSGV1_MSGVAL16_1_Pos)           /*!< C_CAN1 MSGV1: MSGVAL16_1 Mask           */

/* --------------------------------  C_CAN1_MSGV2  -------------------------------- */
#define C_CAN1_MSGV2_MSGVAL32_17_Pos          0                                                       /*!< C_CAN1 MSGV2: MSGVAL32_17 Position      */
#define C_CAN1_MSGV2_MSGVAL32_17_Msk          (0x0000ffffUL << C_CAN1_MSGV2_MSGVAL32_17_Pos)          /*!< C_CAN1 MSGV2: MSGVAL32_17 Mask          */

/* --------------------------------  C_CAN1_CLKDIV  ------------------------------- */
#define C_CAN1_CLKDIV_CLKDIVVAL_Pos           0                                                       /*!< C_CAN1 CLKDIV: CLKDIVVAL Position       */
#define C_CAN1_CLKDIV_CLKDIVVAL_Msk           (0x0fUL << C_CAN1_CLKDIV_CLKDIVVAL_Pos)                 /*!< C_CAN1 CLKDIV: CLKDIVVAL Mask           */


/* ================================================================================ */
/* ================        struct 'RITIMER' Position & Mask        ================ */
/* ================================================================================ */


/* -------------------------------  RITIMER_COMPVAL  ------------------------------ */
#define RITIMER_COMPVAL_RICOMP_Pos            0                                                       /*!< RITIMER COMPVAL: RICOMP Position        */
#define RITIMER_COMPVAL_RICOMP_Msk            (0xffffffffUL << RITIMER_COMPVAL_RICOMP_Pos)            /*!< RITIMER COMPVAL: RICOMP Mask            */

/* --------------------------------  RITIMER_MASK  -------------------------------- */
#define RITIMER_MASK_RIMASK_Pos               0                                                       /*!< RITIMER MASK: RIMASK Position           */
#define RITIMER_MASK_RIMASK_Msk               (0xffffffffUL << RITIMER_MASK_RIMASK_Pos)               /*!< RITIMER MASK: RIMASK Mask               */

/* --------------------------------  RITIMER_CTRL  -------------------------------- */
#define RITIMER_CTRL_RITINT_Pos               0                                                       /*!< RITIMER CTRL: RITINT Position           */
#define RITIMER_CTRL_RITINT_Msk               (0x01UL << RITIMER_CTRL_RITINT_Pos)                     /*!< RITIMER CTRL: RITINT Mask               */
#define RITIMER_CTRL_RITENCLR_Pos             1                                                       /*!< RITIMER CTRL: RITENCLR Position         */
#define RITIMER_CTRL_RITENCLR_Msk             (0x01UL << RITIMER_CTRL_RITENCLR_Pos)                   /*!< RITIMER CTRL: RITENCLR Mask             */
#define RITIMER_CTRL_RITENBR_Pos              2                                                       /*!< RITIMER CTRL: RITENBR Position          */
#define RITIMER_CTRL_RITENBR_Msk              (0x01UL << RITIMER_CTRL_RITENBR_Pos)                    /*!< RITIMER CTRL: RITENBR Mask              */
#define RITIMER_CTRL_RITEN_Pos                3                                                       /*!< RITIMER CTRL: RITEN Position            */
#define RITIMER_CTRL_RITEN_Msk                (0x01UL << RITIMER_CTRL_RITEN_Pos)                      /*!< RITIMER CTRL: RITEN Mask                */

/* -------------------------------  RITIMER_COUNTER  ------------------------------ */
#define RITIMER_COUNTER_RICOUNTER_Pos         0                                                       /*!< RITIMER COUNTER: RICOUNTER Position     */
#define RITIMER_COUNTER_RICOUNTER_Msk         (0xffffffffUL << RITIMER_COUNTER_RICOUNTER_Pos)         /*!< RITIMER COUNTER: RICOUNTER Mask         */


/* ================================================================================ */
/* ================          struct 'QEI' Position & Mask          ================ */
/* ================================================================================ */


