roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------------  QEI_CON  ---------------------------------- */
#define QEI_CON_RESP_Pos                      0                                                       /*!< QEI CON: RESP Position                  */
#define QEI_CON_RESP_Msk                      (0x01UL << QEI_CON_RESP_Pos)                            /*!< QEI CON: RESP Mask                      */
#define QEI_CON_RESPI_Pos                     1                                                       /*!< QEI CON: RESPI Position                 */
#define QEI_CON_RESPI_Msk                     (0x01UL << QEI_CON_RESPI_Pos)                           /*!< QEI CON: RESPI Mask                     */
#define QEI_CON_RESV_Pos                      2                                                       /*!< QEI CON: RESV Position                  */
#define QEI_CON_RESV_Msk                      (0x01UL << QEI_CON_RESV_Pos)                            /*!< QEI CON: RESV Mask                      */
#define QEI_CON_RESI_Pos                      3                                                       /*!< QEI CON: RESI Position                  */
#define QEI_CON_RESI_Msk                      (0x01UL << QEI_CON_RESI_Pos)                            /*!< QEI CON: RESI Mask                      */

/* ----------------------------------  QEI_STAT  ---------------------------------- */
#define QEI_STAT_DIR_Pos                      0                                                       /*!< QEI STAT: DIR Position                  */
#define QEI_STAT_DIR_Msk                      (0x01UL << QEI_STAT_DIR_Pos)                            /*!< QEI STAT: DIR Mask                      */

/* ----------------------------------  QEI_CONF  ---------------------------------- */
#define QEI_CONF_DIRINV_Pos                   0                                                       /*!< QEI CONF: DIRINV Position               */
#define QEI_CONF_DIRINV_Msk                   (0x01UL << QEI_CONF_DIRINV_Pos)                         /*!< QEI CONF: DIRINV Mask                   */
#define QEI_CONF_SIGMODE_Pos                  1                                                       /*!< QEI CONF: SIGMODE Position              */
#define QEI_CONF_SIGMODE_Msk                  (0x01UL << QEI_CONF_SIGMODE_Pos)                        /*!< QEI CONF: SIGMODE Mask                  */
#define QEI_CONF_CAPMODE_Pos                  2                                                       /*!< QEI CONF: CAPMODE Position              */
#define QEI_CONF_CAPMODE_Msk                  (0x01UL << QEI_CONF_CAPMODE_Pos)                        /*!< QEI CONF: CAPMODE Mask                  */
#define QEI_CONF_INVINX_Pos                   3                                                       /*!< QEI CONF: INVINX Position               */
#define QEI_CONF_INVINX_Msk                   (0x01UL << QEI_CONF_INVINX_Pos)                         /*!< QEI CONF: INVINX Mask                   */
#define QEI_CONF_CRESPI_Pos                   4                                                       /*!< QEI CONF: CRESPI Position               */
#define QEI_CONF_CRESPI_Msk                   (0x01UL << QEI_CONF_CRESPI_Pos)                         /*!< QEI CONF: CRESPI Mask                   */
#define QEI_CONF_INXGATE_Pos                  16                                                      /*!< QEI CONF: INXGATE Position              */
#define QEI_CONF_INXGATE_Msk                  (0x0fUL << QEI_CONF_INXGATE_Pos)                        /*!< QEI CONF: INXGATE Mask                  */

/* -----------------------------------  QEI_POS  ---------------------------------- */
#define QEI_POS_POS_Pos                       0                                                       /*!< QEI POS: POS Position                   */
#define QEI_POS_POS_Msk                       (0xffffffffUL << QEI_POS_POS_Pos)                       /*!< QEI POS: POS Mask                       */

/* ---------------------------------  QEI_MAXPOS  --------------------------------- */
#define QEI_MAXPOS_MAXPOS_Pos                 0                                                       /*!< QEI MAXPOS: MAXPOS Position             */
#define QEI_MAXPOS_MAXPOS_Msk                 (0xffffffffUL << QEI_MAXPOS_MAXPOS_Pos)                 /*!< QEI MAXPOS: MAXPOS Mask                 */

/* ---------------------------------  QEI_CMPOS0  --------------------------------- */
#define QEI_CMPOS0_PCMP0_Pos                  0                                                       /*!< QEI CMPOS0: PCMP0 Position              */
#define QEI_CMPOS0_PCMP0_Msk                  (0xffffffffUL << QEI_CMPOS0_PCMP0_Pos)                  /*!< QEI CMPOS0: PCMP0 Mask                  */

/* ---------------------------------  QEI_CMPOS1  --------------------------------- */
#define QEI_CMPOS1_PCMP1_Pos                  0                                                       /*!< QEI CMPOS1: PCMP1 Position              */
#define QEI_CMPOS1_PCMP1_Msk                  (0xffffffffUL << QEI_CMPOS1_PCMP1_Pos)                  /*!< QEI CMPOS1: PCMP1 Mask                  */

/* ---------------------------------  QEI_CMPOS2  --------------------------------- */
#define QEI_CMPOS2_PCMP2_Pos                  0                                                       /*!< QEI CMPOS2: PCMP2 Position              */
#define QEI_CMPOS2_PCMP2_Msk                  (0xffffffffUL << QEI_CMPOS2_PCMP2_Pos)                  /*!< QEI CMPOS2: PCMP2 Mask                  */

/* ---------------------------------  QEI_INXCNT  --------------------------------- */
#define QEI_INXCNT_ENCPOS_Pos                 0                                                       /*!< QEI INXCNT: ENCPOS Position             */
#define QEI_INXCNT_ENCPOS_Msk                 (0xffffffffUL << QEI_INXCNT_ENCPOS_Pos)                 /*!< QEI INXCNT: ENCPOS Mask                 */

/* ---------------------------------  QEI_INXCMP0  -------------------------------- */
#define QEI_INXCMP0_ICMP0_Pos                 0                                                       /*!< QEI INXCMP0: ICMP0 Position             */
#define QEI_INXCMP0_ICMP0_Msk                 (0xffffffffUL << QEI_INXCMP0_ICMP0_Pos)                 /*!< QEI INXCMP0: ICMP0 Mask                 */

