roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  QEI_LOAD  ---------------------------------- */
#define QEI_LOAD_VELLOAD_Pos                  0                                                       /*!< QEI LOAD: VELLOAD Position              */
#define QEI_LOAD_VELLOAD_Msk                  (0xffffffffUL << QEI_LOAD_VELLOAD_Pos)                  /*!< QEI LOAD: VELLOAD Mask                  */

/* ----------------------------------  QEI_TIME  ---------------------------------- */
#define QEI_TIME_VELVAL_Pos                   0                                                       /*!< QEI TIME: VELVAL Position               */
#define QEI_TIME_VELVAL_Msk                   (0xffffffffUL << QEI_TIME_VELVAL_Pos)                   /*!< QEI TIME: VELVAL Mask                   */

/* -----------------------------------  QEI_VEL  ---------------------------------- */
#define QEI_VEL_VELPC_Pos                     0                                                       /*!< QEI VEL: VELPC Position                 */
#define QEI_VEL_VELPC_Msk                     (0xffffffffUL << QEI_VEL_VELPC_Pos)                     /*!< QEI VEL: VELPC Mask                     */

/* -----------------------------------  QEI_CAP  ---------------------------------- */
#define QEI_CAP_VELCAP_Pos                    0                                                       /*!< QEI CAP: VELCAP Position                */
#define QEI_CAP_VELCAP_Msk                    (0xffffffffUL << QEI_CAP_VELCAP_Pos)                    /*!< QEI CAP: VELCAP Mask                    */

/* ---------------------------------  QEI_VELCOMP  -------------------------------- */
#define QEI_VELCOMP_VELCMP_Pos                0                                                       /*!< QEI VELCOMP: VELCMP Position            */
#define QEI_VELCOMP_VELCMP_Msk                (0xffffffffUL << QEI_VELCOMP_VELCMP_Pos)                /*!< QEI VELCOMP: VELCMP Mask                */

/* --------------------------------  QEI_FILTERPHA  ------------------------------- */
#define QEI_FILTERPHA_FILTA_Pos               0                                                       /*!< QEI FILTERPHA: FILTA Position           */
#define QEI_FILTERPHA_FILTA_Msk               (0xffffffffUL << QEI_FILTERPHA_FILTA_Pos)               /*!< QEI FILTERPHA: FILTA Mask               */

/* --------------------------------  QEI_FILTERPHB  ------------------------------- */
#define QEI_FILTERPHB_FILTB_Pos               0                                                       /*!< QEI FILTERPHB: FILTB Position           */
#define QEI_FILTERPHB_FILTB_Msk               (0xffffffffUL << QEI_FILTERPHB_FILTB_Pos)               /*!< QEI FILTERPHB: FILTB Mask               */

/* --------------------------------  QEI_FILTERINX  ------------------------------- */
#define QEI_FILTERINX_FITLINX_Pos             0                                                       /*!< QEI FILTERINX: FITLINX Position         */
#define QEI_FILTERINX_FITLINX_Msk             (0xffffffffUL << QEI_FILTERINX_FITLINX_Pos)             /*!< QEI FILTERINX: FITLINX Mask             */

/* ---------------------------------  QEI_WINDOW  --------------------------------- */
#define QEI_WINDOW_WINDOW_Pos                 0                                                       /*!< QEI WINDOW: WINDOW Position             */
#define QEI_WINDOW_WINDOW_Msk                 (0xffffffffUL << QEI_WINDOW_WINDOW_Pos)                 /*!< QEI WINDOW: WINDOW Mask                 */

/* ---------------------------------  QEI_INXCMP1  -------------------------------- */
#define QEI_INXCMP1_ICMP1_Pos                 0                                                       /*!< QEI INXCMP1: ICMP1 Position             */
#define QEI_INXCMP1_ICMP1_Msk                 (0xffffffffUL << QEI_INXCMP1_ICMP1_Pos)                 /*!< QEI INXCMP1: ICMP1 Mask                 */

/* ---------------------------------  QEI_INXCMP2  -------------------------------- */
#define QEI_INXCMP2_ICMP2_Pos                 0                                                       /*!< QEI INXCMP2: ICMP2 Position             */
#define QEI_INXCMP2_ICMP2_Msk                 (0xffffffffUL << QEI_INXCMP2_ICMP2_Pos)                 /*!< QEI INXCMP2: ICMP2 Mask                 */

/* -----------------------------------  QEI_IEC  ---------------------------------- */
#define QEI_IEC_INX_EN_Pos                    0                                                       /*!< QEI IEC: INX_EN Position                */
#define QEI_IEC_INX_EN_Msk                    (0x01UL << QEI_IEC_INX_EN_Pos)                          /*!< QEI IEC: INX_EN Mask                    */
#define QEI_IEC_TIM_EN_Pos                    1                                                       /*!< QEI IEC: TIM_EN Position                */
#define QEI_IEC_TIM_EN_Msk                    (0x01UL << QEI_IEC_TIM_EN_Pos)                          /*!< QEI IEC: TIM_EN Mask                    */
#define QEI_IEC_VELC_EN_Pos                   2                                                       /*!< QEI IEC: VELC_EN Position               */
#define QEI_IEC_VELC_EN_Msk                   (0x01UL << QEI_IEC_VELC_EN_Pos)                         /*!< QEI IEC: VELC_EN Mask                   */
#define QEI_IEC_DIR_EN_Pos                    3                                                       /*!< QEI IEC: DIR_EN Position                */
#define QEI_IEC_DIR_EN_Msk                    (0x01UL << QEI_IEC_DIR_EN_Pos)                          /*!< QEI IEC: DIR_EN Mask                    */
#define QEI_IEC_ERR_EN_Pos                    4                                                       /*!< QEI IEC: ERR_EN Position                */
#define QEI_IEC_ERR_EN_Msk                    (0x01UL << QEI_IEC_ERR_EN_Pos)                          /*!< QEI IEC: ERR_EN Mask                    */
#define QEI_IEC_ENCLK_EN_Pos                  5                                                       /*!< QEI IEC: ENCLK_EN Position              */
#define QEI_IEC_ENCLK_EN_Msk                  (0x01UL << QEI_IEC_ENCLK_EN_Pos)                        /*!< QEI IEC: ENCLK_EN Mask                  */
#define QEI_IEC_POS0_Int_Pos                  6                                                       /*!< QEI IEC: POS0_Int Position              */
#define QEI_IEC_POS0_Int_Msk                  (0x01UL << QEI_IEC_POS0_Int_Pos)                        /*!< QEI IEC: POS0_Int Mask                  */
#define QEI_IEC_POS1_Int_Pos                  7                                                       /*!< QEI IEC: POS1_Int Position              */
#define QEI_IEC_POS1_Int_Msk                  (0x01UL << QEI_IEC_POS1_Int_Pos)                        /*!< QEI IEC: POS1_Int Mask                  */
#define QEI_IEC_POS2_Int_Pos                  8                                                       /*!< QEI IEC: POS2_Int Position              */
#define QEI_IEC_POS2_Int_Msk                  (0x01UL << QEI_IEC_POS2_Int_Pos)                        /*!< QEI IEC: POS2_Int Mask                  */
#define QEI_IEC_REV_Int_Pos                   9                                                       /*!< QEI IEC: REV_Int Position               */
#define QEI_IEC_REV_Int_Msk                   (0x01UL << QEI_IEC_REV_Int_Pos)                         /*!< QEI IEC: REV_Int Mask                   */
#define QEI_IEC_POS0REV_Int_Pos               10                                                      /*!< QEI IEC: POS0REV_Int Position           */
#define QEI_IEC_POS0REV_Int_Msk               (0x01UL << QEI_IEC_POS0REV_Int_Pos)                     /*!< QEI IEC: POS0REV_Int Mask               */
#define QEI_IEC_POS1REV_Int_Pos               11                                                      /*!< QEI IEC: POS1REV_Int Position           */
#define QEI_IEC_POS1REV_Int_Msk               (0x01UL << QEI_IEC_POS1REV_Int_Pos)                     /*!< QEI IEC: POS1REV_Int Mask               */
#define QEI_IEC_POS2REV_Int_Pos               12                                                      /*!< QEI IEC: POS2REV_Int Position           */
#define QEI_IEC_POS2REV_Int_Msk               (0x01UL << QEI_IEC_POS2REV_Int_Pos)                     /*!< QEI IEC: POS2REV_Int Mask               */
#define QEI_IEC_REV1_Int_Pos                  13                                                      /*!< QEI IEC: REV1_Int Position              */
#define QEI_IEC_REV1_Int_Msk                  (0x01UL << QEI_IEC_REV1_Int_Pos)                        /*!< QEI IEC: REV1_Int Mask                  */
#define QEI_IEC_REV2_Int_Pos                  14                                                      /*!< QEI IEC: REV2_Int Position              */
#define QEI_IEC_REV2_Int_Msk                  (0x01UL << QEI_IEC_REV2_Int_Pos)                        /*!< QEI IEC: REV2_Int Mask                  */
#define QEI_IEC_MAXPOS_Int_Pos                15                                                      /*!< QEI IEC: MAXPOS_Int Position            */
#define QEI_IEC_MAXPOS_Int_Msk                (0x01UL << QEI_IEC_MAXPOS_Int_Pos)                      /*!< QEI IEC: MAXPOS_Int Mask                */

