roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------------  QEI_IES  ---------------------------------- */
#define QEI_IES_INX_EN_Pos                    0                                                       /*!< QEI IES: INX_EN Position                */
#define QEI_IES_INX_EN_Msk                    (0x01UL << QEI_IES_INX_EN_Pos)                          /*!< QEI IES: INX_EN Mask                    */
#define QEI_IES_TIM_EN_Pos                    1                                                       /*!< QEI IES: TIM_EN Position                */
#define QEI_IES_TIM_EN_Msk                    (0x01UL << QEI_IES_TIM_EN_Pos)                          /*!< QEI IES: TIM_EN Mask                    */
#define QEI_IES_VELC_EN_Pos                   2                                                       /*!< QEI IES: VELC_EN Position               */
#define QEI_IES_VELC_EN_Msk                   (0x01UL << QEI_IES_VELC_EN_Pos)                         /*!< QEI IES: VELC_EN Mask                   */
#define QEI_IES_DIR_EN_Pos                    3                                                       /*!< QEI IES: DIR_EN Position                */
#define QEI_IES_DIR_EN_Msk                    (0x01UL << QEI_IES_DIR_EN_Pos)                          /*!< QEI IES: DIR_EN Mask                    */
#define QEI_IES_ERR_EN_Pos                    4                                                       /*!< QEI IES: ERR_EN Position                */
#define QEI_IES_ERR_EN_Msk                    (0x01UL << QEI_IES_ERR_EN_Pos)                          /*!< QEI IES: ERR_EN Mask                    */
#define QEI_IES_ENCLK_EN_Pos                  5                                                       /*!< QEI IES: ENCLK_EN Position              */
#define QEI_IES_ENCLK_EN_Msk                  (0x01UL << QEI_IES_ENCLK_EN_Pos)                        /*!< QEI IES: ENCLK_EN Mask                  */
#define QEI_IES_POS0_Int_Pos                  6                                                       /*!< QEI IES: POS0_Int Position              */
#define QEI_IES_POS0_Int_Msk                  (0x01UL << QEI_IES_POS0_Int_Pos)                        /*!< QEI IES: POS0_Int Mask                  */
#define QEI_IES_POS1_Int_Pos                  7                                                       /*!< QEI IES: POS1_Int Position              */
#define QEI_IES_POS1_Int_Msk                  (0x01UL << QEI_IES_POS1_Int_Pos)                        /*!< QEI IES: POS1_Int Mask                  */
#define QEI_IES_POS2_Int_Pos                  8                                                       /*!< QEI IES: POS2_Int Position              */
#define QEI_IES_POS2_Int_Msk                  (0x01UL << QEI_IES_POS2_Int_Pos)                        /*!< QEI IES: POS2_Int Mask                  */
#define QEI_IES_REV_Int_Pos                   9                                                       /*!< QEI IES: REV_Int Position               */
#define QEI_IES_REV_Int_Msk                   (0x01UL << QEI_IES_REV_Int_Pos)                         /*!< QEI IES: REV_Int Mask                   */
#define QEI_IES_POS0REV_Int_Pos               10                                                      /*!< QEI IES: POS0REV_Int Position           */
#define QEI_IES_POS0REV_Int_Msk               (0x01UL << QEI_IES_POS0REV_Int_Pos)                     /*!< QEI IES: POS0REV_Int Mask               */
#define QEI_IES_POS1REV_Int_Pos               11                                                      /*!< QEI IES: POS1REV_Int Position           */
#define QEI_IES_POS1REV_Int_Msk               (0x01UL << QEI_IES_POS1REV_Int_Pos)                     /*!< QEI IES: POS1REV_Int Mask               */
#define QEI_IES_POS2REV_Int_Pos               12                                                      /*!< QEI IES: POS2REV_Int Position           */
#define QEI_IES_POS2REV_Int_Msk               (0x01UL << QEI_IES_POS2REV_Int_Pos)                     /*!< QEI IES: POS2REV_Int Mask               */
#define QEI_IES_REV1_Int_Pos                  13                                                      /*!< QEI IES: REV1_Int Position              */
#define QEI_IES_REV1_Int_Msk                  (0x01UL << QEI_IES_REV1_Int_Pos)                        /*!< QEI IES: REV1_Int Mask                  */
#define QEI_IES_REV2_Int_Pos                  14                                                      /*!< QEI IES: REV2_Int Position              */
#define QEI_IES_REV2_Int_Msk                  (0x01UL << QEI_IES_REV2_Int_Pos)                        /*!< QEI IES: REV2_Int Mask                  */
#define QEI_IES_MAXPOS_Int_Pos                15                                                      /*!< QEI IES: MAXPOS_Int Position            */
#define QEI_IES_MAXPOS_Int_Msk                (0x01UL << QEI_IES_MAXPOS_Int_Pos)                      /*!< QEI IES: MAXPOS_Int Mask                */

/* ---------------------------------  QEI_INTSTAT  -------------------------------- */
#define QEI_INTSTAT_INX_Int_Pos               0                                                       /*!< QEI INTSTAT: INX_Int Position           */
#define QEI_INTSTAT_INX_Int_Msk               (0x01UL << QEI_INTSTAT_INX_Int_Pos)                     /*!< QEI INTSTAT: INX_Int Mask               */
#define QEI_INTSTAT_TIM_Int_Pos               1                                                       /*!< QEI INTSTAT: TIM_Int Position           */
#define QEI_INTSTAT_TIM_Int_Msk               (0x01UL << QEI_INTSTAT_TIM_Int_Pos)                     /*!< QEI INTSTAT: TIM_Int Mask               */
#define QEI_INTSTAT_VELC_Int_Pos              2                                                       /*!< QEI INTSTAT: VELC_Int Position          */
#define QEI_INTSTAT_VELC_Int_Msk              (0x01UL << QEI_INTSTAT_VELC_Int_Pos)                    /*!< QEI INTSTAT: VELC_Int Mask              */
#define QEI_INTSTAT_DIR_Int_Pos               3                                                       /*!< QEI INTSTAT: DIR_Int Position           */
#define QEI_INTSTAT_DIR_Int_Msk               (0x01UL << QEI_INTSTAT_DIR_Int_Pos)                     /*!< QEI INTSTAT: DIR_Int Mask               */
#define QEI_INTSTAT_ERR_Int_Pos               4                                                       /*!< QEI INTSTAT: ERR_Int Position           */
#define QEI_INTSTAT_ERR_Int_Msk               (0x01UL << QEI_INTSTAT_ERR_Int_Pos)                     /*!< QEI INTSTAT: ERR_Int Mask               */
#define QEI_INTSTAT_ENCLK_Int_Pos             5                                                       /*!< QEI INTSTAT: ENCLK_Int Position         */
#define QEI_INTSTAT_ENCLK_Int_Msk             (0x01UL << QEI_INTSTAT_ENCLK_Int_Pos)                   /*!< QEI INTSTAT: ENCLK_Int Mask             */
#define QEI_INTSTAT_POS0_Int_Pos              6                                                       /*!< QEI INTSTAT: POS0_Int Position          */
#define QEI_INTSTAT_POS0_Int_Msk              (0x01UL << QEI_INTSTAT_POS0_Int_Pos)                    /*!< QEI INTSTAT: POS0_Int Mask              */
#define QEI_INTSTAT_POS1_Int_Pos              7                                                       /*!< QEI INTSTAT: POS1_Int Position          */
#define QEI_INTSTAT_POS1_Int_Msk              (0x01UL << QEI_INTSTAT_POS1_Int_Pos)                    /*!< QEI INTSTAT: POS1_Int Mask              */
#define QEI_INTSTAT_POS2_Int_Pos              8                                                       /*!< QEI INTSTAT: POS2_Int Position          */
#define QEI_INTSTAT_POS2_Int_Msk              (0x01UL << QEI_INTSTAT_POS2_Int_Pos)                    /*!< QEI INTSTAT: POS2_Int Mask              */
#define QEI_INTSTAT_REV_Int_Pos               9                                                       /*!< QEI INTSTAT: REV_Int Position           */
#define QEI_INTSTAT_REV_Int_Msk               (0x01UL << QEI_INTSTAT_REV_Int_Pos)                     /*!< QEI INTSTAT: REV_Int Mask               */
#define QEI_INTSTAT_POS0REV_Int_Pos           10                                                      /*!< QEI INTSTAT: POS0REV_Int Position       */
#define QEI_INTSTAT_POS0REV_Int_Msk           (0x01UL << QEI_INTSTAT_POS0REV_Int_Pos)                 /*!< QEI INTSTAT: POS0REV_Int Mask           */
#define QEI_INTSTAT_POS1REV_Int_Pos           11                                                      /*!< QEI INTSTAT: POS1REV_Int Position       */
#define QEI_INTSTAT_POS1REV_Int_Msk           (0x01UL << QEI_INTSTAT_POS1REV_Int_Pos)                 /*!< QEI INTSTAT: POS1REV_Int Mask           */
#define QEI_INTSTAT_POS2REV_Int_Pos           12                                                      /*!< QEI INTSTAT: POS2REV_Int Position       */
#define QEI_INTSTAT_POS2REV_Int_Msk           (0x01UL << QEI_INTSTAT_POS2REV_Int_Pos)                 /*!< QEI INTSTAT: POS2REV_Int Mask           */
#define QEI_INTSTAT_REV1_Int_Pos              13                                                      /*!< QEI INTSTAT: REV1_Int Position          */
#define QEI_INTSTAT_REV1_Int_Msk              (0x01UL << QEI_INTSTAT_REV1_Int_Pos)                    /*!< QEI INTSTAT: REV1_Int Mask              */
#define QEI_INTSTAT_REV2_Int_Pos              14                                                      /*!< QEI INTSTAT: REV2_Int Position          */
#define QEI_INTSTAT_REV2_Int_Msk              (0x01UL << QEI_INTSTAT_REV2_Int_Pos)                    /*!< QEI INTSTAT: REV2_Int Mask              */
#define QEI_INTSTAT_MAXPOS_Int_Pos            15                                                      /*!< QEI INTSTAT: MAXPOS_Int Position        */
#define QEI_INTSTAT_MAXPOS_Int_Msk            (0x01UL << QEI_INTSTAT_MAXPOS_Int_Pos)                  /*!< QEI INTSTAT: MAXPOS_Int Mask            */

/* -----------------------------------  QEI_IE  ----------------------------------- */
#define QEI_IE_INX_Int_Pos                    0                                                       /*!< QEI IE: INX_Int Position                */
#define QEI_IE_INX_Int_Msk                    (0x01UL << QEI_IE_INX_Int_Pos)                          /*!< QEI IE: INX_Int Mask                    */
#define QEI_IE_TIM_Int_Pos                    1                                                       /*!< QEI IE: TIM_Int Position                */
#define QEI_IE_TIM_Int_Msk                    (0x01UL << QEI_IE_TIM_Int_Pos)                          /*!< QEI IE: TIM_Int Mask                    */
#define QEI_IE_VELC_Int_Pos                   2                                                       /*!< QEI IE: VELC_Int Position               */
#define QEI_IE_VELC_Int_Msk                   (0x01UL << QEI_IE_VELC_Int_Pos)                         /*!< QEI IE: VELC_Int Mask                   */
#define QEI_IE_DIR_Int_Pos                    3                                                       /*!< QEI IE: DIR_Int Position                */
#define QEI_IE_DIR_Int_Msk                    (0x01UL << QEI_IE_DIR_Int_Pos)                          /*!< QEI IE: DIR_Int Mask                    */
#define QEI_IE_ERR_Int_Pos                    4                                                       /*!< QEI IE: ERR_Int Position                */
#define QEI_IE_ERR_Int_Msk                    (0x01UL << QEI_IE_ERR_Int_Pos)                          /*!< QEI IE: ERR_Int Mask                    */
#define QEI_IE_ENCLK_Int_Pos                  5                                                       /*!< QEI IE: ENCLK_Int Position              */
#define QEI_IE_ENCLK_Int_Msk                  (0x01UL << QEI_IE_ENCLK_Int_Pos)                        /*!< QEI IE: ENCLK_Int Mask                  */
#define QEI_IE_POS0_Int_Pos                   6                                                       /*!< QEI IE: POS0_Int Position               */
#define QEI_IE_POS0_Int_Msk                   (0x01UL << QEI_IE_POS0_Int_Pos)                         /*!< QEI IE: POS0_Int Mask                   */
#define QEI_IE_POS1_Int_Pos                   7                                                       /*!< QEI IE: POS1_Int Position               */
#define QEI_IE_POS1_Int_Msk                   (0x01UL << QEI_IE_POS1_Int_Pos)                         /*!< QEI IE: POS1_Int Mask                   */
#define QEI_IE_POS2_Int_Pos                   8                                                       /*!< QEI IE: POS2_Int Position               */
#define QEI_IE_POS2_Int_Msk                   (0x01UL << QEI_IE_POS2_Int_Pos)                         /*!< QEI IE: POS2_Int Mask                   */
#define QEI_IE_REV_Int_Pos                    9                                                       /*!< QEI IE: REV_Int Position                */
#define QEI_IE_REV_Int_Msk                    (0x01UL << QEI_IE_REV_Int_Pos)                          /*!< QEI IE: REV_Int Mask                    */
#define QEI_IE_POS0REV_Int_Pos                10                                                      /*!< QEI IE: POS0REV_Int Position            */
#define QEI_IE_POS0REV_Int_Msk                (0x01UL << QEI_IE_POS0REV_Int_Pos)                      /*!< QEI IE: POS0REV_Int Mask                */
#define QEI_IE_POS1REV_Int_Pos                11                                                      /*!< QEI IE: POS1REV_Int Position            */
#define QEI_IE_POS1REV_Int_Msk                (0x01UL << QEI_IE_POS1REV_Int_Pos)                      /*!< QEI IE: POS1REV_Int Mask                */
#define QEI_IE_POS2REV_Int_Pos                12                                                      /*!< QEI IE: POS2REV_Int Position            */
#define QEI_IE_POS2REV_Int_Msk                (0x01UL << QEI_IE_POS2REV_Int_Pos)                      /*!< QEI IE: POS2REV_Int Mask                */
#define QEI_IE_REV1_Int_Pos                   13                                                      /*!< QEI IE: REV1_Int Position               */
#define QEI_IE_REV1_Int_Msk                   (0x01UL << QEI_IE_REV1_Int_Pos)                         /*!< QEI IE: REV1_Int Mask                   */
#define QEI_IE_REV2_Int_Pos                   14                                                      /*!< QEI IE: REV2_Int Position               */
#define QEI_IE_REV2_Int_Msk                   (0x01UL << QEI_IE_REV2_Int_Pos)                         /*!< QEI IE: REV2_Int Mask                   */
#define QEI_IE_MAXPOS_Int_Pos                 15                                                      /*!< QEI IE: MAXPOS_Int Position             */
#define QEI_IE_MAXPOS_Int_Msk                 (0x01UL << QEI_IE_MAXPOS_Int_Pos)                       /*!< QEI IE: MAXPOS_Int Mask                 */

