roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  GIMA_CTIN_3_IN  ------------------------------- */
#define GIMA_CTIN_3_IN_INV_Pos                0                                                       /*!< GIMA CTIN_3_IN: INV Position            */
#define GIMA_CTIN_3_IN_INV_Msk                (0x01UL << GIMA_CTIN_3_IN_INV_Pos)                      /*!< GIMA CTIN_3_IN: INV Mask                */
#define GIMA_CTIN_3_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_3_IN: EDGE Position           */
#define GIMA_CTIN_3_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_3_IN_EDGE_Pos)                     /*!< GIMA CTIN_3_IN: EDGE Mask               */
#define GIMA_CTIN_3_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_3_IN: SYNCH Position          */
#define GIMA_CTIN_3_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_3_IN_SYNCH_Pos)                    /*!< GIMA CTIN_3_IN: SYNCH Mask              */
#define GIMA_CTIN_3_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_3_IN: PULSE Position          */
#define GIMA_CTIN_3_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_3_IN_PULSE_Pos)                    /*!< GIMA CTIN_3_IN: PULSE Mask              */
#define GIMA_CTIN_3_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_3_IN: SELECT Position         */
#define GIMA_CTIN_3_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_3_IN_SELECT_Pos)                   /*!< GIMA CTIN_3_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_4_IN  ------------------------------- */
#define GIMA_CTIN_4_IN_INV_Pos                0                                                       /*!< GIMA CTIN_4_IN: INV Position            */
#define GIMA_CTIN_4_IN_INV_Msk                (0x01UL << GIMA_CTIN_4_IN_INV_Pos)                      /*!< GIMA CTIN_4_IN: INV Mask                */
#define GIMA_CTIN_4_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_4_IN: EDGE Position           */
#define GIMA_CTIN_4_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_4_IN_EDGE_Pos)                     /*!< GIMA CTIN_4_IN: EDGE Mask               */
#define GIMA_CTIN_4_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_4_IN: SYNCH Position          */
#define GIMA_CTIN_4_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_4_IN_SYNCH_Pos)                    /*!< GIMA CTIN_4_IN: SYNCH Mask              */
#define GIMA_CTIN_4_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_4_IN: PULSE Position          */
#define GIMA_CTIN_4_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_4_IN_PULSE_Pos)                    /*!< GIMA CTIN_4_IN: PULSE Mask              */
#define GIMA_CTIN_4_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_4_IN: SELECT Position         */
#define GIMA_CTIN_4_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_4_IN_SELECT_Pos)                   /*!< GIMA CTIN_4_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_5_IN  ------------------------------- */
#define GIMA_CTIN_5_IN_INV_Pos                0                                                       /*!< GIMA CTIN_5_IN: INV Position            */
#define GIMA_CTIN_5_IN_INV_Msk                (0x01UL << GIMA_CTIN_5_IN_INV_Pos)                      /*!< GIMA CTIN_5_IN: INV Mask                */
#define GIMA_CTIN_5_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_5_IN: EDGE Position           */
#define GIMA_CTIN_5_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_5_IN_EDGE_Pos)                     /*!< GIMA CTIN_5_IN: EDGE Mask               */
#define GIMA_CTIN_5_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_5_IN: SYNCH Position          */
#define GIMA_CTIN_5_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_5_IN_SYNCH_Pos)                    /*!< GIMA CTIN_5_IN: SYNCH Mask              */
#define GIMA_CTIN_5_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_5_IN: PULSE Position          */
#define GIMA_CTIN_5_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_5_IN_PULSE_Pos)                    /*!< GIMA CTIN_5_IN: PULSE Mask              */
#define GIMA_CTIN_5_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_5_IN: SELECT Position         */
#define GIMA_CTIN_5_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_5_IN_SELECT_Pos)                   /*!< GIMA CTIN_5_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_6_IN  ------------------------------- */
#define GIMA_CTIN_6_IN_INV_Pos                0                                                       /*!< GIMA CTIN_6_IN: INV Position            */
#define GIMA_CTIN_6_IN_INV_Msk                (0x01UL << GIMA_CTIN_6_IN_INV_Pos)                      /*!< GIMA CTIN_6_IN: INV Mask                */
#define GIMA_CTIN_6_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_6_IN: EDGE Position           */
#define GIMA_CTIN_6_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_6_IN_EDGE_Pos)                     /*!< GIMA CTIN_6_IN: EDGE Mask               */
#define GIMA_CTIN_6_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_6_IN: SYNCH Position          */
#define GIMA_CTIN_6_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_6_IN_SYNCH_Pos)                    /*!< GIMA CTIN_6_IN: SYNCH Mask              */
#define GIMA_CTIN_6_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_6_IN: PULSE Position          */
#define GIMA_CTIN_6_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_6_IN_PULSE_Pos)                    /*!< GIMA CTIN_6_IN: PULSE Mask              */
#define GIMA_CTIN_6_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_6_IN: SELECT Position         */
#define GIMA_CTIN_6_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_6_IN_SELECT_Pos)                   /*!< GIMA CTIN_6_IN: SELECT Mask             */

/* -------------------------------  GIMA_CTIN_7_IN  ------------------------------- */
#define GIMA_CTIN_7_IN_INV_Pos                0                                                       /*!< GIMA CTIN_7_IN: INV Position            */
#define GIMA_CTIN_7_IN_INV_Msk                (0x01UL << GIMA_CTIN_7_IN_INV_Pos)                      /*!< GIMA CTIN_7_IN: INV Mask                */
#define GIMA_CTIN_7_IN_EDGE_Pos               1                                                       /*!< GIMA CTIN_7_IN: EDGE Position           */
#define GIMA_CTIN_7_IN_EDGE_Msk               (0x01UL << GIMA_CTIN_7_IN_EDGE_Pos)                     /*!< GIMA CTIN_7_IN: EDGE Mask               */
#define GIMA_CTIN_7_IN_SYNCH_Pos              2                                                       /*!< GIMA CTIN_7_IN: SYNCH Position          */
#define GIMA_CTIN_7_IN_SYNCH_Msk              (0x01UL << GIMA_CTIN_7_IN_SYNCH_Pos)                    /*!< GIMA CTIN_7_IN: SYNCH Mask              */
#define GIMA_CTIN_7_IN_PULSE_Pos              3                                                       /*!< GIMA CTIN_7_IN: PULSE Position          */
#define GIMA_CTIN_7_IN_PULSE_Msk              (0x01UL << GIMA_CTIN_7_IN_PULSE_Pos)                    /*!< GIMA CTIN_7_IN: PULSE Mask              */
#define GIMA_CTIN_7_IN_SELECT_Pos             4                                                       /*!< GIMA CTIN_7_IN: SELECT Position         */
#define GIMA_CTIN_7_IN_SELECT_Msk             (0x0fUL << GIMA_CTIN_7_IN_SELECT_Pos)                   /*!< GIMA CTIN_7_IN: SELECT Mask             */

/* ----------------------------  GIMA_ADCHS_TRIGGER_IN  --------------------------- */
#define GIMA_ADCHS_TRIGGER_IN_INV_Pos         0                                                       /*!< GIMA ADCHS_TRIGGER_IN: INV Position     */
#define GIMA_ADCHS_TRIGGER_IN_INV_Msk         (0x01UL << GIMA_ADCHS_TRIGGER_IN_INV_Pos)               /*!< GIMA ADCHS_TRIGGER_IN: INV Mask         */
#define GIMA_ADCHS_TRIGGER_IN_EDGE_Pos        1                                                       /*!< GIMA ADCHS_TRIGGER_IN: EDGE Position    */
#define GIMA_ADCHS_TRIGGER_IN_EDGE_Msk        (0x01UL << GIMA_ADCHS_TRIGGER_IN_EDGE_Pos)              /*!< GIMA ADCHS_TRIGGER_IN: EDGE Mask        */
#define GIMA_ADCHS_TRIGGER_IN_SYNCH_Pos       2                                                       /*!< GIMA ADCHS_TRIGGER_IN: SYNCH Position   */
#define GIMA_ADCHS_TRIGGER_IN_SYNCH_Msk       (0x01UL << GIMA_ADCHS_TRIGGER_IN_SYNCH_Pos)             /*!< GIMA ADCHS_TRIGGER_IN: SYNCH Mask       */
#define GIMA_ADCHS_TRIGGER_IN_PULSE_Pos       3                                                       /*!< GIMA ADCHS_TRIGGER_IN: PULSE Position   */
#define GIMA_ADCHS_TRIGGER_IN_PULSE_Msk       (0x01UL << GIMA_ADCHS_TRIGGER_IN_PULSE_Pos)             /*!< GIMA ADCHS_TRIGGER_IN: PULSE Mask       */
#define GIMA_ADCHS_TRIGGER_IN_SELECT_Pos      4                                                       /*!< GIMA ADCHS_TRIGGER_IN: SELECT Position  */
#define GIMA_ADCHS_TRIGGER_IN_SELECT_Msk      (0x0fUL << GIMA_ADCHS_TRIGGER_IN_SELECT_Pos)            /*!< GIMA ADCHS_TRIGGER_IN: SELECT Mask      */

/* ---------------------------  GIMA_EVENTROUTER_13_IN  --------------------------- */
#define GIMA_EVENTROUTER_13_IN_INV_Pos        0                                                       /*!< GIMA EVENTROUTER_13_IN: INV Position    */
#define GIMA_EVENTROUTER_13_IN_INV_Msk        (0x01UL << GIMA_EVENTROUTER_13_IN_INV_Pos)              /*!< GIMA EVENTROUTER_13_IN: INV Mask        */
#define GIMA_EVENTROUTER_13_IN_EDGE_Pos       1                                                       /*!< GIMA EVENTROUTER_13_IN: EDGE Position   */
#define GIMA_EVENTROUTER_13_IN_EDGE_Msk       (0x01UL << GIMA_EVENTROUTER_13_IN_EDGE_Pos)             /*!< GIMA EVENTROUTER_13_IN: EDGE Mask       */
#define GIMA_EVENTROUTER_13_IN_SYNCH_Pos      2                                                       /*!< GIMA EVENTROUTER_13_IN: SYNCH Position  */
#define GIMA_EVENTROUTER_13_IN_SYNCH_Msk      (0x01UL << GIMA_EVENTROUTER_13_IN_SYNCH_Pos)            /*!< GIMA EVENTROUTER_13_IN: SYNCH Mask      */
#define GIMA_EVENTROUTER_13_IN_PULSE_Pos      3                                                       /*!< GIMA EVENTROUTER_13_IN: PULSE Position  */
#define GIMA_EVENTROUTER_13_IN_PULSE_Msk      (0x01UL << GIMA_EVENTROUTER_13_IN_PULSE_Pos)            /*!< GIMA EVENTROUTER_13_IN: PULSE Mask      */
#define GIMA_EVENTROUTER_13_IN_SELECT_Pos     4                                                       /*!< GIMA EVENTROUTER_13_IN: SELECT Position */
#define GIMA_EVENTROUTER_13_IN_SELECT_Msk     (0x0fUL << GIMA_EVENTROUTER_13_IN_SELECT_Pos)           /*!< GIMA EVENTROUTER_13_IN: SELECT Mask     */

/* ---------------------------  GIMA_EVENTROUTER_14_IN  --------------------------- */
#define GIMA_EVENTROUTER_14_IN_INV_Pos        0                                                       /*!< GIMA EVENTROUTER_14_IN: INV Position    */
#define GIMA_EVENTROUTER_14_IN_INV_Msk        (0x01UL << GIMA_EVENTROUTER_14_IN_INV_Pos)              /*!< GIMA EVENTROUTER_14_IN: INV Mask        */
#define GIMA_EVENTROUTER_14_IN_EDGE_Pos       1                                                       /*!< GIMA EVENTROUTER_14_IN: EDGE Position   */
#define GIMA_EVENTROUTER_14_IN_EDGE_Msk       (0x01UL << GIMA_EVENTROUTER_14_IN_EDGE_Pos)             /*!< GIMA EVENTROUTER_14_IN: EDGE Mask       */
#define GIMA_EVENTROUTER_14_IN_SYNCH_Pos      2                                                       /*!< GIMA EVENTROUTER_14_IN: SYNCH Position  */
#define GIMA_EVENTROUTER_14_IN_SYNCH_Msk      (0x01UL << GIMA_EVENTROUTER_14_IN_SYNCH_Pos)            /*!< GIMA EVENTROUTER_14_IN: SYNCH Mask      */
#define GIMA_EVENTROUTER_14_IN_PULSE_Pos      3                                                       /*!< GIMA EVENTROUTER_14_IN: PULSE Position  */
#define GIMA_EVENTROUTER_14_IN_PULSE_Msk      (0x01UL << GIMA_EVENTROUTER_14_IN_PULSE_Pos)            /*!< GIMA EVENTROUTER_14_IN: PULSE Mask      */
#define GIMA_EVENTROUTER_14_IN_SELECT_Pos     4                                                       /*!< GIMA EVENTROUTER_14_IN: SELECT Position */
#define GIMA_EVENTROUTER_14_IN_SELECT_Msk     (0x0fUL << GIMA_EVENTROUTER_14_IN_SELECT_Pos)           /*!< GIMA EVENTROUTER_14_IN: SELECT Mask     */

/* ---------------------------  GIMA_EVENTROUTER_16_IN  --------------------------- */
#define GIMA_EVENTROUTER_16_IN_INV_Pos        0                                                       /*!< GIMA EVENTROUTER_16_IN: INV Position    */
#define GIMA_EVENTROUTER_16_IN_INV_Msk        (0x01UL << GIMA_EVENTROUTER_16_IN_INV_Pos)              /*!< GIMA EVENTROUTER_16_IN: INV Mask        */
#define GIMA_EVENTROUTER_16_IN_EDGE_Pos       1                                                       /*!< GIMA EVENTROUTER_16_IN: EDGE Position   */
#define GIMA_EVENTROUTER_16_IN_EDGE_Msk       (0x01UL << GIMA_EVENTROUTER_16_IN_EDGE_Pos)             /*!< GIMA EVENTROUTER_16_IN: EDGE Mask       */
#define GIMA_EVENTROUTER_16_IN_SYNCH_Pos      2                                                       /*!< GIMA EVENTROUTER_16_IN: SYNCH Position  */
#define GIMA_EVENTROUTER_16_IN_SYNCH_Msk      (0x01UL << GIMA_EVENTROUTER_16_IN_SYNCH_Pos)            /*!< GIMA EVENTROUTER_16_IN: SYNCH Mask      */
#define GIMA_EVENTROUTER_16_IN_PULSE_Pos      3                                                       /*!< GIMA EVENTROUTER_16_IN: PULSE Position  */
#define GIMA_EVENTROUTER_16_IN_PULSE_Msk      (0x01UL << GIMA_EVENTROUTER_16_IN_PULSE_Pos)            /*!< GIMA EVENTROUTER_16_IN: PULSE Mask      */
#define GIMA_EVENTROUTER_16_IN_SELECT_Pos     4                                                       /*!< GIMA EVENTROUTER_16_IN: SELECT Position */
#define GIMA_EVENTROUTER_16_IN_SELECT_Msk     (0x0fUL << GIMA_EVENTROUTER_16_IN_SELECT_Pos)           /*!< GIMA EVENTROUTER_16_IN: SELECT Mask     */

/* ------------------------------  GIMA_ADCSTART0_IN  ----------------------------- */
#define GIMA_ADCSTART0_IN_INV_Pos             0                                                       /*!< GIMA ADCSTART0_IN: INV Position         */
#define GIMA_ADCSTART0_IN_INV_Msk             (0x01UL << GIMA_ADCSTART0_IN_INV_Pos)                   /*!< GIMA ADCSTART0_IN: INV Mask             */
#define GIMA_ADCSTART0_IN_EDGE_Pos            1                                                       /*!< GIMA ADCSTART0_IN: EDGE Position        */
#define GIMA_ADCSTART0_IN_EDGE_Msk            (0x01UL << GIMA_ADCSTART0_IN_EDGE_Pos)                  /*!< GIMA ADCSTART0_IN: EDGE Mask            */
#define GIMA_ADCSTART0_IN_SYNCH_Pos           2                                                       /*!< GIMA ADCSTART0_IN: SYNCH Position       */
#define GIMA_ADCSTART0_IN_SYNCH_Msk           (0x01UL << GIMA_ADCSTART0_IN_SYNCH_Pos)                 /*!< GIMA ADCSTART0_IN: SYNCH Mask           */
#define GIMA_ADCSTART0_IN_PULSE_Pos           3                                                       /*!< GIMA ADCSTART0_IN: PULSE Position       */
#define GIMA_ADCSTART0_IN_PULSE_Msk           (0x01UL << GIMA_ADCSTART0_IN_PULSE_Pos)                 /*!< GIMA ADCSTART0_IN: PULSE Mask           */
#define GIMA_ADCSTART0_IN_SELECT_Pos          4                                                       /*!< GIMA ADCSTART0_IN: SELECT Position      */
#define GIMA_ADCSTART0_IN_SELECT_Msk          (0x0fUL << GIMA_ADCSTART0_IN_SELECT_Pos)                /*!< GIMA ADCSTART0_IN: SELECT Mask          */

/* ------------------------------  GIMA_ADCSTART1_IN  ----------------------------- */
#define GIMA_ADCSTART1_IN_INV_Pos             0                                                       /*!< GIMA ADCSTART1_IN: INV Position         */
#define GIMA_ADCSTART1_IN_INV_Msk             (0x01UL << GIMA_ADCSTART1_IN_INV_Pos)                   /*!< GIMA ADCSTART1_IN: INV Mask             */
#define GIMA_ADCSTART1_IN_EDGE_Pos            1                                                       /*!< GIMA ADCSTART1_IN: EDGE Position        */
#define GIMA_ADCSTART1_IN_EDGE_Msk            (0x01UL << GIMA_ADCSTART1_IN_EDGE_Pos)                  /*!< GIMA ADCSTART1_IN: EDGE Mask            */
#define GIMA_ADCSTART1_IN_SYNCH_Pos           2                                                       /*!< GIMA ADCSTART1_IN: SYNCH Position       */
#define GIMA_ADCSTART1_IN_SYNCH_Msk           (0x01UL << GIMA_ADCSTART1_IN_SYNCH_Pos)                 /*!< GIMA ADCSTART1_IN: SYNCH Mask           */
#define GIMA_ADCSTART1_IN_PULSE_Pos           3                                                       /*!< GIMA ADCSTART1_IN: PULSE Position       */
#define GIMA_ADCSTART1_IN_PULSE_Msk           (0x01UL << GIMA_ADCSTART1_IN_PULSE_Pos)                 /*!< GIMA ADCSTART1_IN: PULSE Mask           */
#define GIMA_ADCSTART1_IN_SELECT_Pos          4                                                       /*!< GIMA ADCSTART1_IN: SELECT Position      */
#define GIMA_ADCSTART1_IN_SELECT_Msk          (0x0fUL << GIMA_ADCSTART1_IN_SELECT_Pos)                /*!< GIMA ADCSTART1_IN: SELECT Mask          */


/* ================================================================================ */
/* ================          struct 'DAC' Position & Mask          ================ */
/* ================================================================================ */


