roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------------  DAC_CR  ----------------------------------- */
#define DAC_CR_VALUE_Pos                      6                                                       /*!< DAC CR: VALUE Position                  */
#define DAC_CR_VALUE_Msk                      (0x000003ffUL << DAC_CR_VALUE_Pos)                      /*!< DAC CR: VALUE Mask                      */
#define DAC_CR_BIAS_Pos                       16                                                      /*!< DAC CR: BIAS Position                   */
#define DAC_CR_BIAS_Msk                       (0x01UL << DAC_CR_BIAS_Pos)                             /*!< DAC CR: BIAS Mask                       */

/* ----------------------------------  DAC_CTRL  ---------------------------------- */
#define DAC_CTRL_INT_DMA_REQ_Pos              0                                                       /*!< DAC CTRL: INT_DMA_REQ Position          */
#define DAC_CTRL_INT_DMA_REQ_Msk              (0x01UL << DAC_CTRL_INT_DMA_REQ_Pos)                    /*!< DAC CTRL: INT_DMA_REQ Mask              */
#define DAC_CTRL_DBLBUF_ENA_Pos               1                                                       /*!< DAC CTRL: DBLBUF_ENA Position           */
#define DAC_CTRL_DBLBUF_ENA_Msk               (0x01UL << DAC_CTRL_DBLBUF_ENA_Pos)                     /*!< DAC CTRL: DBLBUF_ENA Mask               */
#define DAC_CTRL_CNT_ENA_Pos                  2                                                       /*!< DAC CTRL: CNT_ENA Position              */
#define DAC_CTRL_CNT_ENA_Msk                  (0x01UL << DAC_CTRL_CNT_ENA_Pos)                        /*!< DAC CTRL: CNT_ENA Mask                  */
#define DAC_CTRL_DMA_ENA_Pos                  3                                                       /*!< DAC CTRL: DMA_ENA Position              */
#define DAC_CTRL_DMA_ENA_Msk                  (0x01UL << DAC_CTRL_DMA_ENA_Pos)                        /*!< DAC CTRL: DMA_ENA Mask                  */

/* ---------------------------------  DAC_CNTVAL  --------------------------------- */
#define DAC_CNTVAL_VALUE_Pos                  0                                                       /*!< DAC CNTVAL: VALUE Position              */
#define DAC_CNTVAL_VALUE_Msk                  (0x0000ffffUL << DAC_CNTVAL_VALUE_Pos)                  /*!< DAC CNTVAL: VALUE Mask                  */


/* ================================================================================ */
/* ================         struct 'C_CAN0' Position & Mask        ================ */
/* ================================================================================ */


/* ---------------------------------  C_CAN0_CNTL  -------------------------------- */
#define C_CAN0_CNTL_INIT_Pos                  0                                                       /*!< C_CAN0 CNTL: INIT Position              */
#define C_CAN0_CNTL_INIT_Msk                  (0x01UL << C_CAN0_CNTL_INIT_Pos)                        /*!< C_CAN0 CNTL: INIT Mask                  */
#define C_CAN0_CNTL_IE_Pos                    1                                                       /*!< C_CAN0 CNTL: IE Position                */
#define C_CAN0_CNTL_IE_Msk                    (0x01UL << C_CAN0_CNTL_IE_Pos)                          /*!< C_CAN0 CNTL: IE Mask                    */
#define C_CAN0_CNTL_SIE_Pos                   2                                                       /*!< C_CAN0 CNTL: SIE Position               */
#define C_CAN0_CNTL_SIE_Msk                   (0x01UL << C_CAN0_CNTL_SIE_Pos)                         /*!< C_CAN0 CNTL: SIE Mask                   */
#define C_CAN0_CNTL_EIE_Pos                   3                                                       /*!< C_CAN0 CNTL: EIE Position               */
#define C_CAN0_CNTL_EIE_Msk                   (0x01UL << C_CAN0_CNTL_EIE_Pos)                         /*!< C_CAN0 CNTL: EIE Mask                   */
#define C_CAN0_CNTL_DAR_Pos                   5                                                       /*!< C_CAN0 CNTL: DAR Position               */
#define C_CAN0_CNTL_DAR_Msk                   (0x01UL << C_CAN0_CNTL_DAR_Pos)                         /*!< C_CAN0 CNTL: DAR Mask                   */
#define C_CAN0_CNTL_CCE_Pos                   6                                                       /*!< C_CAN0 CNTL: CCE Position               */
#define C_CAN0_CNTL_CCE_Msk                   (0x01UL << C_CAN0_CNTL_CCE_Pos)                         /*!< C_CAN0 CNTL: CCE Mask                   */
#define C_CAN0_CNTL_TEST_Pos                  7                                                       /*!< C_CAN0 CNTL: TEST Position              */
#define C_CAN0_CNTL_TEST_Msk                  (0x01UL << C_CAN0_CNTL_TEST_Pos)                        /*!< C_CAN0 CNTL: TEST Mask                  */

/* ---------------------------------  C_CAN0_STAT  -------------------------------- */
#define C_CAN0_STAT_LEC_Pos                   0                                                       /*!< C_CAN0 STAT: LEC Position               */
#define C_CAN0_STAT_LEC_Msk                   (0x07UL << C_CAN0_STAT_LEC_Pos)                         /*!< C_CAN0 STAT: LEC Mask                   */
#define C_CAN0_STAT_TXOK_Pos                  3                                                       /*!< C_CAN0 STAT: TXOK Position              */
#define C_CAN0_STAT_TXOK_Msk                  (0x01UL << C_CAN0_STAT_TXOK_Pos)                        /*!< C_CAN0 STAT: TXOK Mask                  */
#define C_CAN0_STAT_RXOK_Pos                  4                                                       /*!< C_CAN0 STAT: RXOK Position              */
#define C_CAN0_STAT_RXOK_Msk                  (0x01UL << C_CAN0_STAT_RXOK_Pos)                        /*!< C_CAN0 STAT: RXOK Mask                  */
#define C_CAN0_STAT_EPASS_Pos                 5                                                       /*!< C_CAN0 STAT: EPASS Position             */
#define C_CAN0_STAT_EPASS_Msk                 (0x01UL << C_CAN0_STAT_EPASS_Pos)                       /*!< C_CAN0 STAT: EPASS Mask                 */
#define C_CAN0_STAT_EWARN_Pos                 6                                                       /*!< C_CAN0 STAT: EWARN Position             */
#define C_CAN0_STAT_EWARN_Msk                 (0x01UL << C_CAN0_STAT_EWARN_Pos)                       /*!< C_CAN0 STAT: EWARN Mask                 */
#define C_CAN0_STAT_BOFF_Pos                  7                                                       /*!< C_CAN0 STAT: BOFF Position              */
#define C_CAN0_STAT_BOFF_Msk                  (0x01UL << C_CAN0_STAT_BOFF_Pos)                        /*!< C_CAN0 STAT: BOFF Mask                  */

/* ----------------------------------  C_CAN0_EC  --------------------------------- */
#define C_CAN0_EC_TEC_7_0_Pos                 0                                                       /*!< C_CAN0 EC: TEC_7_0 Position             */
#define C_CAN0_EC_TEC_7_0_Msk                 (0x000000ffUL << C_CAN0_EC_TEC_7_0_Pos)                 /*!< C_CAN0 EC: TEC_7_0 Mask                 */
#define C_CAN0_EC_REC_6_0_Pos                 8                                                       /*!< C_CAN0 EC: REC_6_0 Position             */
#define C_CAN0_EC_REC_6_0_Msk                 (0x7fUL << C_CAN0_EC_REC_6_0_Pos)                       /*!< C_CAN0 EC: REC_6_0 Mask                 */
#define C_CAN0_EC_RP_Pos                      15                                                      /*!< C_CAN0 EC: RP Position                  */
#define C_CAN0_EC_RP_Msk                      (0x01UL << C_CAN0_EC_RP_Pos)                            /*!< C_CAN0 EC: RP Mask                      */

