roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  ADC0_INTEN  --------------------------------- */
#define ADC0_INTEN_ADINTEN_Pos                0                                                       /*!< ADC0 INTEN: ADINTEN Position            */
#define ADC0_INTEN_ADINTEN_Msk                (0x000000ffUL << ADC0_INTEN_ADINTEN_Pos)                /*!< ADC0 INTEN: ADINTEN Mask                */
#define ADC0_INTEN_ADGINTEN_Pos               8                                                       /*!< ADC0 INTEN: ADGINTEN Position           */
#define ADC0_INTEN_ADGINTEN_Msk               (0x01UL << ADC0_INTEN_ADGINTEN_Pos)                     /*!< ADC0 INTEN: ADGINTEN Mask               */

/* -----------------------------------  ADC0_DR  ---------------------------------- */
#define ADC0_DR_V_VREF_Pos                    6                                                       /*!< ADC0 DR: V_VREF Position                */
#define ADC0_DR_V_VREF_Msk                    (0x000003ffUL << ADC0_DR_V_VREF_Pos)                    /*!< ADC0 DR: V_VREF Mask                    */
#define ADC0_DR_OVERRUN_Pos                   30                                                      /*!< ADC0 DR: OVERRUN Position               */
#define ADC0_DR_OVERRUN_Msk                   (0x01UL << ADC0_DR_OVERRUN_Pos)                         /*!< ADC0 DR: OVERRUN Mask                   */
#define ADC0_DR_DONE_Pos                      31                                                      /*!< ADC0 DR: DONE Position                  */
#define ADC0_DR_DONE_Msk                      (0x01UL << ADC0_DR_DONE_Pos)                            /*!< ADC0 DR: DONE Mask                      */

/* ----------------------------------  ADC0_STAT  --------------------------------- */
#define ADC0_STAT_DONE_Pos                    0                                                       /*!< ADC0 STAT: DONE Position                */
#define ADC0_STAT_DONE_Msk                    (0x000000ffUL << ADC0_STAT_DONE_Pos)                    /*!< ADC0 STAT: DONE Mask                    */
#define ADC0_STAT_OVERUN_Pos                  8                                                       /*!< ADC0 STAT: OVERUN Position              */
#define ADC0_STAT_OVERUN_Msk                  (0x000000ffUL << ADC0_STAT_OVERUN_Pos)                  /*!< ADC0 STAT: OVERUN Mask                  */
#define ADC0_STAT_ADINT_Pos                   16                                                      /*!< ADC0 STAT: ADINT Position               */
#define ADC0_STAT_ADINT_Msk                   (0x01UL << ADC0_STAT_ADINT_Pos)                         /*!< ADC0 STAT: ADINT Mask                   */


/* ================================================================================ */
/* ================          struct 'ADC1' Position & Mask         ================ */
/* ================================================================================ */


/* -----------------------------------  ADC1_CR  ---------------------------------- */
#define ADC1_CR_SEL_Pos                       0                                                       /*!< ADC1 CR: SEL Position                   */
#define ADC1_CR_SEL_Msk                       (0x000000ffUL << ADC1_CR_SEL_Pos)                       /*!< ADC1 CR: SEL Mask                       */
#define ADC1_CR_CLKDIV_Pos                    8                                                       /*!< ADC1 CR: CLKDIV Position                */
#define ADC1_CR_CLKDIV_Msk                    (0x000000ffUL << ADC1_CR_CLKDIV_Pos)                    /*!< ADC1 CR: CLKDIV Mask                    */
#define ADC1_CR_BURST_Pos                     16                                                      /*!< ADC1 CR: BURST Position                 */
#define ADC1_CR_BURST_Msk                     (0x01UL << ADC1_CR_BURST_Pos)                           /*!< ADC1 CR: BURST Mask                     */
#define ADC1_CR_CLKS_Pos                      17                                                      /*!< ADC1 CR: CLKS Position                  */
#define ADC1_CR_CLKS_Msk                      (0x07UL << ADC1_CR_CLKS_Pos)                            /*!< ADC1 CR: CLKS Mask                      */
#define ADC1_CR_PDN_Pos                       21                                                      /*!< ADC1 CR: PDN Position                   */
#define ADC1_CR_PDN_Msk                       (0x01UL << ADC1_CR_PDN_Pos)                             /*!< ADC1 CR: PDN Mask                       */
#define ADC1_CR_START_Pos                     24                                                      /*!< ADC1 CR: START Position                 */
#define ADC1_CR_START_Msk                     (0x07UL << ADC1_CR_START_Pos)                           /*!< ADC1 CR: START Mask                     */
#define ADC1_CR_EDGE_Pos                      27                                                      /*!< ADC1 CR: EDGE Position                  */
#define ADC1_CR_EDGE_Msk                      (0x01UL << ADC1_CR_EDGE_Pos)                            /*!< ADC1 CR: EDGE Mask                      */

/* ----------------------------------  ADC1_GDR  ---------------------------------- */
#define ADC1_GDR_V_VREF_Pos                   6                                                       /*!< ADC1 GDR: V_VREF Position               */
#define ADC1_GDR_V_VREF_Msk                   (0x000003ffUL << ADC1_GDR_V_VREF_Pos)                   /*!< ADC1 GDR: V_VREF Mask                   */
#define ADC1_GDR_CHN_Pos                      24                                                      /*!< ADC1 GDR: CHN Position                  */
#define ADC1_GDR_CHN_Msk                      (0x07UL << ADC1_GDR_CHN_Pos)                            /*!< ADC1 GDR: CHN Mask                      */
#define ADC1_GDR_OVERRUN_Pos                  30                                                      /*!< ADC1 GDR: OVERRUN Position              */
#define ADC1_GDR_OVERRUN_Msk                  (0x01UL << ADC1_GDR_OVERRUN_Pos)                        /*!< ADC1 GDR: OVERRUN Mask                  */
#define ADC1_GDR_DONE_Pos                     31                                                      /*!< ADC1 GDR: DONE Position                 */
#define ADC1_GDR_DONE_Msk                     (0x01UL << ADC1_GDR_DONE_Pos)                           /*!< ADC1 GDR: DONE Mask                     */

