roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ---------------------------------  ADC1_INTEN  --------------------------------- */
#define ADC1_INTEN_ADINTEN_Pos                0                                                       /*!< ADC1 INTEN: ADINTEN Position            */
#define ADC1_INTEN_ADINTEN_Msk                (0x000000ffUL << ADC1_INTEN_ADINTEN_Pos)                /*!< ADC1 INTEN: ADINTEN Mask                */
#define ADC1_INTEN_ADGINTEN_Pos               8                                                       /*!< ADC1 INTEN: ADGINTEN Position           */
#define ADC1_INTEN_ADGINTEN_Msk               (0x01UL << ADC1_INTEN_ADGINTEN_Pos)                     /*!< ADC1 INTEN: ADGINTEN Mask               */

/* -----------------------------------  ADC1_DR  ---------------------------------- */
#define ADC1_DR_V_VREF_Pos                    6                                                       /*!< ADC1 DR: V_VREF Position                */
#define ADC1_DR_V_VREF_Msk                    (0x000003ffUL << ADC1_DR_V_VREF_Pos)                    /*!< ADC1 DR: V_VREF Mask                    */
#define ADC1_DR_OVERRUN_Pos                   30                                                      /*!< ADC1 DR: OVERRUN Position               */
#define ADC1_DR_OVERRUN_Msk                   (0x01UL << ADC1_DR_OVERRUN_Pos)                         /*!< ADC1 DR: OVERRUN Mask                   */
#define ADC1_DR_DONE_Pos                      31                                                      /*!< ADC1 DR: DONE Position                  */
#define ADC1_DR_DONE_Msk                      (0x01UL << ADC1_DR_DONE_Pos)                            /*!< ADC1 DR: DONE Mask                      */

/* ----------------------------------  ADC1_STAT  --------------------------------- */
#define ADC1_STAT_DONE_Pos                    0                                                       /*!< ADC1 STAT: DONE Position                */
#define ADC1_STAT_DONE_Msk                    (0x000000ffUL << ADC1_STAT_DONE_Pos)                    /*!< ADC1 STAT: DONE Mask                    */
#define ADC1_STAT_OVERUN_Pos                  8                                                       /*!< ADC1 STAT: OVERUN Position              */
#define ADC1_STAT_OVERUN_Msk                  (0x000000ffUL << ADC1_STAT_OVERUN_Pos)                  /*!< ADC1 STAT: OVERUN Mask                  */
#define ADC1_STAT_ADINT_Pos                   16                                                      /*!< ADC1 STAT: ADINT Position               */
#define ADC1_STAT_ADINT_Msk                   (0x01UL << ADC1_STAT_ADINT_Pos)                         /*!< ADC1 STAT: ADINT Mask                   */


/* ================================================================================ */
/* ================         struct 'ADCHS' Position & Mask         ================ */
/* ================================================================================ */


/* ---------------------------------  ADCHS_FLUSH  -------------------------------- */
#define ADCHS_FLUSH_FIFO_FLUSH_Pos            0                                                       /*!< ADCHS FLUSH: FIFO_FLUSH Position        */
#define ADCHS_FLUSH_FIFO_FLUSH_Msk            (0x01UL << ADCHS_FLUSH_FIFO_FLUSH_Pos)                  /*!< ADCHS FLUSH: FIFO_FLUSH Mask            */

/* --------------------------------  ADCHS_DMA_REQ  ------------------------------- */
#define ADCHS_DMA_REQ_DMA_REQ_WR_Pos          0                                                       /*!< ADCHS DMA_REQ: DMA_REQ_WR Position      */
#define ADCHS_DMA_REQ_DMA_REQ_WR_Msk          (0x01UL << ADCHS_DMA_REQ_DMA_REQ_WR_Pos)                /*!< ADCHS DMA_REQ: DMA_REQ_WR Mask          */

/* -------------------------------  ADCHS_FIFO_STS  ------------------------------- */
#define ADCHS_FIFO_STS_LEVEL_Pos              0                                                       /*!< ADCHS FIFO_STS: LEVEL Position          */
#define ADCHS_FIFO_STS_LEVEL_Msk              (0x1fUL << ADCHS_FIFO_STS_LEVEL_Pos)                    /*!< ADCHS FIFO_STS: LEVEL Mask              */

/* -------------------------------  ADCHS_FIFO_CFG  ------------------------------- */
#define ADCHS_FIFO_CFG_PACKED_READ_Pos        0                                                       /*!< ADCHS FIFO_CFG: PACKED_READ Position    */
#define ADCHS_FIFO_CFG_PACKED_READ_Msk        (0x01UL << ADCHS_FIFO_CFG_PACKED_READ_Pos)              /*!< ADCHS FIFO_CFG: PACKED_READ Mask        */
#define ADCHS_FIFO_CFG_LEVEL_Pos              1                                                       /*!< ADCHS FIFO_CFG: LEVEL Position          */
#define ADCHS_FIFO_CFG_LEVEL_Msk              (0x1fUL << ADCHS_FIFO_CFG_LEVEL_Pos)                    /*!< ADCHS FIFO_CFG: LEVEL Mask              */

/* --------------------------------  ADCHS_TRIGGER  ------------------------------- */
#define ADCHS_TRIGGER_SW_TRIGGER_Pos          0                                                       /*!< ADCHS TRIGGER: SW_TRIGGER Position      */
#define ADCHS_TRIGGER_SW_TRIGGER_Msk          (0x01UL << ADCHS_TRIGGER_SW_TRIGGER_Pos)                /*!< ADCHS TRIGGER: SW_TRIGGER Mask          */

/* -------------------------------  ADCHS_DSCR_STS  ------------------------------- */
#define ADCHS_DSCR_STS_ACT_TABLE_Pos          0                                                       /*!< ADCHS DSCR_STS: ACT_TABLE Position      */
#define ADCHS_DSCR_STS_ACT_TABLE_Msk          (0x01UL << ADCHS_DSCR_STS_ACT_TABLE_Pos)                /*!< ADCHS DSCR_STS: ACT_TABLE Mask          */
#define ADCHS_DSCR_STS_ACT_DESCRIPTOR_Pos     1                                                       /*!< ADCHS DSCR_STS: ACT_DESCRIPTOR Position */
#define ADCHS_DSCR_STS_ACT_DESCRIPTOR_Msk     (0x07UL << ADCHS_DSCR_STS_ACT_DESCRIPTOR_Pos)           /*!< ADCHS DSCR_STS: ACT_DESCRIPTOR Mask     */

/* ------------------------------  ADCHS_POWER_DOWN  ------------------------------ */
#define ADCHS_POWER_DOWN_PD_CTRL_Pos          0                                                       /*!< ADCHS POWER_DOWN: PD_CTRL Position      */
#define ADCHS_POWER_DOWN_PD_CTRL_Msk          (0x01UL << ADCHS_POWER_DOWN_PD_CTRL_Pos)                /*!< ADCHS POWER_DOWN: PD_CTRL Mask          */

/* --------------------------------  ADCHS_CONFIG  -------------------------------- */
#define ADCHS_CONFIG_TRIGGER__MASK_Pos        0                                                       /*!< ADCHS CONFIG: TRIGGER__MASK Position    */
#define ADCHS_CONFIG_TRIGGER__MASK_Msk        (0x03UL << ADCHS_CONFIG_TRIGGER__MASK_Pos)              /*!< ADCHS CONFIG: TRIGGER__MASK Mask        */
#define ADCHS_CONFIG_TRIGGER_MODE_Pos         2                                                       /*!< ADCHS CONFIG: TRIGGER_MODE Position     */
#define ADCHS_CONFIG_TRIGGER_MODE_Msk         (0x03UL << ADCHS_CONFIG_TRIGGER_MODE_Pos)               /*!< ADCHS CONFIG: TRIGGER_MODE Mask         */
#define ADCHS_CONFIG_TRIGGER_SYNC_Pos         4                                                       /*!< ADCHS CONFIG: TRIGGER_SYNC Position     */
#define ADCHS_CONFIG_TRIGGER_SYNC_Msk         (0x01UL << ADCHS_CONFIG_TRIGGER_SYNC_Pos)               /*!< ADCHS CONFIG: TRIGGER_SYNC Mask         */
#define ADCHS_CONFIG_CHANNEL_ID_EN_Pos        5                                                       /*!< ADCHS CONFIG: CHANNEL_ID_EN Position    */
#define ADCHS_CONFIG_CHANNEL_ID_EN_Msk        (0x01UL << ADCHS_CONFIG_CHANNEL_ID_EN_Pos)              /*!< ADCHS CONFIG: CHANNEL_ID_EN Mask        */
#define ADCHS_CONFIG_RECOVERY_TIME_Pos        6                                                       /*!< ADCHS CONFIG: RECOVERY_TIME Position    */
#define ADCHS_CONFIG_RECOVERY_TIME_Msk        (0x000000ffUL << ADCHS_CONFIG_RECOVERY_TIME_Pos)        /*!< ADCHS CONFIG: RECOVERY_TIME Mask        */

/* ---------------------------------  ADCHS_THR_A  -------------------------------- */
#define ADCHS_THR_A_THR_LOW_A_Pos             0                                                       /*!< ADCHS THR_A: THR_LOW_A Position         */
#define ADCHS_THR_A_THR_LOW_A_Msk             (0x00000fffUL << ADCHS_THR_A_THR_LOW_A_Pos)             /*!< ADCHS THR_A: THR_LOW_A Mask             */
#define ADCHS_THR_A_THR_HIGH_A_Pos            16                                                      /*!< ADCHS THR_A: THR_HIGH_A Position        */
#define ADCHS_THR_A_THR_HIGH_A_Msk            (0x00000fffUL << ADCHS_THR_A_THR_HIGH_A_Pos)            /*!< ADCHS THR_A: THR_HIGH_A Mask            */

