roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* --------------------------------  GPIO_PORT_DIR  ------------------------------- */
#define GPIO_PORT_DIR_DIRP0_Pos               0                                                       /*!< GPIO_PORT DIR: DIRP0 Position           */
#define GPIO_PORT_DIR_DIRP0_Msk               (0x01UL << GPIO_PORT_DIR_DIRP0_Pos)                     /*!< GPIO_PORT DIR: DIRP0 Mask               */
#define GPIO_PORT_DIR_DIRP1_Pos               1                                                       /*!< GPIO_PORT DIR: DIRP1 Position           */
#define GPIO_PORT_DIR_DIRP1_Msk               (0x01UL << GPIO_PORT_DIR_DIRP1_Pos)                     /*!< GPIO_PORT DIR: DIRP1 Mask               */
#define GPIO_PORT_DIR_DIRP2_Pos               2                                                       /*!< GPIO_PORT DIR: DIRP2 Position           */
#define GPIO_PORT_DIR_DIRP2_Msk               (0x01UL << GPIO_PORT_DIR_DIRP2_Pos)                     /*!< GPIO_PORT DIR: DIRP2 Mask               */
#define GPIO_PORT_DIR_DIRP3_Pos               3                                                       /*!< GPIO_PORT DIR: DIRP3 Position           */
#define GPIO_PORT_DIR_DIRP3_Msk               (0x01UL << GPIO_PORT_DIR_DIRP3_Pos)                     /*!< GPIO_PORT DIR: DIRP3 Mask               */
#define GPIO_PORT_DIR_DIRP4_Pos               4                                                       /*!< GPIO_PORT DIR: DIRP4 Position           */
#define GPIO_PORT_DIR_DIRP4_Msk               (0x01UL << GPIO_PORT_DIR_DIRP4_Pos)                     /*!< GPIO_PORT DIR: DIRP4 Mask               */
#define GPIO_PORT_DIR_DIRP5_Pos               5                                                       /*!< GPIO_PORT DIR: DIRP5 Position           */
#define GPIO_PORT_DIR_DIRP5_Msk               (0x01UL << GPIO_PORT_DIR_DIRP5_Pos)                     /*!< GPIO_PORT DIR: DIRP5 Mask               */
#define GPIO_PORT_DIR_DIRP6_Pos               6                                                       /*!< GPIO_PORT DIR: DIRP6 Position           */
#define GPIO_PORT_DIR_DIRP6_Msk               (0x01UL << GPIO_PORT_DIR_DIRP6_Pos)                     /*!< GPIO_PORT DIR: DIRP6 Mask               */
#define GPIO_PORT_DIR_DIRP7_Pos               7                                                       /*!< GPIO_PORT DIR: DIRP7 Position           */
#define GPIO_PORT_DIR_DIRP7_Msk               (0x01UL << GPIO_PORT_DIR_DIRP7_Pos)                     /*!< GPIO_PORT DIR: DIRP7 Mask               */
#define GPIO_PORT_DIR_DIRP8_Pos               8                                                       /*!< GPIO_PORT DIR: DIRP8 Position           */
#define GPIO_PORT_DIR_DIRP8_Msk               (0x01UL << GPIO_PORT_DIR_DIRP8_Pos)                     /*!< GPIO_PORT DIR: DIRP8 Mask               */
#define GPIO_PORT_DIR_DIRP9_Pos               9                                                       /*!< GPIO_PORT DIR: DIRP9 Position           */
#define GPIO_PORT_DIR_DIRP9_Msk               (0x01UL << GPIO_PORT_DIR_DIRP9_Pos)                     /*!< GPIO_PORT DIR: DIRP9 Mask               */
#define GPIO_PORT_DIR_DIRP10_Pos              10                                                      /*!< GPIO_PORT DIR: DIRP10 Position          */
#define GPIO_PORT_DIR_DIRP10_Msk              (0x01UL << GPIO_PORT_DIR_DIRP10_Pos)                    /*!< GPIO_PORT DIR: DIRP10 Mask              */
#define GPIO_PORT_DIR_DIRP11_Pos              11                                                      /*!< GPIO_PORT DIR: DIRP11 Position          */
#define GPIO_PORT_DIR_DIRP11_Msk              (0x01UL << GPIO_PORT_DIR_DIRP11_Pos)                    /*!< GPIO_PORT DIR: DIRP11 Mask              */
#define GPIO_PORT_DIR_DIRP12_Pos              12                                                      /*!< GPIO_PORT DIR: DIRP12 Position          */
#define GPIO_PORT_DIR_DIRP12_Msk              (0x01UL << GPIO_PORT_DIR_DIRP12_Pos)                    /*!< GPIO_PORT DIR: DIRP12 Mask              */
#define GPIO_PORT_DIR_DIRP13_Pos              13                                                      /*!< GPIO_PORT DIR: DIRP13 Position          */
#define GPIO_PORT_DIR_DIRP13_Msk              (0x01UL << GPIO_PORT_DIR_DIRP13_Pos)                    /*!< GPIO_PORT DIR: DIRP13 Mask              */
#define GPIO_PORT_DIR_DIRP14_Pos              14                                                      /*!< GPIO_PORT DIR: DIRP14 Position          */
#define GPIO_PORT_DIR_DIRP14_Msk              (0x01UL << GPIO_PORT_DIR_DIRP14_Pos)                    /*!< GPIO_PORT DIR: DIRP14 Mask              */
#define GPIO_PORT_DIR_DIRP15_Pos              15                                                      /*!< GPIO_PORT DIR: DIRP15 Position          */
#define GPIO_PORT_DIR_DIRP15_Msk              (0x01UL << GPIO_PORT_DIR_DIRP15_Pos)                    /*!< GPIO_PORT DIR: DIRP15 Mask              */
#define GPIO_PORT_DIR_DIRP16_Pos              16                                                      /*!< GPIO_PORT DIR: DIRP16 Position          */
#define GPIO_PORT_DIR_DIRP16_Msk              (0x01UL << GPIO_PORT_DIR_DIRP16_Pos)                    /*!< GPIO_PORT DIR: DIRP16 Mask              */
#define GPIO_PORT_DIR_DIRP17_Pos              17                                                      /*!< GPIO_PORT DIR: DIRP17 Position          */
#define GPIO_PORT_DIR_DIRP17_Msk              (0x01UL << GPIO_PORT_DIR_DIRP17_Pos)                    /*!< GPIO_PORT DIR: DIRP17 Mask              */
#define GPIO_PORT_DIR_DIRP18_Pos              18                                                      /*!< GPIO_PORT DIR: DIRP18 Position          */
#define GPIO_PORT_DIR_DIRP18_Msk              (0x01UL << GPIO_PORT_DIR_DIRP18_Pos)                    /*!< GPIO_PORT DIR: DIRP18 Mask              */
#define GPIO_PORT_DIR_DIRP19_Pos              19                                                      /*!< GPIO_PORT DIR: DIRP19 Position          */
#define GPIO_PORT_DIR_DIRP19_Msk              (0x01UL << GPIO_PORT_DIR_DIRP19_Pos)                    /*!< GPIO_PORT DIR: DIRP19 Mask              */
#define GPIO_PORT_DIR_DIRP20_Pos              20                                                      /*!< GPIO_PORT DIR: DIRP20 Position          */
#define GPIO_PORT_DIR_DIRP20_Msk              (0x01UL << GPIO_PORT_DIR_DIRP20_Pos)                    /*!< GPIO_PORT DIR: DIRP20 Mask              */
#define GPIO_PORT_DIR_DIRP21_Pos              21                                                      /*!< GPIO_PORT DIR: DIRP21 Position          */
#define GPIO_PORT_DIR_DIRP21_Msk              (0x01UL << GPIO_PORT_DIR_DIRP21_Pos)                    /*!< GPIO_PORT DIR: DIRP21 Mask              */
#define GPIO_PORT_DIR_DIRP22_Pos              22                                                      /*!< GPIO_PORT DIR: DIRP22 Position          */
#define GPIO_PORT_DIR_DIRP22_Msk              (0x01UL << GPIO_PORT_DIR_DIRP22_Pos)                    /*!< GPIO_PORT DIR: DIRP22 Mask              */
#define GPIO_PORT_DIR_DIRP23_Pos              23                                                      /*!< GPIO_PORT DIR: DIRP23 Position          */
#define GPIO_PORT_DIR_DIRP23_Msk              (0x01UL << GPIO_PORT_DIR_DIRP23_Pos)                    /*!< GPIO_PORT DIR: DIRP23 Mask              */
#define GPIO_PORT_DIR_DIRP24_Pos              24                                                      /*!< GPIO_PORT DIR: DIRP24 Position          */
#define GPIO_PORT_DIR_DIRP24_Msk              (0x01UL << GPIO_PORT_DIR_DIRP24_Pos)                    /*!< GPIO_PORT DIR: DIRP24 Mask              */
#define GPIO_PORT_DIR_DIRP25_Pos              25                                                      /*!< GPIO_PORT DIR: DIRP25 Position          */
#define GPIO_PORT_DIR_DIRP25_Msk              (0x01UL << GPIO_PORT_DIR_DIRP25_Pos)                    /*!< GPIO_PORT DIR: DIRP25 Mask              */
#define GPIO_PORT_DIR_DIRP26_Pos              26                                                      /*!< GPIO_PORT DIR: DIRP26 Position          */
#define GPIO_PORT_DIR_DIRP26_Msk              (0x01UL << GPIO_PORT_DIR_DIRP26_Pos)                    /*!< GPIO_PORT DIR: DIRP26 Mask              */
#define GPIO_PORT_DIR_DIRP27_Pos              27                                                      /*!< GPIO_PORT DIR: DIRP27 Position          */
#define GPIO_PORT_DIR_DIRP27_Msk              (0x01UL << GPIO_PORT_DIR_DIRP27_Pos)                    /*!< GPIO_PORT DIR: DIRP27 Mask              */
#define GPIO_PORT_DIR_DIRP28_Pos              28                                                      /*!< GPIO_PORT DIR: DIRP28 Position          */
#define GPIO_PORT_DIR_DIRP28_Msk              (0x01UL << GPIO_PORT_DIR_DIRP28_Pos)                    /*!< GPIO_PORT DIR: DIRP28 Mask              */
#define GPIO_PORT_DIR_DIRP29_Pos              29                                                      /*!< GPIO_PORT DIR: DIRP29 Position          */
#define GPIO_PORT_DIR_DIRP29_Msk              (0x01UL << GPIO_PORT_DIR_DIRP29_Pos)                    /*!< GPIO_PORT DIR: DIRP29 Mask              */
#define GPIO_PORT_DIR_DIRP30_Pos              30                                                      /*!< GPIO_PORT DIR: DIRP30 Position          */
#define GPIO_PORT_DIR_DIRP30_Msk              (0x01UL << GPIO_PORT_DIR_DIRP30_Pos)                    /*!< GPIO_PORT DIR: DIRP30 Mask              */
#define GPIO_PORT_DIR_DIRP31_Pos              31                                                      /*!< GPIO_PORT DIR: DIRP31 Position          */
#define GPIO_PORT_DIR_DIRP31_Msk              (0x01UL << GPIO_PORT_DIR_DIRP31_Pos)                    /*!< GPIO_PORT DIR: DIRP31 Mask              */

