roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -------------------------------  GPIO_PORT_MPIN  ------------------------------- */
#define GPIO_PORT_MPIN_MPORTP0_Pos            0                                                       /*!< GPIO_PORT MPIN: MPORTP0 Position        */
#define GPIO_PORT_MPIN_MPORTP0_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP0_Pos)                  /*!< GPIO_PORT MPIN: MPORTP0 Mask            */
#define GPIO_PORT_MPIN_MPORTP1_Pos            1                                                       /*!< GPIO_PORT MPIN: MPORTP1 Position        */
#define GPIO_PORT_MPIN_MPORTP1_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP1_Pos)                  /*!< GPIO_PORT MPIN: MPORTP1 Mask            */
#define GPIO_PORT_MPIN_MPORTP2_Pos            2                                                       /*!< GPIO_PORT MPIN: MPORTP2 Position        */
#define GPIO_PORT_MPIN_MPORTP2_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP2_Pos)                  /*!< GPIO_PORT MPIN: MPORTP2 Mask            */
#define GPIO_PORT_MPIN_MPORTP3_Pos            3                                                       /*!< GPIO_PORT MPIN: MPORTP3 Position        */
#define GPIO_PORT_MPIN_MPORTP3_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP3_Pos)                  /*!< GPIO_PORT MPIN: MPORTP3 Mask            */
#define GPIO_PORT_MPIN_MPORTP4_Pos            4                                                       /*!< GPIO_PORT MPIN: MPORTP4 Position        */
#define GPIO_PORT_MPIN_MPORTP4_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP4_Pos)                  /*!< GPIO_PORT MPIN: MPORTP4 Mask            */
#define GPIO_PORT_MPIN_MPORTP5_Pos            5                                                       /*!< GPIO_PORT MPIN: MPORTP5 Position        */
#define GPIO_PORT_MPIN_MPORTP5_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP5_Pos)                  /*!< GPIO_PORT MPIN: MPORTP5 Mask            */
#define GPIO_PORT_MPIN_MPORTP6_Pos            6                                                       /*!< GPIO_PORT MPIN: MPORTP6 Position        */
#define GPIO_PORT_MPIN_MPORTP6_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP6_Pos)                  /*!< GPIO_PORT MPIN: MPORTP6 Mask            */
#define GPIO_PORT_MPIN_MPORTP7_Pos            7                                                       /*!< GPIO_PORT MPIN: MPORTP7 Position        */
#define GPIO_PORT_MPIN_MPORTP7_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP7_Pos)                  /*!< GPIO_PORT MPIN: MPORTP7 Mask            */
#define GPIO_PORT_MPIN_MPORTP8_Pos            8                                                       /*!< GPIO_PORT MPIN: MPORTP8 Position        */
#define GPIO_PORT_MPIN_MPORTP8_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP8_Pos)                  /*!< GPIO_PORT MPIN: MPORTP8 Mask            */
#define GPIO_PORT_MPIN_MPORTP9_Pos            9                                                       /*!< GPIO_PORT MPIN: MPORTP9 Position        */
#define GPIO_PORT_MPIN_MPORTP9_Msk            (0x01UL << GPIO_PORT_MPIN_MPORTP9_Pos)                  /*!< GPIO_PORT MPIN: MPORTP9 Mask            */
#define GPIO_PORT_MPIN_MPORTP10_Pos           10                                                      /*!< GPIO_PORT MPIN: MPORTP10 Position       */
#define GPIO_PORT_MPIN_MPORTP10_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP10_Pos)                 /*!< GPIO_PORT MPIN: MPORTP10 Mask           */
#define GPIO_PORT_MPIN_MPORTP11_Pos           11                                                      /*!< GPIO_PORT MPIN: MPORTP11 Position       */
#define GPIO_PORT_MPIN_MPORTP11_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP11_Pos)                 /*!< GPIO_PORT MPIN: MPORTP11 Mask           */
#define GPIO_PORT_MPIN_MPORTP12_Pos           12                                                      /*!< GPIO_PORT MPIN: MPORTP12 Position       */
#define GPIO_PORT_MPIN_MPORTP12_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP12_Pos)                 /*!< GPIO_PORT MPIN: MPORTP12 Mask           */
#define GPIO_PORT_MPIN_MPORTP13_Pos           13                                                      /*!< GPIO_PORT MPIN: MPORTP13 Position       */
#define GPIO_PORT_MPIN_MPORTP13_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP13_Pos)                 /*!< GPIO_PORT MPIN: MPORTP13 Mask           */
#define GPIO_PORT_MPIN_MPORTP14_Pos           14                                                      /*!< GPIO_PORT MPIN: MPORTP14 Position       */
#define GPIO_PORT_MPIN_MPORTP14_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP14_Pos)                 /*!< GPIO_PORT MPIN: MPORTP14 Mask           */
#define GPIO_PORT_MPIN_MPORTP15_Pos           15                                                      /*!< GPIO_PORT MPIN: MPORTP15 Position       */
#define GPIO_PORT_MPIN_MPORTP15_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP15_Pos)                 /*!< GPIO_PORT MPIN: MPORTP15 Mask           */
#define GPIO_PORT_MPIN_MPORTP16_Pos           16                                                      /*!< GPIO_PORT MPIN: MPORTP16 Position       */
#define GPIO_PORT_MPIN_MPORTP16_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP16_Pos)                 /*!< GPIO_PORT MPIN: MPORTP16 Mask           */
#define GPIO_PORT_MPIN_MPORTP17_Pos           17                                                      /*!< GPIO_PORT MPIN: MPORTP17 Position       */
#define GPIO_PORT_MPIN_MPORTP17_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP17_Pos)                 /*!< GPIO_PORT MPIN: MPORTP17 Mask           */
#define GPIO_PORT_MPIN_MPORTP18_Pos           18                                                      /*!< GPIO_PORT MPIN: MPORTP18 Position       */
#define GPIO_PORT_MPIN_MPORTP18_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP18_Pos)                 /*!< GPIO_PORT MPIN: MPORTP18 Mask           */
#define GPIO_PORT_MPIN_MPORTP19_Pos           19                                                      /*!< GPIO_PORT MPIN: MPORTP19 Position       */
#define GPIO_PORT_MPIN_MPORTP19_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP19_Pos)                 /*!< GPIO_PORT MPIN: MPORTP19 Mask           */
#define GPIO_PORT_MPIN_MPORTP20_Pos           20                                                      /*!< GPIO_PORT MPIN: MPORTP20 Position       */
#define GPIO_PORT_MPIN_MPORTP20_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP20_Pos)                 /*!< GPIO_PORT MPIN: MPORTP20 Mask           */
#define GPIO_PORT_MPIN_MPORTP21_Pos           21                                                      /*!< GPIO_PORT MPIN: MPORTP21 Position       */
#define GPIO_PORT_MPIN_MPORTP21_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP21_Pos)                 /*!< GPIO_PORT MPIN: MPORTP21 Mask           */
#define GPIO_PORT_MPIN_MPORTP22_Pos           22                                                      /*!< GPIO_PORT MPIN: MPORTP22 Position       */
#define GPIO_PORT_MPIN_MPORTP22_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP22_Pos)                 /*!< GPIO_PORT MPIN: MPORTP22 Mask           */
#define GPIO_PORT_MPIN_MPORTP23_Pos           23                                                      /*!< GPIO_PORT MPIN: MPORTP23 Position       */
#define GPIO_PORT_MPIN_MPORTP23_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP23_Pos)                 /*!< GPIO_PORT MPIN: MPORTP23 Mask           */
#define GPIO_PORT_MPIN_MPORTP24_Pos           24                                                      /*!< GPIO_PORT MPIN: MPORTP24 Position       */
#define GPIO_PORT_MPIN_MPORTP24_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP24_Pos)                 /*!< GPIO_PORT MPIN: MPORTP24 Mask           */
#define GPIO_PORT_MPIN_MPORTP25_Pos           25                                                      /*!< GPIO_PORT MPIN: MPORTP25 Position       */
#define GPIO_PORT_MPIN_MPORTP25_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP25_Pos)                 /*!< GPIO_PORT MPIN: MPORTP25 Mask           */
#define GPIO_PORT_MPIN_MPORTP26_Pos           26                                                      /*!< GPIO_PORT MPIN: MPORTP26 Position       */
#define GPIO_PORT_MPIN_MPORTP26_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP26_Pos)                 /*!< GPIO_PORT MPIN: MPORTP26 Mask           */
#define GPIO_PORT_MPIN_MPORTP27_Pos           27                                                      /*!< GPIO_PORT MPIN: MPORTP27 Position       */
#define GPIO_PORT_MPIN_MPORTP27_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP27_Pos)                 /*!< GPIO_PORT MPIN: MPORTP27 Mask           */
#define GPIO_PORT_MPIN_MPORTP28_Pos           28                                                      /*!< GPIO_PORT MPIN: MPORTP28 Position       */
#define GPIO_PORT_MPIN_MPORTP28_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP28_Pos)                 /*!< GPIO_PORT MPIN: MPORTP28 Mask           */
#define GPIO_PORT_MPIN_MPORTP29_Pos           29                                                      /*!< GPIO_PORT MPIN: MPORTP29 Position       */
#define GPIO_PORT_MPIN_MPORTP29_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP29_Pos)                 /*!< GPIO_PORT MPIN: MPORTP29 Mask           */
#define GPIO_PORT_MPIN_MPORTP30_Pos           30                                                      /*!< GPIO_PORT MPIN: MPORTP30 Position       */
#define GPIO_PORT_MPIN_MPORTP30_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP30_Pos)                 /*!< GPIO_PORT MPIN: MPORTP30 Mask           */
#define GPIO_PORT_MPIN_MPORTP31_Pos           31                                                      /*!< GPIO_PORT MPIN: MPORTP31 Position       */
#define GPIO_PORT_MPIN_MPORTP31_Msk           (0x01UL << GPIO_PORT_MPIN_MPORTP31_Pos)                 /*!< GPIO_PORT MPIN: MPORTP31 Mask           */

/* --------------------------------  GPIO_PORT_SET  ------------------------------- */
#define GPIO_PORT_SET_SETP0_Pos               0                                                       /*!< GPIO_PORT SET: SETP0 Position           */
#define GPIO_PORT_SET_SETP0_Msk               (0x01UL << GPIO_PORT_SET_SETP0_Pos)                     /*!< GPIO_PORT SET: SETP0 Mask               */
#define GPIO_PORT_SET_SETP1_Pos               1                                                       /*!< GPIO_PORT SET: SETP1 Position           */
#define GPIO_PORT_SET_SETP1_Msk               (0x01UL << GPIO_PORT_SET_SETP1_Pos)                     /*!< GPIO_PORT SET: SETP1 Mask               */
#define GPIO_PORT_SET_SETP2_Pos               2                                                       /*!< GPIO_PORT SET: SETP2 Position           */
#define GPIO_PORT_SET_SETP2_Msk               (0x01UL << GPIO_PORT_SET_SETP2_Pos)                     /*!< GPIO_PORT SET: SETP2 Mask               */
#define GPIO_PORT_SET_SETP3_Pos               3                                                       /*!< GPIO_PORT SET: SETP3 Position           */
#define GPIO_PORT_SET_SETP3_Msk               (0x01UL << GPIO_PORT_SET_SETP3_Pos)                     /*!< GPIO_PORT SET: SETP3 Mask               */
#define GPIO_PORT_SET_SETP4_Pos               4                                                       /*!< GPIO_PORT SET: SETP4 Position           */
#define GPIO_PORT_SET_SETP4_Msk               (0x01UL << GPIO_PORT_SET_SETP4_Pos)                     /*!< GPIO_PORT SET: SETP4 Mask               */
#define GPIO_PORT_SET_SETP5_Pos               5                                                       /*!< GPIO_PORT SET: SETP5 Position           */
#define GPIO_PORT_SET_SETP5_Msk               (0x01UL << GPIO_PORT_SET_SETP5_Pos)                     /*!< GPIO_PORT SET: SETP5 Mask               */
#define GPIO_PORT_SET_SETP6_Pos               6                                                       /*!< GPIO_PORT SET: SETP6 Position           */
#define GPIO_PORT_SET_SETP6_Msk               (0x01UL << GPIO_PORT_SET_SETP6_Pos)                     /*!< GPIO_PORT SET: SETP6 Mask               */
#define GPIO_PORT_SET_SETP7_Pos               7                                                       /*!< GPIO_PORT SET: SETP7 Position           */
#define GPIO_PORT_SET_SETP7_Msk               (0x01UL << GPIO_PORT_SET_SETP7_Pos)                     /*!< GPIO_PORT SET: SETP7 Mask               */
#define GPIO_PORT_SET_SETP8_Pos               8                                                       /*!< GPIO_PORT SET: SETP8 Position           */
#define GPIO_PORT_SET_SETP8_Msk               (0x01UL << GPIO_PORT_SET_SETP8_Pos)                     /*!< GPIO_PORT SET: SETP8 Mask               */
#define GPIO_PORT_SET_SETP9_Pos               9                                                       /*!< GPIO_PORT SET: SETP9 Position           */
#define GPIO_PORT_SET_SETP9_Msk               (0x01UL << GPIO_PORT_SET_SETP9_Pos)                     /*!< GPIO_PORT SET: SETP9 Mask               */
#define GPIO_PORT_SET_SETP10_Pos              10                                                      /*!< GPIO_PORT SET: SETP10 Position          */
#define GPIO_PORT_SET_SETP10_Msk              (0x01UL << GPIO_PORT_SET_SETP10_Pos)                    /*!< GPIO_PORT SET: SETP10 Mask              */
#define GPIO_PORT_SET_SETP11_Pos              11                                                      /*!< GPIO_PORT SET: SETP11 Position          */
#define GPIO_PORT_SET_SETP11_Msk              (0x01UL << GPIO_PORT_SET_SETP11_Pos)                    /*!< GPIO_PORT SET: SETP11 Mask              */
#define GPIO_PORT_SET_SETP12_Pos              12                                                      /*!< GPIO_PORT SET: SETP12 Position          */
#define GPIO_PORT_SET_SETP12_Msk              (0x01UL << GPIO_PORT_SET_SETP12_Pos)                    /*!< GPIO_PORT SET: SETP12 Mask              */
#define GPIO_PORT_SET_SETP13_Pos              13                                                      /*!< GPIO_PORT SET: SETP13 Position          */
#define GPIO_PORT_SET_SETP13_Msk              (0x01UL << GPIO_PORT_SET_SETP13_Pos)                    /*!< GPIO_PORT SET: SETP13 Mask              */
#define GPIO_PORT_SET_SETP14_Pos              14                                                      /*!< GPIO_PORT SET: SETP14 Position          */
#define GPIO_PORT_SET_SETP14_Msk              (0x01UL << GPIO_PORT_SET_SETP14_Pos)                    /*!< GPIO_PORT SET: SETP14 Mask              */
#define GPIO_PORT_SET_SETP15_Pos              15                                                      /*!< GPIO_PORT SET: SETP15 Position          */
#define GPIO_PORT_SET_SETP15_Msk              (0x01UL << GPIO_PORT_SET_SETP15_Pos)                    /*!< GPIO_PORT SET: SETP15 Mask              */
#define GPIO_PORT_SET_SETP16_Pos              16                                                      /*!< GPIO_PORT SET: SETP16 Position          */
#define GPIO_PORT_SET_SETP16_Msk              (0x01UL << GPIO_PORT_SET_SETP16_Pos)                    /*!< GPIO_PORT SET: SETP16 Mask              */
#define GPIO_PORT_SET_SETP17_Pos              17                                                      /*!< GPIO_PORT SET: SETP17 Position          */
#define GPIO_PORT_SET_SETP17_Msk              (0x01UL << GPIO_PORT_SET_SETP17_Pos)                    /*!< GPIO_PORT SET: SETP17 Mask              */
#define GPIO_PORT_SET_SETP18_Pos              18                                                      /*!< GPIO_PORT SET: SETP18 Position          */
#define GPIO_PORT_SET_SETP18_Msk              (0x01UL << GPIO_PORT_SET_SETP18_Pos)                    /*!< GPIO_PORT SET: SETP18 Mask              */
#define GPIO_PORT_SET_SETP19_Pos              19                                                      /*!< GPIO_PORT SET: SETP19 Position          */
#define GPIO_PORT_SET_SETP19_Msk              (0x01UL << GPIO_PORT_SET_SETP19_Pos)                    /*!< GPIO_PORT SET: SETP19 Mask              */
#define GPIO_PORT_SET_SETP20_Pos              20                                                      /*!< GPIO_PORT SET: SETP20 Position          */
#define GPIO_PORT_SET_SETP20_Msk              (0x01UL << GPIO_PORT_SET_SETP20_Pos)                    /*!< GPIO_PORT SET: SETP20 Mask              */
#define GPIO_PORT_SET_SETP21_Pos              21                                                      /*!< GPIO_PORT SET: SETP21 Position          */
#define GPIO_PORT_SET_SETP21_Msk              (0x01UL << GPIO_PORT_SET_SETP21_Pos)                    /*!< GPIO_PORT SET: SETP21 Mask              */
#define GPIO_PORT_SET_SETP22_Pos              22                                                      /*!< GPIO_PORT SET: SETP22 Position          */
#define GPIO_PORT_SET_SETP22_Msk              (0x01UL << GPIO_PORT_SET_SETP22_Pos)                    /*!< GPIO_PORT SET: SETP22 Mask              */
#define GPIO_PORT_SET_SETP23_Pos              23                                                      /*!< GPIO_PORT SET: SETP23 Position          */
#define GPIO_PORT_SET_SETP23_Msk              (0x01UL << GPIO_PORT_SET_SETP23_Pos)                    /*!< GPIO_PORT SET: SETP23 Mask              */
#define GPIO_PORT_SET_SETP24_Pos              24                                                      /*!< GPIO_PORT SET: SETP24 Position          */
#define GPIO_PORT_SET_SETP24_Msk              (0x01UL << GPIO_PORT_SET_SETP24_Pos)                    /*!< GPIO_PORT SET: SETP24 Mask              */
#define GPIO_PORT_SET_SETP25_Pos              25                                                      /*!< GPIO_PORT SET: SETP25 Position          */
#define GPIO_PORT_SET_SETP25_Msk              (0x01UL << GPIO_PORT_SET_SETP25_Pos)                    /*!< GPIO_PORT SET: SETP25 Mask              */
#define GPIO_PORT_SET_SETP26_Pos              26                                                      /*!< GPIO_PORT SET: SETP26 Position          */
#define GPIO_PORT_SET_SETP26_Msk              (0x01UL << GPIO_PORT_SET_SETP26_Pos)                    /*!< GPIO_PORT SET: SETP26 Mask              */
#define GPIO_PORT_SET_SETP27_Pos              27                                                      /*!< GPIO_PORT SET: SETP27 Position          */
#define GPIO_PORT_SET_SETP27_Msk              (0x01UL << GPIO_PORT_SET_SETP27_Pos)                    /*!< GPIO_PORT SET: SETP27 Mask              */
#define GPIO_PORT_SET_SETP28_Pos              28                                                      /*!< GPIO_PORT SET: SETP28 Position          */
#define GPIO_PORT_SET_SETP28_Msk              (0x01UL << GPIO_PORT_SET_SETP28_Pos)                    /*!< GPIO_PORT SET: SETP28 Mask              */
#define GPIO_PORT_SET_SETP29_Pos              29                                                      /*!< GPIO_PORT SET: SETP29 Position          */
#define GPIO_PORT_SET_SETP29_Msk              (0x01UL << GPIO_PORT_SET_SETP29_Pos)                    /*!< GPIO_PORT SET: SETP29 Mask              */
#define GPIO_PORT_SET_SETP30_Pos              30                                                      /*!< GPIO_PORT SET: SETP30 Position          */
#define GPIO_PORT_SET_SETP30_Msk              (0x01UL << GPIO_PORT_SET_SETP30_Pos)                    /*!< GPIO_PORT SET: SETP30 Mask              */
#define GPIO_PORT_SET_SETP31_Pos              31                                                      /*!< GPIO_PORT SET: SETP31 Position          */
#define GPIO_PORT_SET_SETP31_Msk              (0x01UL << GPIO_PORT_SET_SETP31_Pos)                    /*!< GPIO_PORT SET: SETP31 Mask              */

