roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* ----------------------------------  SGPIO_REG  --------------------------------- */
#define SGPIO_REG_REG_Pos                     0                                                       /*!< SGPIO REG: REG Position                 */
#define SGPIO_REG_REG_Msk                     (0xffffffffUL << SGPIO_REG_REG_Pos)                     /*!< SGPIO REG: REG Mask                     */

/* --------------------------------  SGPIO_REG_SS  -------------------------------- */
#define SGPIO_REG_SS_REG_SS_Pos               0                                                       /*!< SGPIO REG_SS: REG_SS Position           */
#define SGPIO_REG_SS_REG_SS_Msk               (0xffffffffUL << SGPIO_REG_SS_REG_SS_Pos)               /*!< SGPIO REG_SS: REG_SS Mask               */

/* --------------------------------  SGPIO_PRESET  -------------------------------- */
#define SGPIO_PRESET_PRESET_Pos               0                                                       /*!< SGPIO PRESET: PRESET Position           */
#define SGPIO_PRESET_PRESET_Msk               (0x00000fffUL << SGPIO_PRESET_PRESET_Pos)               /*!< SGPIO PRESET: PRESET Mask               */

/* ---------------------------------  SGPIO_COUNT  -------------------------------- */
#define SGPIO_COUNT_COUNT_Pos                 0                                                       /*!< SGPIO COUNT: COUNT Position             */
#define SGPIO_COUNT_COUNT_Msk                 (0x00000fffUL << SGPIO_COUNT_COUNT_Pos)                 /*!< SGPIO COUNT: COUNT Mask                 */

/* ----------------------------------  SGPIO_POS  --------------------------------- */
#define SGPIO_POS_POS_Pos                     0                                                       /*!< SGPIO POS: POS Position                 */
#define SGPIO_POS_POS_Msk                     (0x000000ffUL << SGPIO_POS_POS_Pos)                     /*!< SGPIO POS: POS Mask                     */
#define SGPIO_POS_POS_RESET_Pos               8                                                       /*!< SGPIO POS: POS_RESET Position           */
#define SGPIO_POS_POS_RESET_Msk               (0x000000ffUL << SGPIO_POS_POS_RESET_Pos)               /*!< SGPIO POS: POS_RESET Mask               */

/* --------------------------------  SGPIO_MASK_A  -------------------------------- */
#define SGPIO_MASK_A_MASK_A_Pos               0                                                       /*!< SGPIO MASK_A: MASK_A Position           */
#define SGPIO_MASK_A_MASK_A_Msk               (0xffffffffUL << SGPIO_MASK_A_MASK_A_Pos)               /*!< SGPIO MASK_A: MASK_A Mask               */

/* --------------------------------  SGPIO_MASK_H  -------------------------------- */
#define SGPIO_MASK_H_MASK_H_Pos               0                                                       /*!< SGPIO MASK_H: MASK_H Position           */
#define SGPIO_MASK_H_MASK_H_Msk               (0xffffffffUL << SGPIO_MASK_H_MASK_H_Pos)               /*!< SGPIO MASK_H: MASK_H Mask               */

/* --------------------------------  SGPIO_MASK_I  -------------------------------- */
#define SGPIO_MASK_I_MASK_I_Pos               0                                                       /*!< SGPIO MASK_I: MASK_I Position           */
#define SGPIO_MASK_I_MASK_I_Msk               (0xffffffffUL << SGPIO_MASK_I_MASK_I_Pos)               /*!< SGPIO MASK_I: MASK_I Mask               */

/* --------------------------------  SGPIO_MASK_P  -------------------------------- */
#define SGPIO_MASK_P_MASK_P_Pos               0                                                       /*!< SGPIO MASK_P: MASK_P Position           */
#define SGPIO_MASK_P_MASK_P_Msk               (0xffffffffUL << SGPIO_MASK_P_MASK_P_Pos)               /*!< SGPIO MASK_P: MASK_P Mask               */

/* ------------------------------  SGPIO_GPIO_INREG  ------------------------------ */
#define SGPIO_GPIO_INREG_GPIO_INi_Pos         0                                                       /*!< SGPIO GPIO_INREG: GPIO_INi Position     */
#define SGPIO_GPIO_INREG_GPIO_INi_Msk         (0x0000ffffUL << SGPIO_GPIO_INREG_GPIO_INi_Pos)         /*!< SGPIO GPIO_INREG: GPIO_INi Mask         */

/* ------------------------------  SGPIO_GPIO_OUTREG  ----------------------------- */
#define SGPIO_GPIO_OUTREG_GPIO_OUT_Pos        0                                                       /*!< SGPIO GPIO_OUTREG: GPIO_OUT Position    */
#define SGPIO_GPIO_OUTREG_GPIO_OUT_Msk        (0x0000ffffUL << SGPIO_GPIO_OUTREG_GPIO_OUT_Pos)        /*!< SGPIO GPIO_OUTREG: GPIO_OUT Mask        */

/* ------------------------------  SGPIO_GPIO_OENREG  ----------------------------- */
#define SGPIO_GPIO_OENREG_GPIO_OE_Pos         0                                                       /*!< SGPIO GPIO_OENREG: GPIO_OE Position     */
#define SGPIO_GPIO_OENREG_GPIO_OE_Msk         (0x0000ffffUL << SGPIO_GPIO_OENREG_GPIO_OE_Pos)         /*!< SGPIO GPIO_OENREG: GPIO_OE Mask         */

/* ------------------------------  SGPIO_CTRL_ENABLE  ----------------------------- */
#define SGPIO_CTRL_ENABLE_CTRL_EN_Pos         0                                                       /*!< SGPIO CTRL_ENABLE: CTRL_EN Position     */
#define SGPIO_CTRL_ENABLE_CTRL_EN_Msk         (0x0000ffffUL << SGPIO_CTRL_ENABLE_CTRL_EN_Pos)         /*!< SGPIO CTRL_ENABLE: CTRL_EN Mask         */

/* -----------------------------  SGPIO_CTRL_DISABLE  ----------------------------- */
#define SGPIO_CTRL_DISABLE_CTRL_DIS_Pos       0                                                       /*!< SGPIO CTRL_DISABLE: CTRL_DIS Position   */
#define SGPIO_CTRL_DISABLE_CTRL_DIS_Msk       (0x0000ffffUL << SGPIO_CTRL_DISABLE_CTRL_DIS_Pos)       /*!< SGPIO CTRL_DISABLE: CTRL_DIS Mask       */

/* -------------------------------  SGPIO_CLR_EN_0  ------------------------------- */
#define SGPIO_CLR_EN_0_CLR_SCI_Pos            0                                                       /*!< SGPIO CLR_EN_0: CLR_SCI Position        */
#define SGPIO_CLR_EN_0_CLR_SCI_Msk            (0x0000ffffUL << SGPIO_CLR_EN_0_CLR_SCI_Pos)            /*!< SGPIO CLR_EN_0: CLR_SCI Mask            */

/* -------------------------------  SGPIO_SET_EN_0  ------------------------------- */
#define SGPIO_SET_EN_0_SET_SCI_Pos            0                                                       /*!< SGPIO SET_EN_0: SET_SCI Position        */
#define SGPIO_SET_EN_0_SET_SCI_Msk            (0x0000ffffUL << SGPIO_SET_EN_0_SET_SCI_Pos)            /*!< SGPIO SET_EN_0: SET_SCI Mask            */

/* -------------------------------  SGPIO_ENABLE_0  ------------------------------- */
#define SGPIO_ENABLE_0_ENABLE_SCI_Pos         0                                                       /*!< SGPIO ENABLE_0: ENABLE_SCI Position     */
#define SGPIO_ENABLE_0_ENABLE_SCI_Msk         (0x0000ffffUL << SGPIO_ENABLE_0_ENABLE_SCI_Pos)         /*!< SGPIO ENABLE_0: ENABLE_SCI Mask         */

/* -------------------------------  SGPIO_STATUS_0  ------------------------------- */
#define SGPIO_STATUS_0_STATUS_SCI_Pos         0                                                       /*!< SGPIO STATUS_0: STATUS_SCI Position     */
#define SGPIO_STATUS_0_STATUS_SCI_Msk         (0x0000ffffUL << SGPIO_STATUS_0_STATUS_SCI_Pos)         /*!< SGPIO STATUS_0: STATUS_SCI Mask         */

/* -----------------------------  SGPIO_CLR_STATUS_0  ----------------------------- */
#define SGPIO_CLR_STATUS_0_CLR_STATUS_SCI_Pos 0                                                       /*!< SGPIO CLR_STATUS_0: CLR_STATUS_SCI Position */
#define SGPIO_CLR_STATUS_0_CLR_STATUS_SCI_Msk (0x0000ffffUL << SGPIO_CLR_STATUS_0_CLR_STATUS_SCI_Pos) /*!< SGPIO CLR_STATUS_0: CLR_STATUS_SCI Mask */

/* -----------------------------  SGPIO_SET_STATUS_0  ----------------------------- */
#define SGPIO_SET_STATUS_0_SET_STATUS_SCI_Pos 0                                                       /*!< SGPIO SET_STATUS_0: SET_STATUS_SCI Position */
#define SGPIO_SET_STATUS_0_SET_STATUS_SCI_Msk (0x0000ffffUL << SGPIO_SET_STATUS_0_SET_STATUS_SCI_Pos) /*!< SGPIO SET_STATUS_0: SET_STATUS_SCI Mask */

