roboknight/lpcopen/periph_sct_pwm/rc5_example/recv/inc/nxp_lpc43xx.h
/* -----------------------------  SGPIO_SET_STATUS_3  ----------------------------- */
#define SGPIO_SET_STATUS_3_SET_STATUS_INPI_Pos 0                                                      /*!< SGPIO SET_STATUS_3: SET_STATUS_INPI Position */
#define SGPIO_SET_STATUS_3_SET_STATUS_INPI_Msk (0x0000ffffUL << SGPIO_SET_STATUS_3_SET_STATUS_INPI_Pos)/*!< SGPIO SET_STATUS_3: SET_STATUS_INPI Mask */



/* ================================================================================ */
/* ================              Peripheral memory map             ================ */
/* ================================================================================ */

#define LPC_SCT_BASE                    0x40000000UL
#define LPC_GPDMA_BASE                  0x40002000UL
#define LPC_SPIFI_BASE                  0x40003000UL
#define LPC_SDMMC_BASE                  0x40004000UL
#define LPC_EMC_BASE                    0x40005000UL
#define LPC_USB0_BASE                   0x40006000UL
#define LPC_USB1_BASE                   0x40007000UL
#define LPC_LCD_BASE                    0x40008000UL
#define LPC_EEPROM_BASE                 0x4000E000UL
#define LPC_ETHERNET_BASE               0x40010000UL
#define LPC_ATIMER_BASE                 0x40040000UL
#define LPC_REGFILE_BASE                0x40041000UL
#define LPC_PMC_BASE                    0x40042000UL
#define LPC_CREG_BASE                   0x40043000UL
#define LPC_EVENTROUTER_BASE            0x40044000UL
#define LPC_RTC_BASE                    0x40046000UL
#define LPC_CGU_BASE                    0x40050000UL
#define LPC_CCU1_BASE                   0x40051000UL
#define LPC_CCU2_BASE                   0x40052000UL
#define LPC_RGU_BASE                    0x40053000UL
#define LPC_WWDT_BASE                   0x40080000UL
#define LPC_USART0_BASE                 0x40081000UL
#define LPC_USART2_BASE                 0x400C1000UL
#define LPC_USART3_BASE                 0x400C2000UL
#define LPC_UART1_BASE                  0x40082000UL
#define LPC_SSP0_BASE                   0x40083000UL
#define LPC_SSP1_BASE                   0x400C5000UL
#define LPC_TIMER0_BASE                 0x40084000UL
#define LPC_TIMER1_BASE                 0x40085000UL
#define LPC_TIMER2_BASE                 0x400C3000UL
#define LPC_TIMER3_BASE                 0x400C4000UL
#define LPC_SCU_BASE                    0x40086000UL
#define LPC_GPIO_PIN_INT_BASE           0x40087000UL
#define LPC_GPIO_GROUP_INT0_BASE        0x40088000UL
#define LPC_GPIO_GROUP_INT1_BASE        0x40089000UL
#define LPC_MCPWM_BASE                  0x400A0000UL
#define LPC_I2C0_BASE                   0x400A1000UL
#define LPC_I2C1_BASE                   0x400E0000UL
#define LPC_I2S0_BASE                   0x400A2000UL
#define LPC_I2S1_BASE                   0x400A3000UL
#define LPC_C_CAN1_BASE                 0x400A4000UL
#define LPC_RITIMER_BASE                0x400C0000UL
#define LPC_QEI_BASE                    0x400C6000UL
#define LPC_GIMA_BASE                   0x400C7000UL
#define LPC_DAC_BASE                    0x400E1000UL
#define LPC_C_CAN0_BASE                 0x400E2000UL
#define LPC_ADC0_BASE                   0x400E3000UL
#define LPC_ADC1_BASE                   0x400E4000UL
#define LPC_ADCHS_BASE                  0x400F0000UL
#define LPC_GPIO_PORT_BASE              0x400F4000UL
#define LPC_SPI_BASE                    0x40100000UL
#define LPC_SGPIO_BASE                  0x40101000UL


/* ================================================================================ */
/* ================             Peripheral declaration             ================ */
/* ================================================================================ */

#define LPC_SCT                         ((LPC_SCT_Type            *) LPC_SCT_BASE)
#define LPC_GPDMA                       ((LPC_GPDMA_Type          *) LPC_GPDMA_BASE)
#define LPC_SPIFI                       ((LPC_SPIFI_Type          *) LPC_SPIFI_BASE)
#define LPC_SDMMC                       ((LPC_SDMMC_Type          *) LPC_SDMMC_BASE)
#define LPC_EMC                         ((LPC_EMC_Type            *) LPC_EMC_BASE)
#define LPC_USB0                        ((LPC_USB0_Type           *) LPC_USB0_BASE)
#define LPC_USB1                        ((LPC_USB1_Type           *) LPC_USB1_BASE)
#define LPC_LCD                         ((LPC_LCD_Type            *) LPC_LCD_BASE)
#define LPC_EEPROM                      ((LPC_EEPROM_Type         *) LPC_EEPROM_BASE)
#define LPC_ETHERNET                    ((LPC_ETHERNET_Type       *) LPC_ETHERNET_BASE)
#define LPC_ATIMER                      ((LPC_ATIMER_Type         *) LPC_ATIMER_BASE)
#define LPC_REGFILE                     ((LPC_REGFILE_Type        *) LPC_REGFILE_BASE)
#define LPC_PMC                         ((LPC_PMC_Type            *) LPC_PMC_BASE)
#define LPC_CREG                        ((LPC_CREG_Type           *) LPC_CREG_BASE)
#define LPC_EVENTROUTER                 ((LPC_EVENTROUTER_Type    *) LPC_EVENTROUTER_BASE)
#define LPC_RTC                         ((LPC_RTC_Type            *) LPC_RTC_BASE)
#define LPC_CGU                         ((LPC_CGU_Type            *) LPC_CGU_BASE)
#define LPC_CCU1                        ((LPC_CCU1_Type           *) LPC_CCU1_BASE)
#define LPC_CCU2                        ((LPC_CCU2_Type           *) LPC_CCU2_BASE)
#define LPC_RGU                         ((LPC_RGU_Type            *) LPC_RGU_BASE)
#define LPC_WWDT                        ((LPC_WWDT_Type           *) LPC_WWDT_BASE)
#define LPC_USART0                      ((LPC_USARTn_Type         *) LPC_USART0_BASE)
#define LPC_USART2                      ((LPC_USARTn_Type         *) LPC_USART2_BASE)
#define LPC_USART3                      ((LPC_USARTn_Type         *) LPC_USART3_BASE)
#define LPC_UART1                       ((LPC_UART1_Type          *) LPC_UART1_BASE)
#define LPC_SSP0                        ((LPC_SSPn_Type           *) LPC_SSP0_BASE)
#define LPC_SSP1                        ((LPC_SSPn_Type           *) LPC_SSP1_BASE)
#define LPC_TIMER0                      ((LPC_TIMERn_Type         *) LPC_TIMER0_BASE)
#define LPC_TIMER1                      ((LPC_TIMERn_Type         *) LPC_TIMER1_BASE)
#define LPC_TIMER2                      ((LPC_TIMERn_Type         *) LPC_TIMER2_BASE)
#define LPC_TIMER3                      ((LPC_TIMERn_Type         *) LPC_TIMER3_BASE)
#define LPC_SCU                         ((LPC_SCU_Type            *) LPC_SCU_BASE)
#define LPC_GPIO_PIN_INT                ((LPC_GPIO_PIN_INT_Type   *) LPC_GPIO_PIN_INT_BASE)
#define LPC_GPIO_GROUP_INT0             ((LPC_GPIO_GROUP_INTn_Type*) LPC_GPIO_GROUP_INT0_BASE)
#define LPC_GPIO_GROUP_INT1             ((LPC_GPIO_GROUP_INTn_Type*) LPC_GPIO_GROUP_INT1_BASE)
#define LPC_MCPWM                       ((LPC_MCPWM_Type          *) LPC_MCPWM_BASE)
#define LPC_I2C0                        ((LPC_I2Cn_Type           *) LPC_I2C0_BASE)
#define LPC_I2C1                        ((LPC_I2Cn_Type           *) LPC_I2C1_BASE)
#define LPC_I2S0                        ((LPC_I2Sn_Type           *) LPC_I2S0_BASE)
#define LPC_I2S1                        ((LPC_I2Sn_Type           *) LPC_I2S1_BASE)
#define LPC_C_CAN1                      ((LPC_C_CANn_Type         *) LPC_C_CAN1_BASE)
#define LPC_RITIMER                     ((LPC_RITIMER_Type        *) LPC_RITIMER_BASE)
#define LPC_QEI                         ((LPC_QEI_Type            *) LPC_QEI_BASE)
#define LPC_GIMA                        ((LPC_GIMA_Type           *) LPC_GIMA_BASE)
#define LPC_DAC                         ((LPC_DAC_Type            *) LPC_DAC_BASE)
#define LPC_C_CAN0                      ((LPC_C_CANn_Type         *) LPC_C_CAN0_BASE)
#define LPC_ADC0                        ((LPC_ADCn_Type           *) LPC_ADC0_BASE)
#define LPC_ADC1                        ((LPC_ADCn_Type           *) LPC_ADC1_BASE)
#define LPC_ADCHS                       ((LPC_ADCHS_Type          *) LPC_ADCHS_BASE)
#define LPC_GPIO_PORT                   ((LPC_GPIO_PORT_Type      *) LPC_GPIO_PORT_BASE)
#define LPC_SPI                         ((LPC_SPI_Type            *) LPC_SPI_BASE)
#define LPC_SGPIO                       ((LPC_SGPIO_Type          *) LPC_SGPIO_BASE)


/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group LPC43xx */
/** @} */ /* End of group (null) */

#ifdef __cplusplus
}
#endif


#endif  /* LPC43xx_H */

